{
    "results": [
        {
            "query": "analytical vaccine coverage calculation epidemic mean degree excess degree heterogeneous networks",
            "papers": [
                {
                    "paper_title": "Colloids at liquid interfaces: dynamics and organization",
                    "abstract": "This thesis deals with spherical microparticles trapped at liquid interfaces. It focuses on two aspects of their behavior: firstly, the effect of the curvature of a liquid interface on interparticle interactions and their organization; secondly, the mobility of particles at visco-elastic interfaces. In Chapter 2of this thesis we showed that it is possible to induce capillary interactions between spherical microparticles with homogeneous surface chemistry by tailoring the curvature of the liquid interface. If the interfacial curvature is anisotropic, the constraint of constant contact angle along the contact line can only be satisfied if the interface is deformed locally. These deformations create excess surface area, which changes when two particles approach each other. This leads to a change in the surface free energy, which manifests itself as a capillary interaction between the particles. To study the effect of curvature on the interactions between particles, we created oil-water interfaces of different shape (ellipsoid, dumbbell, torus and squares) and added spherical negatively charged particles that adsorbed at these interfaces. On all these interfaces, we observed quadrupolar capillary interactions that organized the particles into square lattices. The order of this organization increased with increasing curvature anisotropy, indicating that capillary interactions are stronger as well. By contrast, on flat interfaces or on spherical droplets with homogeneous curvature, no attractive interaction was observed and only at very high surface coverage did the particles order in a hexagonal lattice, as a result of repulsive interactions. In Chapter 3we studied the interface deformations around particles at curved interfaces and the resulting capillary interactions theoretically. We used the finite element method to solve the Young-Laplace equation for the shape of the interface around a particle and calculated the interaction potential between the particles numerically. The main finding of these calculations is that for an anisotropically curved interface, with two different local principal curvatures, the particle deforms the interface in two ways simultaneously: concave deformation along one principal direction and convex – along the other, thus creating a deformation field with quadrupolar symmetry. Two particles with such deformations interact favorably only if the overlapping deformations are similar (concave-concave, convex-convex), which occurs when they approach each other along one of the two principal directions. Since the two local principal directions are always perpendicular, particles interacting along them will tend to arrange into a square pattern. As a consequence of the quadrupolar deformation field, two particles approaching each other along a line forming 45 degrees with the principal axes will repel each other (which is confirmed by our observations), because in this case the deformation fields overlap with four different “petals” (2 pairs of concave-convex), and the excessive surface area doesn’t reduce upon approaching, but increases. A system of two particles oriented at an angle with respect to the principal axis is therefore subjected to a torque rotating the axis of the system so that it gets aligned with one of the two principal directions. The torque magnitude reaches its maximum when the system’s axis is at an angle of 45 degrees with respect to the principal direction and decreases to 0 when the axis is aligned with one of the principal directions. The family of interaction potentials we obtained allows for calculating the minimum deviatoric curvature needed to initialize capillary interactions strong enough to compete with thermal energy, so that a stable organization can be expected. The calculated value was very close to the deviatoric curvature where ordering was observed experimentally in Chapter 2. In Chapter 4we studied the mobility of 3 mm polystyrene particles in a monolayer of 1.5 mm core-shell microparticles deposited at flat air-water interfaces; all the particles present in the system were stabilized by negative charges. In this exploratory chapter we made an attempt to characterize the mechanical properties of such monolayers by analyzing the mobility of the larger tracer particles in the monolayer. With increasing particle density of the monolayer, we observed that the mean-square displacement of the tracer particles was reduced, which can be interpreted as an increase of the viscosity of the monolayer. At very high densities the motion of the particles became subdiffusive and confined, pointing at elasticity of the monolayer. We also studied correlated movements between neighboring particles in an attempt to do two-point interfacial microrheology. A comparison between the one-point and two-point methods shows clear indications of heterogeneous dynamics of the tracer particles. Our results therefore call for a further development of two-point microrheology at interfaces. In Chapter 5we used tracer particles to study the properties of thin cross-linked actin networks deposited at the surface of oil droplets. These networks are a model system for the intracellular actin cortex. We used the generalized Stokes-Einstein relation to extract the complex frequency-dependent shear modulus of such networks from the movement of the added tracer particles. We studied the effects of the length of actin filaments and the cross-linker concentration on the mechanical properties of these layers. The advantage of this system is that actin networks are freely accessible from the water phase, and therefore can be subjected to in-situ addition of cross-linkers, enzymes or other chemicals of interest. Using this, we managed to show strong stiffening after addition of myosin motor proteins and ATP, which we ascribed to contraction of the actin-myosin network.",
                    "citation": "D. Ershov (2014). Colloids at liquid interfaces: dynamics and organization. . DOI: 10.18174/299680",
                    "summary (tldr)": null
                }
            ],
            "summary": ""
        },
        {
            "query": "simulation epidemic vaccination strategies random targeted high-degree network",
            "papers": [
                {
                    "paper_title": "Impact of Vaccination Strategies For Epidemic Node-level SVIR Probabilistic Model : Pandemic simulation on social networks under various vaccination strategies",
                    "abstract": "Vaccination strategies could be considered as either a site percolation problem, or one state of a node, which is more suitable for studying the imperfect vaccination. This paper conducts vaccination simulation on classic strategies including random immunization, degree based immunization, and acquaintance based immunization. In addition, two innovative vaccination simulations, which are the first neighbor and the second neighbor strategies, are also applied. All the simulations are run by the node level probabilistic SVIR model under random, scale-free, and small world network. We aim at finding out the best strategies under limited vaccination resource and different conditions of disease spreading parameters.",
                    "citation": "C. Kuo, Wai Kin Victor Chan, Mengxuan Chen (2020). Impact of Vaccination Strategies For Epidemic Node-level SVIR Probabilistic Model : Pandemic simulation on social networks under various vaccination strategies. 2020 International Conference on Public Health and Data Science (ICPHDS), 290-296. DOI: 10.1109/ICPHDS51617.2020.00063",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper conducts vaccination simulation on classic strategies including random immunization, degree based Immunization, and acquaintance based immunization under random, scale-free, and small world network to find out the best strategies under limited vaccination resource and different conditions of disease spreading parameters."
                    }
                },
                {
                    "paper_title": "Comparing the impact of vaccination strategies on the spread of COVID-19, including a novel household-targeted vaccination strategy",
                    "abstract": "With limited availability of vaccines, an efficient use of the limited supply of vaccines in order to achieve herd immunity will be an important tool to combat the wide-spread prevalence of COVID-19. Here, we compare a selection of strategies for vaccine distribution, including a novel targeted vaccination approach (EHR) that provides a noticeable increase in vaccine impact on disease spread compared to age-prioritized and random selection vaccination schemes. Using high-fidelity individual-based computer simulations with Oslo, Norway as an example, we find that for a community reproductive number in a setting where the base pre-vaccination reproduction number R = 2.1 without population immunity, the EHR method reaches herd immunity at 48% of the population vaccinated with 90% efficiency, whereas the common age-prioritized approach needs 89%, and a population-wide random selection approach requires 61%. We find that age-based strategies have a substantially weaker impact on epidemic spread and struggle to achieve herd immunity under the majority of conditions. Furthermore, the vaccination of minors is essential to achieving herd immunity, even for ideal vaccines providing 100% protection.",
                    "citation": "André Voigt, S. Omholt, E. Almaas (2022). Comparing the impact of vaccination strategies on the spread of COVID-19, including a novel household-targeted vaccination strategy. PLoS ONE, 17. DOI: 10.1371/journal.pone.0263155",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A selection of strategies for vaccine distribution are compared, including a novel targeted vaccination approach (EHR) that provides a noticeable increase in vaccine impact on disease spread compared to age-prioritized and random selection vaccination schemes."
                    }
                },
                {
                    "paper_title": "Efficient vaccination strategies for epidemic control using network information",
                    "abstract": "Background: Network-based interventions are most powerful against epidemics when the full network structure is known. However, resource constraints often require decisions based on partial network data. We investigated how the effectiveness of network-based vaccination schemes varied based on the accuracy of network data available. Methods: We simulated propagating an SIR process on static empirical social networks from 75 rural Indian villages. First, we used regression analysis to predict the percentage of individuals ever infected (cumulative incidence) based on village-level networks. Second, we simulated vaccinating 10% of each village at baseline, selecting vaccinees using 1 of 5 network-based approaches: at random (Random); random contacts of random individuals (Nomination); random high-degree individuals (High Degree); highest degree (Highest Degree); or most central (Central). The first three approaches require only sample data; the latter two require full network data. We also simulated imposing a limit on how many contacts an individual can nominate (Fixed Choice Design, FCD), which reduces data collection burden but generates only partially observed networks. Results: We found the mean and standard deviation of the degree distribution to strongly predict cumulative incidence. In simulations, Nomination reduced cumulative incidence by one-sixth compared to Random vaccination; full network methods reduced infection by two-thirds. High Degree had intermediate effectiveness. Somewhat surprisingly, FCD truncating individuals' degrees at three was as effective as using complete networks. Conclusions: Using even partial network information to prioritize vaccines at either the village or individual level substantially improved epidemic outcomes. Such approaches may be feasible and effective in outbreak settings, and full ascertainment of network structure may not be required.",
                    "citation": "Yingrui Yang, Ashley McKhann, G. Harling... (2018). Efficient vaccination strategies for epidemic control using network information. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Using even partial network information to prioritize vaccines at either the village or individual level substantially improved epidemic outcomes, suggesting that such approaches may be feasible and effective in outbreak settings, and full ascertainment of network structure may not be required."
                    }
                },
                {
                    "paper_title": "Effective node vaccination and containing strategies to halt SIR epidemic spreading in real-world face-to-face contact networks",
                    "abstract": "We model the COVID-19 spreading by running SIR Monte-Carlo simulations in four real face-to-face contact networks. We evaluate the effectiveness of the ‘facemask use’ and ‘vaccination policies’ to curb epidemic spreading. We model the facemask use policy by assuming a lower individual infection probability $\\beta$. We found that while this strategy can delay the disease spreading, it does not significantly reduce the total number of infected individuals (TI), as 80% of the total population still is infected at the end of the epidemic. We model vaccination by setting individual's infection probability $\\beta=0$, which is equivalent to remove nodes/individuals from the network. The vaccination was found to be very effective. Even with a partial vaccination of 30% of the population nodes selected considering their centrality measure ranking, such as degree, betweenness, or PageRank, it was possible to reduce the TI of 14%. Finally, yet importantly, random partial vaccination is not effective at all, meaning that most of the unvaccinated population will be infected.",
                    "citation": "N. Nguyen, Thanh-Trung Nguyen, Tuan-Anh Nguyen... (2022). Effective node vaccination and containing strategies to halt SIR epidemic spreading in real-world face-to-face contact networks. 2022 RIVF International Conference on Computing and Communication Technologies (RIVF), 1-6. DOI: 10.1109/RIVF55975.2022.10013812",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work model the COVID-19 spreading by running SIR Monte-Carlo simulations in four real face-to-face contact networks and finds that the vaccination was found to be very effective and random partial vaccination is not effective, meaning that most of the unvaccinated population will be infected."
                    }
                },
                {
                    "paper_title": "Control of COVID-19 Pandemic: Vaccination Strategies Simulation under Probabilistic Node-Level Model",
                    "abstract": "This paper aims at constructing a probabilistic node-level time-dependent contagious disease spreading model for coronavirus disease (COVID-19) pandemic which is called SEINRVseinr by introducing exposed and asymptomatic infectious state, imperfect vaccination, reinfected possibility and weighted undirected graph for social network into the traditional probabilistic node-level Susceptible-Infectious-Recovered (SIR) network model. This paper simulates the effectiveness of five vaccination strategies (including random base, degree-target base, random acquaintance, first-neighbor and second neighbor strategies) in random network, small world network and scale-free network. Compared with the benchmark model, the results show that random acquaintance strategy is efficient strategy and neighbors’ strategies perform better in certain interval.",
                    "citation": "Mengxuan Chen, C. Kuo, Wai Kin Victor Chan (2021). Control of COVID-19 Pandemic: Vaccination Strategies Simulation under Probabilistic Node-Level Model. 2021 6th International Conference on Intelligent Computing and Signal Processing (ICSP), 119-125. DOI: 10.1109/ICSP51882.2021.9408970",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Results show that random acquaintance strategy is efficient strategy and neighbors’ strategies perform better in certain interval in the probabilistic node-level Susceptible-Infectious-Recovered (SIR) network model."
                    }
                },
                {
                    "paper_title": "Vaccination strategies in the disease–behavior evolution model",
                    "abstract": "Previous studies on the co-evolving between vaccination strategies and epidemics mainly assumed that the vaccination strategies were made in the period between two spreading seasons. However, individual cognition during the spreading seasons might also alter the vaccination strategy and inversely influence the epidemic spreading. We propose a coupled disease–behavior model to describe the dynamic evolution of vaccination behavior during the spread of infectious diseases. The model integrates a susceptible–infected–vaccinated (SIV) model with the diffusion of vaccination behavior. We focus on the trade-off between perceptions of infection risk and the vaccination behaviors of neighbors, characterizing individual vaccination opinions. We introduce an opinion-critical value to map vaccination opinions into vaccination behavior. The vaccination coverage of the disease–behavior model is studied in network models and real-world networks. In addition, when societal costs are measured based on the degree of initial vaccinees, the cost of randomly selecting initial vaccinees is lower than selecting individuals with high or low degrees as vaccinees. Evaluating an individual’s ability to transmit vaccination behavior based on the neighbor’s number is inappropriate. We find that the impact of effective spreading rates on group vaccination is not one-sided and that reducing fear and highlighting the dangers of infectious diseases are crucial to increasing vaccination coverage.",
                    "citation": "Lu Zhou, Jinying Dai, Bo Qu... (2024). Vaccination strategies in the disease–behavior evolution model. Frontiers in Physics. DOI: 10.3389/fphy.2024.1387267",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that the impact of effective spreading rates on group vaccination is not one-sided and that reducing fear and highlighting the dangers of infectious diseases are crucial to increasing vaccination coverage."
                    }
                },
                {
                    "paper_title": "Evaluation of vaccination strategies for SIR epidemics on random networks incorporating household structure",
                    "abstract": "This paper is concerned with the analysis of vaccination strategies in a stochastic susceptible →\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\rightarrow $$\\end{document} infected →\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\rightarrow $$\\end{document} removed model for the spread of an epidemic amongst a population of individuals with a random network of social contacts that is also partitioned into households. Under various vaccine action models, we consider both household-based vaccination schemes, in which the way in which individuals are chosen for vaccination depends on the size of the households in which they reside, and acquaintance vaccination, which targets individuals of high degree in the social network. For both types of vaccination scheme, assuming a large population with few initial infectives, we derive a threshold parameter which determines whether or not a large outbreak can occur and also the probability of a large outbreak and the fraction of the population infected by a large outbreak. The performance of these schemes is studied numerically, focusing on the influence of the household size distribution and the degree distribution of the social network. We find that acquaintance vaccination can significantly outperform the best household-based scheme if the degree distribution of the social network is heavy-tailed. For household-based schemes, when the vaccine coverage is insufficient to prevent a major outbreak and the vaccine is imperfect, we find situations in which both the probability and size of a major outbreak under the scheme which minimises the threshold parameter are larger than in the scheme which maximises the threshold parameter.",
                    "citation": "F. Ball, David Sirl (2016). Evaluation of vaccination strategies for SIR epidemics on random networks incorporating household structure. Journal of Mathematical Biology, 76, 483 - 530. DOI: 10.1007/s00285-017-1139-0",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that acquaintance vaccination can significantly outperform the best household-based scheme if the degree distribution of the social network is heavy-tailed and also the probability of a large outbreak and the fraction of the population infected by aLarge outbreak."
                    }
                }
            ],
            "summary": ""
        },
        {
            "query": "vaccine coverage threshold random vaccination network epidemic R0",
            "papers": [
                {
                    "paper_title": "Measures to assess a warning vaccination level in a stochastic SIV model with imperfect vaccine",
                    "abstract": "A stochastic Markovian Susceptible‐Infectious‐Susceptible (SIS) model, with infection reintroduction is considered to represent the evolution of an epidemic process within a finite population. Disease is assumed to be a contact disease whose effect can be prevented by a vaccine. Before the epidemic process emerges, v0$v_0$ individuals got vaccinated to assure that the population is protected by herd immunity. In consequence, we formulate the model by adding a new compartment for vaccine protected individuals. The administered vaccine is not a perfect one and consequently it fails in a proportion of vaccinated individuals that are not protected against the vaccine preventable communicable disease. Hence, while the infectious process is in progress, the initial vaccine coverage declines and herd immunity could be lost. A threshold on the size of the vaccinated group is included as a warning measure on the protection of the community. Our objective is to define and study random characteristics, depending on the vaccination eligible group, that could advise health authorities when to launch a new vaccination program to recover the initial immunity level.",
                    "citation": "M. Gamboa, M. Lopez-Herrero (2022). Measures to assess a warning vaccination level in a stochastic SIV model with imperfect vaccine. Studies in Applied Mathematics, 148, 1411 - 1438. DOI: 10.1111/sapm.12479",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Random characteristics, depending on the vaccination eligible group, that could advise health authorities when to launch a new vaccination program to recover the initial immunity level are defined and study."
                    }
                },
                {
                    "paper_title": "Population heterogeneity in vaccine coverage impacts epidemic thresholds and bifurcation dynamics.",
                    "abstract": "Population heterogeneity, especially in individuals' contact networks, plays an important role in transmission dynamics of infectious diseases. For vaccine-preventable diseases, outstanding issues like vaccine hesitancy and availability of vaccines further lead to nonuniform coverage among groups, not to mention the efficacy of vaccines and the mixing pattern varying from one group to another. As the ongoing COVID-19 pandemic transitions to endemicity, it is of interest and significance to understand the impact of aforementioned population heterogeneity on the emergence and persistence of epidemics. Here we analyze epidemic thresholds and characterize bifurcation dynamics by accounting for heterogeneity caused by group-dependent characteristics, including vaccination rate and efficacy as well as disease transmissibility. Our analysis shows that increases in the difference in vaccination coverage among groups can render multiple equilibria of disease burden to exist even if the overall basic reproductive ratio is below one (also known as backward bifurcation). The presence of other heterogeneity factors such as differences in vaccine efficacy, transmission, mixing pattern, and group size can each exhibit subtle impacts on bifurcation. We find that heterogeneity in vaccine efficacy can undermine the condition for backward bifurcations whereas homophily tends to aggravate disease endemicity. Our results have practical implications for improving public health efforts by addressing the role of population heterogeneity in the spread and control of diseases.",
                    "citation": "Alina Glaubitz, F. Fu (2022). Population heterogeneity in vaccine coverage impacts epidemic thresholds and bifurcation dynamics.. ArXiv. DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This analysis shows that increases in the difference in vaccination coverage among groups can render multiple equilibria of disease burden to exist even if the overall basic reproductive ratio is below one (also known as backward bifurcation)."
                    }
                },
                {
                    "paper_title": "Stability and Threshold Dynamics in a Seasonal Mathematical Model for Measles Outbreaks with Double-Dose Vaccination",
                    "abstract": "Measles is a highly contagious viral disease that can lead to serious complications, including death, particularly in young children. In this study, we developed a mathematical model that incorporates a seasonal transmission parameter to examine the measles transmission dynamics. We define the basic reproduction number (R0) and show its utility as a threshold parameter for global dynamics and the existence of periodic solutions. The model was applied to the measles outbreak that occurred in Pakistan from 2019 to 2021 and provided a good fit to the observed data. Our estimate of the basic reproduction number was found to be greater than one, indicating that the disease will persist in the population. The findings highlight the need to increase vaccination coverage and efficacy to mitigate the impact of the epidemic. The model also shows the long-term behavior of the disease, which becomes endemic and recurs annually. Our simulations demonstrate that a shorter incubation period accelerates the spread of the disease, while a higher vaccination coverage rate reduces its impact. The importance of the second dose of the measles vaccine is emphasized, and a higher vaccine efficacy rate can also help bring R0 below one. Our study provides valuable information for the development and implementation of effective measles control strategies. To prevent future outbreaks, increasing vaccination coverage among the population is the most effective way to reduce the transmission of measles.",
                    "citation": "M. A. Ibrahim, A. Dénes (2023). Stability and Threshold Dynamics in a Seasonal Mathematical Model for Measles Outbreaks with Double-Dose Vaccination. Mathematics. DOI: 10.3390/math11081791",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A mathematical model that incorporates a seasonal transmission parameter to examine the measles transmission dynamics and defines the basic reproduction number (R0) and shows its utility as a threshold parameter for global dynamics and the existence of periodic solutions."
                    }
                },
                {
                    "paper_title": "Genetic characterization and estimated 4CMenB vaccine strain coverage of 284 Neisseria meningitidis isolates causing invasive meningococcal disease in Argentina in 2010–2014",
                    "abstract": "ABSTRACT Meningococcal (Neisseria meningitidis) serogroup B (MenB) strain antigens are diverse and a limited number of strains can be evaluated using the human serum bactericidal antibody (hSBA) assay. The genetic Meningococcal Antigen Typing System (gMATS) was developed to predict the likelihood of coverage for large numbers of isolates by the 4CMenB vaccine, which includes antigens Neisseria adhesin A (NadA), Neisserial Heparin-Binding Antigen (NHBA), factor H-binding protein (fHbp), and Porin A (PorA). In this study, we characterized by whole-genome analyses 284 invasive MenB isolates collected from 2010 to 2014 by the Argentinian National Laboratories Network (52–61 isolates per year). Strain coverage was estimated by gMATS on all isolates and by hSBA assay on 74 randomly selected isolates, representative of the whole panel. The four most common clonal complexes (CCs), accounting for 81.3% of isolates, were CC-865 (75 isolates, 26.4%), CC-32 (59, 20.8%), CC-35 (59, 20.8%), and CC-41/44 (38, 13.4%). Vaccine antigen genotyping showed diversity. The most prevalent variants/peptides were fHbp variant 2, NHBA peptides 24, 21, and 2, and PorA variable region 2 profiles 16–36 and 14. The nadA gene was present in 66 (23.2%) isolates. Estimated strain coverage by hSBA assay showed 78.4% of isolates were killed by pooled adolescent sera, and 51.4% and 64.9% (based on two different thresholds) were killed by pooled infant sera. Estimated coverage by gMATS (61.3%; prediction interval: 55.5%, 66.7%) was consistent with the infant hSBA assay results. Continued genomic surveillance is needed to evaluate the persistence of major MenB CCs in Argentina. Plain Language Summary The most common clinical manifestations of invasive meningococcal disease include meningitis and septicemia, which can be deadly, and many survivors suffer long-term serious after-effects. Most cases of invasive meningococcal disease are caused by six meningococcal serogroups (types), including serogroup B. Although vaccines are available against meningococcal serogroup B infection, these vaccines target antigens that are highly diverse. Consequently, the effectiveness of vaccination may vary from country to country because the meningococcal serogroup B strains circulating in particular regions carry different forms of the target vaccine antigens. This means it is important to test serogroup B strains isolated from specific populations to estimate the percentage of strains that a vaccine is likely to be effective against (known as ‘vaccine strain coverage’). The genetic Meningococcal Antigen Typing System (gMATS) was developed to predict strain coverage by the four-component meningococcal serogroup B vaccine, 4CMenB, against large numbers of serogroup B strains. In this study, we analyzed 284 invasive meningococcal serogroup B isolates collected between 2010 and 2014 in Argentina. Genetic analyses showed that the vaccine antigens of the isolates were diverse and some genetic characteristics had not been found in isolates from other countries. However, vaccine strain coverage estimated by gMATS was consistent with that reported in other parts of the world and with strain coverage results obtained for a subset via another method, the human serum bactericidal antibody (hSBA) assay. These results highlight the need for continued monitoring of circulating bacterial strains to assess the estimated strain coverage of meningococcal serogroup B vaccines.",
                    "citation": "Adriana Efron, Alessandro Brozzi, A. Biolchi... (2024). Genetic characterization and estimated 4CMenB vaccine strain coverage of 284 Neisseria meningitidis isolates causing invasive meningococcal disease in Argentina in 2010–2014. Human Vaccines & Immunotherapeutics, 20. DOI: 10.1080/21645515.2024.2378537",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The genetic Meningococcal Antigen Typing System (gMATS) was developed to predict strain coverage by the four-component meningococcal serogroup B vaccine, 4CMenB, against large numbers of serogroup B strains, and coverage was consistent with that reported in other parts of the world."
                    }
                },
                {
                    "paper_title": "Herd immunity and epidemic size in networks with vaccination homophily.",
                    "abstract": "We study how the herd immunity threshold and the expected epidemic size depend on homophily with respect to vaccine adoption. We find that the presence of homophily considerably increases the critical vaccine coverage needed for herd immunity and that strong homophily can push the threshold entirely out of reach. The epidemic size monotonically increases as a function of homophily strength for a perfect vaccine, while it is maximized at a nontrivial level of homophily when the vaccine efficacy is limited. Our results highlight the importance of vaccination homophily in epidemic modeling.",
                    "citation": "Takayuki Hiraoka, A. K. Rizi, Mikko Kivelä... (2021). Herd immunity and epidemic size in networks with vaccination homophily.. Physical review. E, 105 5, \n          L052301\n        . DOI: 10.1103/PhysRevE.105.L052301",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that the presence of homophily considerably increases the critical vaccine coverage needed for herd immunity and that stronghomophily can push the threshold entirely out of reach."
                    }
                },
                {
                    "paper_title": "Contact Vaccination Study Using Edge Based Compartmental Model (EBCM) and Stochastic Simulation: An Application to Oral Poliovirus Vaccine (OPV)",
                    "abstract": null,
                    "citation": "C. Baldé, M. Lam, S. Bowong (2019). Contact Vaccination Study Using Edge Based Compartmental Model (EBCM) and Stochastic Simulation: An Application to Oral Poliovirus Vaccine (OPV). , 81-96. DOI: 10.1007/978-3-030-46306-9_6",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "There exists a critical vaccination rate above which transmission of Polio disease dies out from each network and high heterogeneity increases the threshold, demonstrating the consequences of network assumptions on predictions of the usefulness of oral poliovirus vaccine."
                    }
                },
                {
                    "paper_title": "Dynamics of a Stochastic SVEIR Epidemic Model with Nonlinear Incidence Rate",
                    "abstract": "This paper delves into the analysis of a stochastic epidemic model known as the susceptible–vaccinated–exposed–infectious–recovered (SVEIR) model, where transmission dynamics are governed by a nonlinear function. In the theoretical analysis section, by suitable stochastic Lyapunov functions, we establish that when the threshold value, denoted as R0s, falls below 1, the epidemic is destined for extinction. Conversely, if the reproduction number R0 of the deterministic model surpasses 1, the model manifests an ergodic endemic stationary distribution. In the numerical simulations and data interpretation section, leveraging a graphical analysis with COVID-19 data, we illustrate that random fluctuations possess the capacity to quell disease outbreaks, underscoring the role of vaccines in curtailing the spread of diseases. This study not only contributes to the understanding of epidemic dynamics but also highlights the pivotal role of stochasticity and vaccination strategies in epidemic control and management. The inherent balance and patterns observed in epidemic spread and control strategies, reflect a symmetrical interplay between stochasticity, vaccination, and disease dynamics.",
                    "citation": "Xinghao Wang, Liang Zhang, Xiao-Bing Zhang (2024). Dynamics of a Stochastic SVEIR Epidemic Model with Nonlinear Incidence Rate. Symmetry, 16, 467. DOI: 10.3390/sym16040467",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is illustrated that random fluctuations possess the capacity to quell disease outbreaks, underscoring the role of vaccines in curtailing the spread of diseases and highlighting the pivotal role of stochasticity and vaccination strategies in epidemic control and management."
                    }
                }
            ],
            "summary": ""
        },
        {
            "query": "vaccine threshold random vaccination epidemic network",
            "papers": [
                {
                    "paper_title": "Contact Vaccination Study Using Edge Based Compartmental Model (EBCM) and Stochastic Simulation: An Application to Oral Poliovirus Vaccine (OPV)",
                    "abstract": null,
                    "citation": "C. Baldé, M. Lam, S. Bowong (2019). Contact Vaccination Study Using Edge Based Compartmental Model (EBCM) and Stochastic Simulation: An Application to Oral Poliovirus Vaccine (OPV). , 81-96. DOI: 10.1007/978-3-030-46306-9_6",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "There exists a critical vaccination rate above which transmission of Polio disease dies out from each network and high heterogeneity increases the threshold, demonstrating the consequences of network assumptions on predictions of the usefulness of oral poliovirus vaccine."
                    }
                },
                {
                    "paper_title": "Viral Kinetics of Symptomatic COVID-19 Cases Infected with the Ancestral Strain and Omicron BA.2",
                    "abstract": "Background: Assessment of viral kinetics of SARS-CoV-2 may inform host immune responses to and transmission potential of the virus. Temporal profiles of viral shedding remain unclear in relation to patient characteristics, type of virus and vaccination status including vaccine type. Methods: We analyzed longitudinal data on cycle threshold (Ct) values of reverse transcription quantitative polymerase chain reaction (RT-qPCR) assays conducted for symptomatic COVID-19 patients at confirmation and during hospital isolation in Hong Kong during three major epidemic waves predominated by the ancestral strain or Omicron BA.2, and modeled the temporal trajectories of viral burden in these patients. Findings: Among 19,205 symptomatic COVID-19 cases confirmed from July 1, 2020 to May 22, 2022, the estimated viral burden from a random-effects model indicated a longer duration of viral shedding in more severe and older cases. Vaccinated individuals with a breakthrough infection of Omicron BA.2 had a generally lower viral burden following onset and shorter durations of viral shedding (mean difference of 2-4 days) than the unvaccinated Omicron cases particularly in more recently vaccinated patients. Marginal differences in viral burden following onset and the duration of viral shedding were observed between unvaccinated cases infected with the ancestral strain and Omicron BA.2. Interpretation: The viral kinetics characterized in our study demonstrated that previously vaccinated younger individuals with a milder infection shed less viruses in a shorter period implying possible transmission dynamics of COVID-19 and protective mechanisms of vaccination against infection and severe outcomes. Funding Information: This study was supported by the Health and Medical Research Fund from the Health Bureau of the Government of the Hong Kong Special Administrative Region (grant no. CID-HKU2) and the Collaborative Research Fund from the Research Grants Council of the Hong Kong Special Administrative Region (grant no. C7123- 20G).",
                    "citation": "Yun Lin, Peng Wu, T. Tsang... (2022). Viral Kinetics of Symptomatic COVID-19 Cases Infected with the Ancestral Strain and Omicron BA.2. SSRN Electronic Journal. DOI: 10.2139/ssrn.4282943",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The viral kinetics characterized in this study demonstrated that previously vaccinated younger individuals with a milder infection shed less viruses in a shorter period implying possible transmission dynamics of COVID-19 and protective mechanisms of vaccination against infection and severe outcomes."
                    }
                },
                {
                    "paper_title": "Estimating the epidemic threshold under individual vaccination behaviour and adaptive social connections: A game-theoretic complex network model",
                    "abstract": "Information dissemination intricately intertwines with the dynamics of infectious diseases in the contemporary interconnected world. Recognizing the critical role of public awareness, individual vaccination choices appear to be an essential factor in collective efforts against emerging health threats. This study aims to characterize disease transmission dynamics under evolving social connections, information sharing, and individual vaccination decisions. To address this important problem, we present an integrated behaviour-prevalence model on an adaptive multiplex network. While the physical layer (layer-II) focuses on disease transmission under vaccination, the virtual layer (layer-I), representing individuals' social contacts, is adaptive and deals with information dissemination, resulting in the dynamics of vaccination choice in a socially influenced environment. Utilizing the microscopic Markov Chain Method (MMCM), we derive analytical expressions of the epidemic threshold for populations with different levels of perceived vaccine risk. It indicates that the adaptive nature of social contacts contributes to the higher epidemic threshold compared to non-adaptive scenarios, and numerical simulations also support that. The network topology, such as the power-law exponent of a scale-free network, also significantly influences the spreading of infections in the network population. We also observe that vaccine uptake increases proportionately with the number of individuals with a higher perceived infection risk or a higher sensitivity of an individual to their non-vaccinated neighbours. As a result, our findings provide insights for public health officials in developing vaccination programs in light of the evolution of social connections, information dissemination, and vaccination choice in the digital era.",
                    "citation": "Viney Kumar, Chris T. Bauch, Samit Bhattacharyya (2024). Estimating the epidemic threshold under individual vaccination behaviour and adaptive social connections: A game-theoretic complex network model. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is observed that vaccine uptake increases proportionately with the number of individuals with a higher perceived infection risk or a higher sensitivity of an individual to their non-vaccinated neighbours."
                    }
                },
                {
                    "paper_title": "A game theoretic complex network model to estimate the epidemic threshold under individual vaccination behaviour and adaptive social connections",
                    "abstract": "In today’s interconnected world, the spread of information is closely linked to infectious disease dynamics. Public awareness plays a crucial role, as individual vaccination decisions significantly impact collective efforts to combat emerging health threats. This study explores disease transmission within a framework integrating social connections, information sharing, and individual vaccination decisions. We introduce a behaviour-prevalence model on an adaptive multiplex network, where the physical layer (Layer-II) captures disease transmission under vaccination. In contrast, the virtual layer (Layer-I) represents adaptive social contacts and the flow of information, shaping vaccination decisions within a socially influenced environment. We derive analytical expressions for the epidemic threshold using the microscopic Markov Chain Method (MMCM). Simulation results highlight that adaptive social contacts lead to a higher epidemic threshold than non-adaptive networks. Additionally, network characteristics, such as the power-law exponent in scale-free networks, significantly impact infection spread within populations. Our results reveal that changes in perceived infection risk and an individual’s sensitivity to non-vaccinated neighbour’s status strongly influence vaccine uptake across populations. These insights can guide public health officials in developing targeted vaccination programs that address the evolving dynamics of social connections, information dissemination, and vaccination choice in the digital era.",
                    "citation": "Viney Kumar, Chris T. Bauch, Samit Bhattacharyya (2024). A game theoretic complex network model to estimate the epidemic threshold under individual vaccination behaviour and adaptive social connections. Scientific Reports, 14. DOI: 10.1038/s41598-024-79771-8",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results reveal that changes in perceived infection risk and an individual’s sensitivity to non-vaccinated neighbour’s status strongly influence vaccine uptake across populations, and can guide public health officials in developing targeted vaccination programs that address the evolving dynamics of social connections, information dissemination, and vaccination choice in the digital era."
                    }
                },
                {
                    "paper_title": "Epidemic spread, parameter sensitivity and vaccination strategies on a random graph with overlapping communities",
                    "abstract": "Our main goal is to examine the role of communities in epidemic spread in a random graph model. More precisely, we consider a random graph model which consists of overlapping complete graphs, representing households, workplaces, school classes, and which also has a simple geometric structure. We study the model's sensitivity to infection parameters and other tunable parameters of the model, which might be helpful in finding efficient social distancing strategies. We also quantitatively compare different vaccination strategies to see which order is the best to defend the most vulnerable groups or the population in general, and how important it is to gather and use information on the position of infected individuals in the network.",
                    "citation": "'Agnes Backhausz, Gyorgy J. Sz'ekely (2023). Epidemic spread, parameter sensitivity and vaccination strategies on a random graph with overlapping communities. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The main goal is to examine the role of communities in epidemic spread in a random graph model, which consists of overlapping complete graphs, representing households, workplaces, school classes, and which also has a simple geometric structure."
                    }
                },
                {
                    "paper_title": "Vaccination intentions of hypertensive Chinese individuals during the COVID-19 epidemic: a structural equation modeling study",
                    "abstract": "Objective Given the high prevalence of hypertension among Chinese adults, this population is at a significantly increased risk of severe COVID-19 complications. The purpose of this study is to assess the willingness of Chinese hypertensive adults to receive the COVID-19 vaccine and to identify the diverse factors that shape their vaccination decisions. Methods Sampling was conducted utilizing multistage stratified random sampling, and ultimately, a total of 886 adult hypertensive patients from Luzhou City in Southwest China were included in this study. The questionnaire design was based on the Theory of Planned Behaviour and was used to investigate their willingness to be vaccinated with COVID-19. Structural equation modeling was employed for data analysis. Results The results showed that 75.6% of hypertensive individuals were willing to receive COVID-19 vaccination. The structural equation modeling revealed that Subjective Norms (path coefficient = 0.361, CR = 8.049, P  < 0.001) and Attitudes (path coefficient = 0.253, CR = 4.447, P  < 0.001) had positive effects on vaccination willingness, while Perceived Behavioral Control (path coefficient=-0.004, CR=-0.127, P  = 0.899) had no significant impact on Behavioral Attitudes. Mediation analysis indicated that Knowledge (indirect path coefficient = 0.032, LLCI = 0.014, ULCI = 0.058), Risk Perception (indirect path coefficient = 0.077, LLCI = 0.038, ULCI = 0.124), and Subjective Norms (indirect path coefficient = 0.044, LLCI = 0.019, ULCI = 0.087) significantly influenced vaccination willingness through Attitudes as a mediating factor. Conclusion The willingness of hypertensive individuals to receive the COVID-19 vaccination is not satisfactory. The Theory of Planned Behavior provides valuable insights into understanding their vaccination intentions. Efforts should be concentrated on enhancing the subjective norms, attitudes, and knowledge about vaccination of hypertensive patients.",
                    "citation": "Zhi Lei, Dongyang Liu, Minghui Li... (2024). Vaccination intentions of hypertensive Chinese individuals during the COVID-19 epidemic: a structural equation modeling study. BMC Infectious Diseases, 24. DOI: 10.1186/s12879-024-09480-0",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The willingness of hypertensive individuals to receive the COVID-19 vaccination is not satisfactory, and efforts should be concentrated on enhancing the subjective norms, attitudes, and knowledge about vaccination of hypertensive patients."
                    }
                },
                {
                    "paper_title": "Predicting epidemic threshold in complex networks by graph neural network.",
                    "abstract": "To achieve precision in predicting an epidemic threshold in complex networks, we have developed a novel threshold graph neural network (TGNN) that takes into account both the network topology and the spreading dynamical process, which together contribute to the epidemic threshold. The proposed TGNN could effectively and accurately predict the epidemic threshold in homogeneous networks, characterized by a small variance in the degree distribution, such as Erdős-Rényi random networks. Usability has also been validated when the range of the effective spreading rate is altered. Furthermore, extensive experiments in ER networks and scale-free networks validate the adaptability of the TGNN to different network topologies without the necessity for retaining. The adaptability of the TGNN is further validated in real-world networks.",
                    "citation": "Wu Wang, Cong Li, Bo Qu... (2024). Predicting epidemic threshold in complex networks by graph neural network.. Chaos, 34 6. DOI: 10.1063/5.0209912",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The proposed TGNN could effectively and accurately predict the epidemic threshold in homogeneous networks, characterized by a small variance in the degree distribution, such as Erdős-Rényi random networks."
                    }
                }
            ],
            "summary": ""
        },
        {
            "query": "targeted vaccination network epidemic",
            "papers": [
                {
                    "paper_title": "A targeted vaccination strategy based on dynamic community detection for epidemic networks",
                    "abstract": null,
                    "citation": "Laasri Nadia, D. Lotfi, Ahmed Drissi El Maliani (2024). A targeted vaccination strategy based on dynamic community detection for epidemic networks. Social Network Analysis and Mining, 14, 1-16. DOI: 10.1007/s13278-024-01292-z",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A vaccination strategy that starts with community detection in a dynamic epidemic network, then uses centrality measures to identify spreaders in communities, who are then targeted for vaccination, making it a promising approach for future epidemic control."
                    }
                },
                {
                    "paper_title": "Modelling the impact of social distancing and targeted vaccination on the spread of COVID-19 through a real city-scale contact network",
                    "abstract": "Abstract We use mobile device data to construct empirical interpersonal physical contact networks in the city of Portland, Oregon, both before and after social distancing measures were enacted during the COVID-19 pandemic. These networks reveal how social distancing measures and the public’s reaction to the incipient pandemic affected the connectivity patterns within the city. We find that as the pandemic developed there was a substantial decrease in the number of individuals with many contacts. We further study the impact of these different network topologies on the spread of COVID-19 by simulating an SEIR epidemic model over these networks and find that the reduced connectivity greatly suppressed the epidemic. We then investigate how the epidemic responds when part of the population is vaccinated, and we compare two vaccination distribution strategies, both with and without social distancing. Our main result is that the heavy-tailed degree distribution of the contact networks causes a targeted vaccination strategy that prioritizes high-contact individuals to reduce the number of cases far more effectively than a strategy that vaccinates individuals at random. Combining both targeted vaccination and social distancing leads to the greatest reduction in cases, and we also find that the marginal benefit of a targeted strategy as compared to a random strategy exceeds the marginal benefit of social distancing for reducing the number of cases. These results have important implications for ongoing vaccine distribution efforts worldwide.",
                    "citation": "Gavin Hartnett, E. Parker, Tim Gulden... (2021). Modelling the impact of social distancing and targeted vaccination on the spread of COVID-19 through a real city-scale contact network. Journal of Complex Networks, 9. DOI: 10.1093/comnet/cnab042",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The main result is that the heavy-tailed degree distribution of the contact networks causes a targeted vaccination strategy that prioritizes high-contact individuals to reduce the number of cases far more effectively than a strategy that vaccinates individuals at random."
                    }
                },
                {
                    "paper_title": "Spatio-temporal waves and targeted vaccination in recurrent epidemic network models",
                    "abstract": null,
                    "citation": "Anna Litvak-Hinenzon, L. Stone (2009). Spatio-temporal waves and targeted vaccination in recurrent epidemic network models. Journal of The Royal Society Interface, 6, 749 - 760. DOI: 10.1098/rsif.2008.0343",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The controversial origins of long-term recurrent oscillations believed to be characteristic of diseases that have a period of temporary immunity after infection are explored, focusing on sexually transmitted diseases such as syphilis, where this controversy is currently under review."
                    }
                },
                {
                    "paper_title": "Epidemic Waves, Small Worlds and Targeted Vaccination",
                    "abstract": "The success of an infectious disease to invade a population is strongly controlled by the population's specific connectivity structure. Here a network model is presented as an aid in understanding the role of social behavior and heterogeneous connectivity in determining the spatio-temporal patterns of disease dynamics. We explore the controversial origins of long-term recurrent oscillations believed to be characteristic to diseases that have a period of temporary immunity after infection. In particular, we focus on sexually transmitted diseases such as syphilis, where this controversy is currently under review. Although temporary immunity plays a key role, it is found that in realistic small-world networks, the social and sexual behavior of individuals also has great influence in generating long-term cycles. The model generates circular waves of infection with unusual spatial dynamics that depend on focal areas that act as pacemakers in the population. Eradication of the disease can be efficiently achieved by eliminating the pacemakers with a targeted vaccination scheme. A simple difference equation model is derived, that captures the infection dynamics of the network model and gives insights into their origins and their eradication through vaccination.",
                    "citation": "Anna Litvak-Hinenzon, L. Stone (2007). Epidemic Waves, Small Worlds and Targeted Vaccination. arXiv: Cellular Automata and Lattice Gases. DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A network model is presented as an aid in understanding the role of social behavior and heterogeneous connectivity in determining the spatio-temporal patterns of disease dynamics, and the controversial origins of long-term recurrent oscillations believed to be characteristic to diseases that have a period of temporary immunity after infection."
                    }
                },
                {
                    "paper_title": "A multi-layer network model to assess school opening policies during the COVID-19 vaccination campaign",
                    "abstract": "We propose a multi-layer network model for the spread of COVID-19 that accounts for interactions within the family, between schoolmates, and casual contacts in the population. We utilize the proposed model-calibrated on epidemiological and demographic data-to investigate current questions concerning the implementation of non-pharmaceutical interventions (NPIs) during the vaccination campaign. Specifically, we consider scenarios in which the most fragile population has already received the vaccine, and we focus our analysis on the role of schools as drivers of the contagions and on the implementation of targeted intervention policies oriented to children and their families. We perform our analysis by means of a campaign of Monte Carlo simulations. Our findings suggest that, in a phase with NPIs enacted but in-person education, children play a key role in the spreading of COVID-19. Interestingly, we show that children's testing might be an important tool to flatten the epidemic curve, in particular when combined with enacting temporary online education for classes in which infected students are detected. Finally, we test a vaccination strategy that prioritizes the members of large families and we demonstrate its good performance. We believe that our modeling framework and our findings could be of help for public health authorities for planning their current and future interventions, as well as to increase preparedness for future epidemic outbreaks.",
                    "citation": "C. Bongiorno, Lorenzo Zino (2021). A multi-layer network model to assess school opening policies during the COVID-19 vaccination campaign. ArXiv, abs/2103.12519. DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is suggested that, in a phase with NPIs enacted but in-person education, children play a key role in the spreading of COVID-19, and children's testing might be an important tool to flatten the epidemic curve."
                    }
                },
                {
                    "paper_title": "Effect of Vaccination in the Computer Network for Distributed Attacks - A Dynamic Model",
                    "abstract": null,
                    "citation": "Yerra Shankar Rao, H. Saini, Geetanjali Rathee... (2019). Effect of Vaccination in the Computer Network for Distributed Attacks - A Dynamic Model. . DOI: 10.1007/978-981-13-9942-8_17",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The effect of vaccination on performance of the controlling strategy of malicious objects in the network is examined and the simulated result produced has become compatible with the overall theoretical analysis."
                    }
                },
                {
                    "paper_title": "Preferential imitation of vaccinating behavior can invalidate the targeted subsidy on complex network",
                    "abstract": "We consider the effect of inducement to vaccinate during the spread of an infectious disease on complex networks. Suppose that public resources are finite and that only a small proportion of individuals can be vaccinated freely (complete subsidy), for the remainder of the population vaccination is a voluntary behavior --- and each vaccinated individual carries a perceived cost. We ask whether the classical targeted subsidy strategy is definitely better than the random strategy: does targeting subsidy at individuals perceived to be with the greatest risk actually help? With these questions, we propose a model to investigate the \\emph{interaction effects} of the subsidy policies and individuals responses when facing subsidy policies on the epidemic dynamics on complex networks. In the model, a small proportion of individuals are freely vaccinated according to either the targeted or random subsidy policy, the remainder choose to vaccinate (or not) based on voluntary principle and update their vaccination decision via an imitation rule. Our findings show that the targeted strategy is only advantageous when individuals prefer to imitate the subsidized individuals' strategy. Otherwise, the effect of the targeted policy is worse than the random immunization, since individuals preferentially select non-subsidized individuals as the imitation objects. More importantly, we find that under the targeted subsidy policy, increasing the proportion of subsidized individuals may increase the final epidemic size. We further define social cost as the sum of the costs of vaccination and infection, and study how each of the two policies affect the social cost. Our result shows that there exist some optimal intermediate regions leading to the minimal social cost.",
                    "citation": "Haifeng Zhang, Panpan Shu, M. Tang... (2015). Preferential imitation of vaccinating behavior can invalidate the targeted subsidy on complex network. ArXiv, abs/1503.08048. DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The findings show that under the targeted subsidy policy, increasing the proportion of subsidized individuals may increase the final epidemic size, and define social cost as the sum of the costs of vaccination and infection, and study how each of the two policies affect the social cost."
                    }
                }
            ],
            "summary": ""
        },
        {
            "query": "epidemic threshold network vaccination",
            "papers": [
                {
                    "paper_title": "Estimating the epidemic threshold under individual vaccination behaviour and adaptive social connections: A game-theoretic complex network model",
                    "abstract": "Information dissemination intricately intertwines with the dynamics of infectious diseases in the contemporary interconnected world. Recognizing the critical role of public awareness, individual vaccination choices appear to be an essential factor in collective efforts against emerging health threats. This study aims to characterize disease transmission dynamics under evolving social connections, information sharing, and individual vaccination decisions. To address this important problem, we present an integrated behaviour-prevalence model on an adaptive multiplex network. While the physical layer (layer-II) focuses on disease transmission under vaccination, the virtual layer (layer-I), representing individuals' social contacts, is adaptive and deals with information dissemination, resulting in the dynamics of vaccination choice in a socially influenced environment. Utilizing the microscopic Markov Chain Method (MMCM), we derive analytical expressions of the epidemic threshold for populations with different levels of perceived vaccine risk. It indicates that the adaptive nature of social contacts contributes to the higher epidemic threshold compared to non-adaptive scenarios, and numerical simulations also support that. The network topology, such as the power-law exponent of a scale-free network, also significantly influences the spreading of infections in the network population. We also observe that vaccine uptake increases proportionately with the number of individuals with a higher perceived infection risk or a higher sensitivity of an individual to their non-vaccinated neighbours. As a result, our findings provide insights for public health officials in developing vaccination programs in light of the evolution of social connections, information dissemination, and vaccination choice in the digital era.",
                    "citation": "Viney Kumar, Chris T. Bauch, Samit Bhattacharyya (2024). Estimating the epidemic threshold under individual vaccination behaviour and adaptive social connections: A game-theoretic complex network model. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is observed that vaccine uptake increases proportionately with the number of individuals with a higher perceived infection risk or a higher sensitivity of an individual to their non-vaccinated neighbours."
                    }
                },
                {
                    "paper_title": "A game theoretic complex network model to estimate the epidemic threshold under individual vaccination behaviour and adaptive social connections",
                    "abstract": "In today’s interconnected world, the spread of information is closely linked to infectious disease dynamics. Public awareness plays a crucial role, as individual vaccination decisions significantly impact collective efforts to combat emerging health threats. This study explores disease transmission within a framework integrating social connections, information sharing, and individual vaccination decisions. We introduce a behaviour-prevalence model on an adaptive multiplex network, where the physical layer (Layer-II) captures disease transmission under vaccination. In contrast, the virtual layer (Layer-I) represents adaptive social contacts and the flow of information, shaping vaccination decisions within a socially influenced environment. We derive analytical expressions for the epidemic threshold using the microscopic Markov Chain Method (MMCM). Simulation results highlight that adaptive social contacts lead to a higher epidemic threshold than non-adaptive networks. Additionally, network characteristics, such as the power-law exponent in scale-free networks, significantly impact infection spread within populations. Our results reveal that changes in perceived infection risk and an individual’s sensitivity to non-vaccinated neighbour’s status strongly influence vaccine uptake across populations. These insights can guide public health officials in developing targeted vaccination programs that address the evolving dynamics of social connections, information dissemination, and vaccination choice in the digital era.",
                    "citation": "Viney Kumar, Chris T. Bauch, Samit Bhattacharyya (2024). A game theoretic complex network model to estimate the epidemic threshold under individual vaccination behaviour and adaptive social connections. Scientific Reports, 14. DOI: 10.1038/s41598-024-79771-8",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results reveal that changes in perceived infection risk and an individual’s sensitivity to non-vaccinated neighbour’s status strongly influence vaccine uptake across populations, and can guide public health officials in developing targeted vaccination programs that address the evolving dynamics of social connections, information dissemination, and vaccination choice in the digital era."
                    }
                },
                {
                    "paper_title": "Influence of negative information dissemination and vaccination behavioral decision-making on epidemic spreading in a three-layer network",
                    "abstract": "Information plays a crucial role in guiding behavioral decisions during public health emergencies. Individuals communicate to acquire relevant knowledge about an epidemic, which influences their decisions to adopt protective measures. However, whether to disseminate specific information is also a behavioral decision. In light of this understanding, we develop a coupled information–vaccination–epidemic model to depict these co-evolutionary dynamics in a three-layer network. Negative information dissemination and vaccination are treated as separate decision-making processes. We then examine the combined effects of herd and risk motives on information dissemination and vaccination decisions through the lens of game theory. The microscopic Markov chain approach (MMCA) is used to describe the dynamic process and to derive the epidemic threshold. Simulation results indicate that increasing the cost of negative information dissemination and providing timely clarification can effectively control the epidemic. Furthermore, a phenomenon of diminishing marginal utility is observed as the cost of dissemination increases, suggesting that authorities do not need to overinvest in suppressing negative information. Conversely, reducing the cost of vaccination and increasing vaccine efficacy emerge as more effective strategies for outbreak control. In addition, we find that the scale of the epidemic is greater when the herd motive dominates behavioral decision-making. In conclusion, this study provides a new perspective for understanding the complexity of epidemic spreading by starting with the construction of different behavioral decisions.",
                    "citation": "L. Huo 霍, Leyao 乐瑶 Yin 尹 (2025). Influence of negative information dissemination and vaccination behavioral decision-making on epidemic spreading in a three-layer network. Chinese Physics B, 34. DOI: 10.1088/1674-1056/adc402",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A coupled information–vaccination–epidemic model is developed to depict these co-evolutionary dynamics in a three-layer network and finds that the scale of the epidemic is greater when the herd motive dominates behavioral decision-making."
                    }
                },
                {
                    "paper_title": "Epidemic Model and Mathematical Study of Impact of Vaccination for the Control of Malware in Computer Network",
                    "abstract": "Malware remains a significant threat to computer network.  In this paper, we consideredthe problem which computer malware cause to personal computers with its control by proposing a compartmental model SVEIRS (Susceptible Vaccinated-Exposed-infected-Recovered-Susceptible) for malware transmission in computer network using nonlinear ordinary differential equation. Through the analysis of the model, the basic reproduction number  were obtained, and the malware free equilibrium was proved to be locally asymptotical stable if  is less than unity and globally asymptotically stable if Ro is less than some threshold using a Lyapunov function. Also, the unique endemic equilibrium exists under certain conditions and the model underwent backward bifurcation phenomenon. To illustrate our theoretical analysis, some numerical simulation of the system was performed with RungeKutta fourth order (KR4) method in Mathlab. This was used in analyzing the behavior of different compartments of the model and the results showed that vaccination and treatment is very essential for malware control.",
                    "citation": "T. Chinebu, Ikechukwu Valentine Udegbe, A. C. Eberendu (2021). Epidemic Model and Mathematical Study of Impact of Vaccination for the Control of Malware in Computer Network. Journal of Advances in Mathematics and Computer Science, 72-96. DOI: 10.9734/jamcs/2021/v36i330348",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results showed that vaccination and treatment is very essential for malware control, and the malware free equilibrium was proved to be locally asymptotical stable if Ro is less than some threshold using a Lyapunov function."
                    }
                },
                {
                    "paper_title": "Site-bond percolation model of epidemic spreading with vaccination in complex networks",
                    "abstract": null,
                    "citation": "Shuping Li, Xiaorong Zhao, Ruixia Zhang (2022). Site-bond percolation model of epidemic spreading with vaccination in complex networks. Journal of Mathematical Biology, 85. DOI: 10.1007/s00285-022-01816-1",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that the epidemic threshold increases while the average outbreak size decreases with vaccination probability, and the size of giant component S in homogeneous networks becomes largest for large transmissibility T(T close to 1)."
                    }
                },
                {
                    "paper_title": "Physics-Informed Neural Networks for Optimal Vaccination Plan in SIR Epidemic Models",
                    "abstract": "This work focuses on understanding the minimum eradication time for the controlled Susceptible-Infectious-Recovered (SIR) model in the time-homogeneous setting, where the infection and recovery rates are constant. The eradication time is defined as the earliest time the infectious population drops below a given threshold and remains below it. For time-homogeneous models, the eradication time is well-defined due to the predictable dynamics of the infectious population, and optimal control strategies can be systematically studied. We utilize Physics-Informed Neural Networks (PINNs) to solve the partial differential equation (PDE) governing the eradication time and derive the corresponding optimal vaccination control. The PINN framework enables a mesh-free solution to the PDE by embedding the dynamics directly into the loss function of a deep neural network. We use a variable scaling method to ensure stable training of PINN and mathematically analyze that this method is effective in our setting. This approach provides an efficient computational alternative to traditional numerical methods, allowing for an approximation of the eradication time and the optimal control strategy. Through numerical experiments, we validate the effectiveness of the proposed method in computing the minimum eradication time and achieving optimal control. This work offers a novel application of PINNs to epidemic modeling, bridging mathematical theory and computational practice for time-homogeneous SIR models.",
                    "citation": "Minseok Kim, Yeongjong Kim, Yeoneung Kim (2025). Physics-Informed Neural Networks for Optimal Vaccination Plan in SIR Epidemic Models. ArXiv, abs/2502.19890. DOI: 10.48550/arXiv.2502.19890",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel application of PINNs to epidemic modeling, bridging mathematical theory and computational practice for time-homogeneous SIR models and validation of the effectiveness of the proposed method in computing the minimum eradication time and achieving optimal control is validated."
                    }
                },
                {
                    "paper_title": "Modelling the Effect of Vaccination and Human Behaviour on the Spread of Epidemic Diseases on Temporal Networks",
                    "abstract": "Motivated by the increasing number of COVID-19 cases that have been observed in many countries after the vaccination campaign and relaxation of non-pharmaceutical interventions (NPIs), we propose a network model for the spread of recurrent epidemic diseases in a partially vaccinated population. The model encapsulates several realistic features, such as different vaccine efficacy against transmission and development of severe symptoms, testing practices, implementation of NPIs, isolation of detected individuals, and human behaviour. Using a mean-field approach, we analytically derive the epidemic threshold of the model and, if the system is below such a threshold, we compute the epidemic prevalence at the endemic equilibrium. These theoretical results show that precautious human behaviour and effective testing practices are key towards avoiding epidemic outbreaks. Interestingly, we found that, in many realistic scenarios, vaccination is successful in mitigating the outbreak by reducing the prevalence of seriously ill patients, but it could be a double-edged sword, favouring resurgent outbreaks, and it thus calls for higher testing rates, more cautiousness and responsibility among the population, or the reintroduction of NPIs to achieve full eradication.",
                    "citation": "Kathinka Frieswijk, Lorenzo Zino, Ming Cao (2021). Modelling the Effect of Vaccination and Human Behaviour on the Spread of Epidemic Diseases on Temporal Networks. 2022 European Control Conference (ECC), 2291-2296. DOI: 10.23919/ECC55457.2022.9838287",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Interestingly, it is found that, in many realistic scenarios, vaccination is successful in mitigating the outbreak by reducing the prevalence of seriously ill patients, but it could be a double-edged sword, favouring resurgent outbreaks, and it thus calls for higher testing rates, more cautiousness and responsibility among the population, or the reintroduction of NPIs to achieve full eradication."
                    }
                }
            ],
            "summary": ""
        },
        {
            "query": "targeted vaccination epidemic threshold degree-based SIR model network",
            "papers": [
                {
                    "paper_title": "A Degree Based Approximation of an SIR Model with Contact Tracing and Isolation",
                    "abstract": "—In this paper we study a susceptible infectious recovered (SIR) model with asymptomatic patients, contact tracing and isolation on a conﬁguration network. Using degree based approximation, we derive a system of differential equations for this model. This system can not be solved analytically. We present an early-time analysis for the model. The early-time analysis produces an epidemic threshold. On one side of the threshold, the disease dies out quickly. On the other side, a signiﬁcant fraction of population are infected. The threshold only depends on the parameters of the disease, the mean access degree of the network, and the fraction of asymptomatic patients. The threshold does not depend on the parameter of contact tracing and isolation policy. We present an approximate analysis which greatly reduces computational complexity. The nonlinear system derived from the approximation is not almost linear. We present a stability analysis for this system. We simulate the SIR model with contact tracing and isolation on ﬁve real-world networks. Simulation results show that contact tracing and isolation are useful to contain epidemics.",
                    "citation": "D. Lee, Tingwei Liu, Ruhui Zhang... (2022). A Degree Based Approximation of an SIR Model with Contact Tracing and Isolation. ArXiv, abs/2212.09093. DOI: 10.48550/arXiv.2212.09093",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Using degree based approximation, a system of differential equations for a susceptible infectious recovered (SIR) model with asymptomatic patients, contact tracing and isolation on a network is derived."
                    }
                },
                {
                    "paper_title": "Dynamical Analysis of an Improved Bidirectional Immunization SIR Model in Complex Network",
                    "abstract": "In order to investigate the impact of two immunization strategies—vaccination targeting susceptible individuals to reduce their infection rate and clinical medical interventions targeting infected individuals to enhance their recovery rate—on the spread of infectious diseases in complex networks, this study proposes a bilinear SIR infectious disease model that considers bidirectional immunization. By analyzing the conditions for the existence of endemic equilibrium points, we derive the basic reproduction numbers and outbreak thresholds for both homogeneous and heterogeneous networks. The epidemic model is then reconstructed and extensively analyzed using continuous-time Markov chain (CTMC) methods. This analysis includes the investigation of transition probabilities, transition rate matrices, steady-state distributions, and the transition probability matrix based on the embedded chain. In numerical simulations, a notable concordance exists between the outcomes of CTMC and mean-field (MF) simulations, thereby substantiating the efficacy of the CTMC model. Moreover, the CTMC-based model adeptly captures the inherent stochastic fluctuation in the disease transmission, which is consistent with the mathematical properties of Markov chains. We further analyze the relationship between the system’s steady-state infection density and the immunization rate through MCS. The results suggest that the infection density decreases with an increase in the immunization rate among susceptible individuals. The current research results will enhance our understanding of infectious disease transmission patterns in real-world scenarios, providing valuable theoretical insights for the development of epidemic prevention and control strategies.",
                    "citation": "Shixiang Han, Guanghui Yan, Huayan Pei... (2024). Dynamical Analysis of an Improved Bidirectional Immunization SIR Model in Complex Network. Entropy, 26. DOI: 10.3390/e26030227",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A bilinear SIR infectious disease model that considers bidirectional immunization is proposed that adeptly captures the inherent stochastic fluctuation in the disease transmission, which is consistent with the mathematical properties of Markov chains."
                    }
                },
                {
                    "paper_title": "Site-bond percolation model of epidemic spreading with vaccination in complex networks",
                    "abstract": null,
                    "citation": "Shuping Li, Xiaorong Zhao, Ruixia Zhang (2022). Site-bond percolation model of epidemic spreading with vaccination in complex networks. Journal of Mathematical Biology, 85. DOI: 10.1007/s00285-022-01816-1",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that the epidemic threshold increases while the average outbreak size decreases with vaccination probability, and the size of giant component S in homogeneous networks becomes largest for large transmissibility T(T close to 1)."
                    }
                },
                {
                    "paper_title": "A hierarchical intervention scheme based on epidemic severity in a community network",
                    "abstract": null,
                    "citation": "Runzi He, Xiao-feng Luo, Joshua Kiddy K. Asamoah... (2023). A hierarchical intervention scheme based on epidemic severity in a community network. Journal of Mathematical Biology, 87, 1-32. DOI: 10.1007/s00285-023-01964-y",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper quantitatively analyzed the impact of NIE on infectious disease transmission by establishing a four-dimensional SIR edge-based compartmental model with two communities and demonstrates the existence of positive equilibrium in a four-dimensional coupled system."
                    }
                },
                {
                    "paper_title": "Efficient Network-Based Vaccination Strategies for Epidemic Control",
                    "abstract": "This paper studies the control of epidemic processes over networks. Numerous studies have investigated various methods to prevent or reduce the spread of disease during an outbreak. One of the most common approaches is network-centrality-based, which is computationally expensive, especially in networks with time-varying configurations. This paper proposes a novel immunizing strategy to control epidemics with SIR and SEIR models. This low-computation method clusters the network into subsets and selects the nodes to be immunized based on their in/out-degrees in each cluster. Our proposed algorithm is designed not only based on the network’s centrality measures but also on the network’s clusters to investigate the epidemic flow in a lower-dimensional subset. The effectiveness of our proposed method is illustrated via several numerical simulations using benchmark examples.",
                    "citation": "Anahita Moradmand, Milad Siami, B. Shafai (2021). Efficient Network-Based Vaccination Strategies for Epidemic Control. 2021 World Automation Congress (WAC), 142-149. DOI: 10.23919/WAC50355.2021.9559612",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel immunizing strategy to control epidemics with SIR and SEIR models using a low-computation method that clusters the network into subsets and selects the nodes to be immunized based on their in/out-degrees in each cluster."
                    }
                },
                {
                    "paper_title": "Dynamical analysis of an enhanced epidemic model in complex network",
                    "abstract": "Population dynamics factors, such as the mobility of individuals, are inherently linked with the evolution of populations. Traditional network-based epidemic models operate under the assumption of a stable population size, often overlooking the impactful role of population mobility. Therefore, in this work, we present an enhanced SIR model, which incorporates population mobility and bidirectional immunization into the standard SIR model. Through theoretical analysis, we calculate the fundamental reproduction numbers and outbreak thresholds for both homogeneous and heterogeneous networks. The influence of two-way immunization and population mobility on the diffusion of infectious diseases is then examined via numerical simulations in both ER and BA networks. The simulation outcomes highlight the effectiveness of the outflow of infected and recovered individuals in curbing the extent of epidemics. Additionally, immunization measures targeting infected individuals not only shrink the transmission range of infectious diseases but also act to postpone the spread of epidemics. Notably, compared with homogeneous networks, infectious diseases have stronger transmission ability in heterogeneous networks, indicating heterogeneity of networks facilitates epidemic spreading.",
                    "citation": "Shixiang Han, Guanghui Yan, Wenwen Chang... (2023). Dynamical analysis of an enhanced epidemic model in complex network. 2023 5th International Academic Exchange Conference on Science and Technology Innovation (IAECST), 435-440. DOI: 10.1109/IAECST60924.2023.10503196",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work presents an enhanced SIR model, which incorporates population mobility and bidirectional immunization into the standard SIR model, and calculates the fundamental reproduction numbers and outbreak thresholds for both homogeneous and heterogeneous networks."
                    }
                },
                {
                    "paper_title": "Efficient analysis of node influence based on SIR model over huge complex networks",
                    "abstract": null,
                    "citation": "M. Kimura, Kazumi Saito, K. Ohara... (2014). Efficient analysis of node influence based on SIR model over huge complex networks. 2014 International Conference on Data Science and Advanced Analytics (DSAA), 216-222. DOI: 10.1109/DSAA.2014.7058076",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Main finding includes that different network structures have different epidemic thresholds and the node influence can identify influential nodes that the other centrality measures cannot."
                    }
                }
            ],
            "summary": "Based on the literature provided, I will consolidate key findings relevant to the query on targeted vaccination, epidemic threshold, degree-based SIR models, and networks. I will analyze the studies with focus on epidemic threshold determination, degree-based modeling or approximations, vaccination or immunization strategies (especially targeted), and their effect on epidemic control in networks.\n\n---\n\n### 1. Degree-Based SIR Modeling and Epidemic Thresholds\n\n**Lee et al. (2022)** propose a degree-based approximation of an SIR model incorporating asymptomatic cases, contact tracing, and isolation on a configuration (degree-heterogeneous) network. Key insights:\n\n- They derive a system of differential equations indexed by node degree.\n- Analytical solution is intractable, but an early-time linear stability analysis yields an **epidemic threshold**.\n- The threshold depends on:\n  - Disease parameters (infection and recovery rates),\n  - Mean degree of the network,\n  - Fraction of asymptomatic patients.\n- Interestingly, contact tracing and isolation parameters do **not** influence the threshold itself but do help contain the epidemic post-threshold.\n- This stresses that degree distribution (captured via mean degree) plays a central role in early epidemic outbreaks and threshold phenomena.\n- Simulations on real-world networks confirm that contact tracing/isolation reduce epidemic size post-threshold.\n\nThis work highlights that in degree-based SIR approximations, the epidemic threshold can be expressed explicitly from basic disease and network degree parameters, and targeted strategies should consider network degree distributions.\n\n---\n\n### 2. Vaccination and Immunization Strategies Impact on Epidemic Threshold\n\n**Han et al. (2024)** introduce an improved bilinear SIR model incorporating bidirectional immunization:\n\n- Vaccination targeting **susceptible** nodes reduces their infection rate.\n- Medical intervention targeting **infected** nodes improves recovery.\n- Their analysis yields basic reproduction numbers and outbreak thresholds for **homogeneous** and **heterogeneous** networks.\n- Theoretical framework uses continuous-time Markov chains (CTMC) capturing stochastic fluctuations realistically.\n- Numerical simulations reveal:\n  - Infection density decreases notably with increased immunization rates among susceptibles.\n  - This suggests that targeted vaccination at susceptible nodes effectively raises the epidemic threshold, delaying and reducing outbreaks.\n  \nTogether with Lee et al., these results show that vaccination among susceptible nodes effectively shifts threshold conditions, consistent across network heterogeneity.\n\n---\n\n### 3. Network-Based Vaccination Strategies Considering Structure\n\n**Moradmand et al. (2021)** propose a novel targeted immunization approach combining:\n\n- Clustering the network into subsets (communities),\n- Selecting nodes for vaccination based on **in/out-degree within clusters**, a low-computation alternative to pure centrality-based methods.\n  \nThey argue:\n\n- This approach lowers computational cost compared to centrality-based methods while capturing important topological features.\n- Clustering allows controlling epidemic flow within subnetworks, effectively containing spread in large or time-varying networks.\n  \nThis approach is practically relevant for degree-based SIR models, where vaccination of high-degree nodes in clusters may significantly increase epidemic threshold and reduce outbreak sizes.\n\n---\n\n### 4. Effects of Network Heterogeneity and Population Mobility\n\n**Han et al. (2023)** integrate population mobility and bidirectional immunization in an enhanced SIR framework:\n\n- They confirm stronger epidemic spreading in heterogeneous networks (e.g., scale-free) versus homogeneous.\n- Mobility of infected and recovered individuals (outflow) reduces epidemic size.\n- Immunization targeting infected nodes:\n  - Contracts disease transmission,\n  - Delays epidemic progression,\n  - Combined with network heterogeneity effects, suggests that targeted vaccination and isolation stratified by degree or state can optimize control.\n\n---\n\n### 5. Site-Bond Percolation and Percolation Thresholds with Vaccination\n\n**Li et al. (2022)** (no abstract, but from the title and journal) presumably use percolation theory to model epidemic spread incorporating vaccination on complex networks:\n\n- Site-bond percolation models inherently involve threshold phenomena related to network connectivity and vaccination coverage.\n- Targeted vaccination would effectively remove nodes (sites) or edges (bonds), increasing percolation thresholds and preventing giant component formation (epidemics).\n\nThis approach complements degree-based SIR models by providing a topological threshold interpretation.\n\n---\n\n### 6. Synthesis and Final Remarks\n\n- **Degree-based SIR models** can analytically or semi-analytically yield epidemic thresholds depending strongly on network mean degree and heterogeneity (Lee et al.).\n- **Targeted vaccination of susceptible nodes**, especially high-degree nodes, increases thresholds and reduces infection prevalence (Han et al. 2024, Moradmand et al.).\n- Combining vaccination with other controls like **contact tracing/isolation** reduces epidemic sizes but does not shift threshold as strongly (Lee et al. 2022).\n- Network clustering and low-computation targeted immunization strategies (based on in/out-degree in clusters) show promise for scalable control in large or dynamic networks (Moradmand et al.).\n- Mobility and heterogeneous network structure modulate threshold and epidemic dynamics significantly (Han et al. 2023).\n\n---\n\n### References\n\n- Lee D., Liu T., Zhang R., et al. (2022). A Degree Based Approximation of an SIR Model with Contact Tracing and Isolation. *ArXiv*. DOI: 10.48550/arXiv.2212.09093\n- Han S., Yan G., Pei H., et al. (2024). Dynamical Analysis of an Improved Bidirectional Immunization SIR Model in Complex Network. *Entropy*, 26. DOI: 10.3390/e26030227\n- Moradmand A., Siami M., Shafai B. (2021). Efficient Network-Based Vaccination Strategies for Epidemic Control. *2021 World Automation Congress*. DOI: 10.23919/WAC50355.2021.9559612\n- Han S., Yan G., Chang W., et al. (2023). Dynamical analysis of an enhanced epidemic model in complex network. *2023 IAECST*. DOI: 10.1109/IAECST60924.2023.10503196\n- Li S., Zhao X., Zhang R. (2022). Site-bond percolation model of epidemic spreading with vaccination in complex networks. *Journal of Mathematical Biology*, 85. DOI: 10.1007/s00285-022-01816-1\n\n---\n\n### Summary Answer\n\nIn degree-based SIR models on complex networks, the epidemic threshold fundamentally depends on disease parameters and the network degree distribution, particularly its mean. Targeted vaccination strategies focusing on high-degree (hub) susceptible nodes significantly increase this threshold and reduce epidemic size, as shown by bidirectional immunization models and targeted low-computation algorithms leveraging network clustering and local degree measures. Contact tracing and isolation help reduce epidemic prevalence but typically do not alter the early epidemic threshold. Incorporation of population mobility and heterogeneity further refines predictions, indicating that dynamic and heterogeneous networks require targeted, possibly cluster-based vaccination to control outbreaks efficiently.\n\n---\n\nIf you have specific questions within this scope or require deeper analysis on any paper or concept, please ask."
        },
        {
            "query": "herd immunity threshold random vaccination network R0 mean degree mean excess degree",
            "papers": [
                {
                    "paper_title": "The Impact of Contact Structure and Mixing on Control Measures and Disease-Induced Herd Immunity in Epidemic Models: A Mean-Field Model Perspective",
                    "abstract": "The contact structure of a population plays an important role in transmission of infection. Many ‘structured models’ capture aspects of the contact pattern through an underlying network or a mixing matrix. An important observation in unstructured models of a disease that confers immunity is that once a fraction 1-1/R0\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$1-1/{\\mathcal {R}}_0$$\\end{document} has been infected, the residual susceptible population can no longer sustain an epidemic. A recent observation of some structured models is that this threshold can be crossed with a smaller fraction of infected individuals, because the disease acts like a targeted vaccine, preferentially immunising higher-risk individuals who play a greater role in transmission. Therefore, a limited ‘first wave’ may leave behind a residual population that cannot support a second wave once interventions are lifted. In this paper, we set out to investigate this more systematically. While networks offer a flexible framework to model contact patterns explicitly, they suffer from several shortcomings: (i) high-fidelity network models require a large amount of data which can be difficult to harvest, and (ii) very few, if any, theoretical contact network models offer the flexibility to tune different contact network properties within the same framework. Therefore, we opt to systematically analyse a number of well-known mean-field models. These are computationally efficient and provide good flexibility in varying contact network properties such as heterogeneity in the number contacts, clustering and household structure or differentiating between local and global contacts. In particular, we consider the question of herd immunity under several scenarios. When modelling interventions as changes in transmission rates, we confirm that in networks with significant degree heterogeneity, the first wave of the epidemic confers herd immunity with significantly fewer infections than equivalent models with less or no degree heterogeneity. However, if modelling the intervention as a change in the contact network, then this effect may become much more subtle. Indeed, modifying the structure disproportionately can shield highly connected nodes from becoming infected during the first wave and therefore make the second wave more substantial. We strengthen this finding by using an age-structured compartmental model parameterised with real data and comparing lockdown periods implemented either as a global scaling of the mixing matrix or age-specific structural changes. Overall, we find that results regarding (disease-induced) herd immunity levels are strongly dependent on the model, the duration of the lockdown and how the lockdown is implemented in the model.",
                    "citation": "Francesco Di Lauro, L. Berthouze, Matthew Dorey... (2021). The Impact of Contact Structure and Mixing on Control Measures and Disease-Induced Herd Immunity in Epidemic Models: A Mean-Field Model Perspective. Bulletin of Mathematical Biology, 83. DOI: 10.1007/s11538-021-00947-8",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Investigating the question of herd immunity under several scenarios and modelling interventions as changes in transmission rates confirms that in networks with significant degree heterogeneity, the first wave of the epidemic confers herd immunity with significantly fewer infections than equivalent models with less or no degree heterogeneity."
                    }
                }
            ],
            "summary": "The study by Di Lauro et al. (2021) offers significant insights into the concept of herd immunity thresholds (HIT) in structured epidemic models and specifically discusses the impact of contact network heterogeneity, including degree distributions, on these thresholds.\n\n### Key Findings Relevant to the Query\n\n1. **Classical Herd Immunity Threshold (HIT) in Unstructured Models**  \n   - In unstructured population models (e.g., classic SIR), the HIT is given by\n     \\[\n     \\text{HIT} = 1 - \\frac{1}{R_0}\n     \\]\n     where \\( R_0 \\) is the basic reproduction number.\n   - After infection of this fraction, the residual susceptible population cannot sustain a large outbreak.\n\n2. **Effects of Contact Network Structure on HIT**   \n   - In networks with **degree heterogeneity**, higher-degree nodes (those with many contacts) are more likely to be infected early in the epidemic.\n   - This early infection of highly connected individuals acts as a **natural form of targeted vaccination**, effectively immunizing nodes who contribute disproportionately to transmission.\n   - As a result, the **disease-induced herd immunity threshold becomes lower** compared to the classical unstructured estimate \\( 1 - 1/R_0 \\).\n   - This effect corresponds to a lowering of the effective reproduction number by preferential removal of highly connected nodes.\n\n3. **Mean Degree and Mean Excess Degree**  \n   - Although not explicitly stated in the abstract, it is well established in epidemic network theory that the epidemic threshold and herd immunity depend on:\n     - The **mean degree**, \\(\\langle k \\rangle\\), the average number of contacts per node,\n     - The **mean excess degree**, \\(\\langle k^2 \\rangle / \\langle k \\rangle - 1\\), which weighs high-degree nodes more and captures heterogeneity.\n   - In configuration model networks, the epidemic threshold for SIR-like models is related inversely to \\(\\frac{\\langle k^2 \\rangle - \\langle k \\rangle}{\\langle k \\rangle}\\), highlighting that nodes with higher excess degree play a crucial role in sustaining transmission.\n\n4. **Impact of Random Vaccination**  \n   - Random vaccination effectively removes nodes uniformly without preferentially targeting high-degree nodes.\n   - In heterogeneous networks, **random vaccination requires a substantially higher coverage to reach herd immunity** compared to targeted vaccination or natural infection-immunization.\n   - This is because random vaccination does not preferentially reduce the mean excess degree and thus is less efficient at increasing the epidemic threshold.\n\n5. **Role of Intervention Types and Network Changes**  \n   - The authors also highlight that structural interventions (e.g., lockdowns implemented by changing network contacts) can affect HIT differently than interventions modeled as reductions in transmission rates.\n   - Interventions that shield high-degree nodes may paradoxically **increase the risk of a second wave** by retaining a connected high-risk susceptible population.\n\n6. **Limitations of Network Data and Model Flexibility**  \n   - Detailed network models require extensive data and computational effort.\n   - Mean-field models, parameterized with tunable degree distributions and mixing matrices, provide efficient approximations for exploring HIT under various network heterogeneities.\n\n---\n\n### Synthesis with Respect to the Query: Herd Immunity Threshold, Random Vaccination, \\( R_0 \\), Mean Degree, Mean Excess Degree\n\n- The **classical HIT \\(1 - 1/R_0\\)** is a baseline applicable for homogeneous mixing.  \n- In networks, HIT depends critically on the degree distribution. The presence of **degree heterogeneity lowers the HIT because the epidemic preferentially immunizes high-degree nodes**.  \n- The **mean degree** \\(\\langle k \\rangle\\) sets the baseline number of contacts affecting \\( R_0 \\), while the **mean excess degree** \\(\\frac{\\langle k^2 \\rangle - \\langle k \\rangle}{\\langle k \\rangle}\\) reflects variance that amplifies transmission potential via superspreaders.  \n- **Random vaccination lacks selectivity and thus needs a relatively higher fraction of coverage relative to targeted immunization or natural infection in a heterogeneous network.**  \n- Thus, for random vaccination in a network context, the required coverage to exceed herd immunity roughly relates not only to \\(R_0\\) but also to network topology, especially mean excess degree. The higher \\( \\langle k^2 \\rangle\\) relative to \\(\\langle k \\rangle\\), the harder it is to reach herd immunity via random vaccination.\n\n---\n\n### Scientific Summary\n\nDi Lauro et al. (2021) provide a rigorous mean-field analysis indicating that the classical herd immunity threshold, \\(1 - 1/R_0\\), overestimates the infection fraction needed for herd immunity in structured populations with heterogeneous contact degrees. This discrepancy arises because the epidemic preferentially removes (immunizes) highly connected individuals, effectively lowering the susceptibility of the network to subsequent outbreaks. However, herd immunity thresholds are sensitive to the nature of interventions and network structure.\n\nRandom vaccination acts uniformly across nodes and does not target hubs, so it requires substantially higher coverage in these degree-heterogeneous networks compared to natural epidemic-induced immunity or targeted vaccination. Network measures such as mean degree and mean excess degree characterize transmission potential—high mean excess degree implies larger heterogeneity and complicates achieving herd immunity with random vaccination.\n\nTherefore, in random vaccination strategies on networks, the herd immunity threshold depends on both the basic reproduction number \\(R_0\\) and the network degree moments, particularly the mean excess degree, which quantifies the impact of variability in node connectivity.\n\n---\n\n### Reference\n\nDi Lauro F., Berthouze L., Dorey M., et al. (2021). The Impact of Contact Structure and Mixing on Control Measures and Disease-Induced Herd Immunity in Epidemic Models: A Mean-Field Model Perspective. *Bulletin of Mathematical Biology*, 83. DOI: 10.1007/s11538-021-00947-8\n\n---\n\n**If you require mathematical formulations or quantitative expressions for how mean degree and mean excess degree influence HIT under random vaccination, please provide additional studies or data.**"
        },
        {
            "query": "targeted vaccination high-degree nodes epidemic threshold configuration model network",
            "papers": [
                {
                    "paper_title": "Predicting the epidemic threshold of the susceptible-infected-recovered model",
                    "abstract": "Researchers have developed several theoretical methods for predicting epidemic thresholds, including the mean-field like (MFL) method, the quenched mean-field (QMF) method and the dynamical message passing (DMP) method. When these methods are applied to predict epidemic threshold they often produce differing results and their relative levels of accuracy are still unknown. We systematically analyze these two issues—relationships among differing results and levels of accuracy—by studying the susceptible-infected-recovered (SIR) model on uncorrelated configuration networks and a group of 56 real-world networks. In uncorrelated configuration networks the MFL and DMP methods yield identical predictions that are larger and more accurate than the prediction generated by the QMF method. As for the 56 real-world networks, the epidemic threshold obtained by the DMP method is more likely to reach the accurate epidemic threshold because it incorporates full network topology information and some dynamical correlations. We find that in most of the networks with positive degree-degree correlations, an eigenvector localized on the high k-core nodes, or a high level of clustering, the epidemic threshold predicted by the MFL method, which uses the degree distribution as the only input information, performs better than the other two methods.",
                    "citation": "Wei Wang, Wen Wang, Quan-Hui Liu... (2015). Predicting the epidemic threshold of the susceptible-infected-recovered model. Scientific Reports, 6. DOI: 10.1038/srep24676",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "In most of the networks with positive degree-degree correlations, an eigenvector localized on the high k-core nodes, or a high level of clustering, the epidemic threshold predicted by the MFL method, which uses the degree distribution as the only input information, performs better than the other two methods."
                    }
                },
                {
                    "paper_title": "Acquaintance Vaccination in an Epidemic on a Random Graph with Specified Degree Distribution",
                    "abstract": null,
                    "citation": "F. Ball, David Sirl (2013). Acquaintance Vaccination in an Epidemic on a Random Graph with Specified Degree Distribution. Journal of Applied Probability, 50, 1147 - 1168. DOI: 10.1239/jap/1389370105",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that introducing an imperfect vaccine response into the present model for acquaintance vaccination leads to sibling dependence in the approximating branching processes, which may then require infinite type spaces for their analysis and are generally not amenable to numerical calculation."
                    }
                },
                {
                    "paper_title": "Coupled Information–Epidemic Spreading Dynamics with Selective Mass Media",
                    "abstract": "As a pandemic emerges, information on epidemic prevention disseminates among the populace, and the propagation of that information interacts with the proliferation of the disease. Mass media serve a pivotal function in facilitating the dissemination of epidemic-related information. Investigating coupled information–epidemic dynamics, while accounting for the promotional effect of mass media in information dissemination, is of significant practical relevance. Nonetheless, in the extant research, scholars predominantly employ an assumption that mass media broadcast to all individuals equally within the network: this assumption overlooks the practical constraint imposed by the substantial social resources required to accomplish such comprehensive promotion. In response, this study introduces a coupled information–epidemic spreading model with mass media that can selectively target and disseminate information to a specific proportion of high-degree nodes. We employed a microscopic Markov chain methodology to scrutinize our model, and we examined the influence of the various model parameters on the dynamic process. The findings of this study reveal that mass media broadcasts directed towards high-degree nodes within the information spreading layer can substantially reduce the infection density of the epidemic, and raise the spreading threshold of the epidemic. Additionally, as the mass media broadcast proportion increases, the suppression effect on the disease becomes stronger. Moreover, with a constant broadcast proportion, the suppression effect of mass media promotion on epidemic spreading within the model is more pronounced in a multiplex network with a negative interlayer degree correlation, compared to scenarios with positive or absent interlayer degree correlation.",
                    "citation": "Jiajun Xian, Zhihong Zhang, Zongyi Li... (2023). Coupled Information–Epidemic Spreading Dynamics with Selective Mass Media. Entropy, 25. DOI: 10.3390/e25060927",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "The impact of network properties and mixing on control measures and disease-induced herd immunity in epidemic models: a mean-field model perspective",
                    "abstract": "The contact structure of a population plays an important role in transmission of infection. Many ``structured models'' capture aspects of the contact structure through an underlying network or a mixing matrix. An important observation in such models, is that once a fraction $1-1/\\mathcal{R}_0$ has been infected, the residual susceptible population can no longer sustain an epidemic. A recent observation of some structured models is that this threshold can be crossed with a smaller fraction of infected individuals, because the disease acts like a targeted vaccine, preferentially immunizing higher-risk individuals who play a greater role in transmission. Therefore, a limited ``first wave'' may leave behind a residual population that cannot support a second wave once interventions are lifted. In this paper, we systematically analyse a number of mean-field models for networks and other structured populations to address issues relevant to the Covid-19 pandemic. In particular, we consider herd-immunity under several scenarios. We confirm that, in networks with high degree heterogeneity, the first wave confers herd-immunity with significantly fewer infections than equivalent models with lower degree heterogeneity. However, if modelling the intervention as a change in the contact network, then this effect might become more subtle. Indeed, modifying the structure can shield highly connected nodes from becoming infected during the first wave and make the second wave more substantial. We confirm this finding by using an age-structured compartmental model parameterised with real data and comparing lockdown periods implemented either as a global scaling of the mixing matrix or age-specific structural changes. We find that results regarding herd immunity levels are strongly dependent on the model, the duration of lockdown and how lockdown is implemented.",
                    "citation": "F. D. Lauro, L. Berthouze, Matthew Dorey... (2020). The impact of network properties and mixing on control measures and disease-induced herd immunity in epidemic models: a mean-field model perspective. arXiv: Populations and Evolution. DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is confirmed that, in networks with high degree heterogeneity, the first wave confers herd-immunity with significantly fewer infections than equivalent models with lower degree heterogeneity and results regarding herd immunity levels are strongly dependent on the model, the duration of lockdown and how lockdown is implemented."
                    }
                },
                {
                    "paper_title": "The Impact of Contact Structure and Mixing on Control Measures and Disease-Induced Herd Immunity in Epidemic Models: A Mean-Field Model Perspective",
                    "abstract": "The contact structure of a population plays an important role in transmission of infection. Many ‘structured models’ capture aspects of the contact pattern through an underlying network or a mixing matrix. An important observation in unstructured models of a disease that confers immunity is that once a fraction 1-1/R0\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$1-1/{\\mathcal {R}}_0$$\\end{document} has been infected, the residual susceptible population can no longer sustain an epidemic. A recent observation of some structured models is that this threshold can be crossed with a smaller fraction of infected individuals, because the disease acts like a targeted vaccine, preferentially immunising higher-risk individuals who play a greater role in transmission. Therefore, a limited ‘first wave’ may leave behind a residual population that cannot support a second wave once interventions are lifted. In this paper, we set out to investigate this more systematically. While networks offer a flexible framework to model contact patterns explicitly, they suffer from several shortcomings: (i) high-fidelity network models require a large amount of data which can be difficult to harvest, and (ii) very few, if any, theoretical contact network models offer the flexibility to tune different contact network properties within the same framework. Therefore, we opt to systematically analyse a number of well-known mean-field models. These are computationally efficient and provide good flexibility in varying contact network properties such as heterogeneity in the number contacts, clustering and household structure or differentiating between local and global contacts. In particular, we consider the question of herd immunity under several scenarios. When modelling interventions as changes in transmission rates, we confirm that in networks with significant degree heterogeneity, the first wave of the epidemic confers herd immunity with significantly fewer infections than equivalent models with less or no degree heterogeneity. However, if modelling the intervention as a change in the contact network, then this effect may become much more subtle. Indeed, modifying the structure disproportionately can shield highly connected nodes from becoming infected during the first wave and therefore make the second wave more substantial. We strengthen this finding by using an age-structured compartmental model parameterised with real data and comparing lockdown periods implemented either as a global scaling of the mixing matrix or age-specific structural changes. Overall, we find that results regarding (disease-induced) herd immunity levels are strongly dependent on the model, the duration of the lockdown and how the lockdown is implemented in the model.",
                    "citation": "Francesco Di Lauro, L. Berthouze, Matthew Dorey... (2021). The Impact of Contact Structure and Mixing on Control Measures and Disease-Induced Herd Immunity in Epidemic Models: A Mean-Field Model Perspective. Bulletin of Mathematical Biology, 83. DOI: 10.1007/s11538-021-00947-8",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Investigating the question of herd immunity under several scenarios and modelling interventions as changes in transmission rates confirms that in networks with significant degree heterogeneity, the first wave of the epidemic confers herd immunity with significantly fewer infections than equivalent models with less or no degree heterogeneity."
                    }
                },
                {
                    "paper_title": "Vaccination with partial transmission and social distancing on contact networks",
                    "abstract": "We study the impact of vaccination on the risk of epidemics spreading through structured networks using the cavity method of statistical physics. We relax the assumption that vaccination prevents all transmission of a disease used in previous studies, such that vaccinated nodes have a small probability of transmission. To do so, we extend the cavity method to study networks where nodes have heterogeneous transmissibility. We find that vaccination with partial transmission still provides herd immunity and show how the herd immunity threshold depends upon the assortativity between nodes of different transmissibility. In addition, we study the impact of social distancing via bond percolation and show that percolation targeting links between nodes of high transmissibility can reduce the risk of an epidemic greater than targeting links between nodes of high degree. Finally, we extend recent methods to compute the distributional equations of risk in populations with heterogeneous transmissibility and show how targeted social distancing measures may reduce overall risk greater than untargeted vaccination campaigns, by comparing the effect of random and targeted strategies of node and link deletion on the risk distribution.",
                    "citation": "C. Hurry, Alexander Mozeika, A. Annibale (2021). Vaccination with partial transmission and social distancing on contact networks. Journal of Statistical Mechanics: Theory and Experiment, 2022. DOI: 10.1088/1742-5468/ac50ae",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that vaccination with partial transmission still provides herd immunity and it is shown how the herd immunity threshold depends upon the assortativity between nodes of different transmissibility."
                    }
                },
                {
                    "paper_title": "Evaluation of vaccination strategies for SIR epidemics on random networks incorporating household structure",
                    "abstract": "This paper is concerned with the analysis of vaccination strategies in a stochastic susceptible →\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\rightarrow $$\\end{document} infected →\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\rightarrow $$\\end{document} removed model for the spread of an epidemic amongst a population of individuals with a random network of social contacts that is also partitioned into households. Under various vaccine action models, we consider both household-based vaccination schemes, in which the way in which individuals are chosen for vaccination depends on the size of the households in which they reside, and acquaintance vaccination, which targets individuals of high degree in the social network. For both types of vaccination scheme, assuming a large population with few initial infectives, we derive a threshold parameter which determines whether or not a large outbreak can occur and also the probability of a large outbreak and the fraction of the population infected by a large outbreak. The performance of these schemes is studied numerically, focusing on the influence of the household size distribution and the degree distribution of the social network. We find that acquaintance vaccination can significantly outperform the best household-based scheme if the degree distribution of the social network is heavy-tailed. For household-based schemes, when the vaccine coverage is insufficient to prevent a major outbreak and the vaccine is imperfect, we find situations in which both the probability and size of a major outbreak under the scheme which minimises the threshold parameter are larger than in the scheme which maximises the threshold parameter.",
                    "citation": "F. Ball, David Sirl (2016). Evaluation of vaccination strategies for SIR epidemics on random networks incorporating household structure. Journal of Mathematical Biology, 76, 483 - 530. DOI: 10.1007/s00285-017-1139-0",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that acquaintance vaccination can significantly outperform the best household-based scheme if the degree distribution of the social network is heavy-tailed and also the probability of a large outbreak and the fraction of the population infected by aLarge outbreak."
                    }
                }
            ],
            "summary": "I have reviewed the literature you provided on *targeted vaccination of high-degree nodes* and its influence on the *epidemic threshold* for SIR models on configuration model networks or similar random network structures. Below is a scientifically precise synthesis that addresses how targeting high-degree nodes (hubs) affects the epidemic threshold in configuration model networks, drawing from these key studies.\n\n---\n\n## Scientific Summary on Targeted Vaccination of High-Degree Nodes & Epidemic Threshold in Configuration Networks\n\n### 1. Epidemic Threshold Prediction Methods & Role of Degree\n\n**Wang et al. (2015)** systematically compare three prominent theoretical approaches to predict the epidemic threshold for the SIR model:\n- Mean-field like (MFL),\n- Quenched mean-field (QMF),\n- Dynamical message passing (DMP).\n\nTheir analysis shows:\n- On *uncorrelated configuration networks*, the MFL and DMP methods produce *identical and more accurate* epidemic threshold estimates than QMF.\n- The MFL method relies solely on the degree distribution, highlighting the dominant role of node degree heterogeneity in threshold determination.\n- In real-world networks with *positive degree correlations*, or strong *k-core localization* (where epidemic dynamics concentrate on high-degree cores), MFL outperforms others.  \n\n**Implication:**  \nThis confirms that degree-based approaches provide robust epidemic threshold estimates in configuration models and that hubs (high-degree nodes) critically influence threshold values because they facilitate spreading.\n\n---\n\n### 2. Acquaintance Vaccination: Targeting High-Degree Nodes\n\n**Ball and Sirl (2013, 2016)** analyze vaccination strategies on random networks with specified degree distributions incorporating household structure:\n\n- **Acquaintance vaccination** targets nodes indirectly by vaccinating neighbors of randomly chosen individuals, which preferentially selects high-degree nodes.\n- They prove that acquaintance vaccination *significantly elevates the epidemic threshold* compared to random vaccination, especially on networks with heavy-tailed degree distributions.\n- This method leverages the \"friendship paradox\" — neighbors of random nodes tend to have higher degree on average — effectively immunizing hubs.\n- Simulation and analytic results confirm that vaccinating hubs reduces epidemic probability and size disproportionately.\n- Their work also highlights that, when vaccine coverage is limited and vaccine efficacy imperfect, choosing a strategy that maximally increases the threshold may not always minimize outbreak size or probability due to complex network and household interactions.\n\n**Implication:**  \nTargeted vaccination aimed at immunizing high-degree nodes in configuration or random networks is far more effective at increasing the epidemic threshold and controlling outbreaks than non-targeted schemes.\n\n---\n\n### 3. Impact of Targeted Information Dissemination on Epidemic Threshold\n\n**Xian et al. (2023)** model coupled information-epidemic spread with selective mass media promotion among *high-degree nodes* in a multiplex network:\n\n- Mass media selectively disseminating epidemic-related information to high-degree nodes leads to a *higher epidemic threshold* and *lower infection density*.\n- The effect is amplified when degree correlations between layers are negative.\n- This is an indirect but practical form of targeting hubs to reduce transmission.\n\n**Implication:**  \nTargeting hubs even via information campaigns effectively acts like vaccination by increasing epidemic threshold.\n\n---\n\n### 4. Network Heterogeneity, Herd Immunity & the Role of High-Degree Nodes\n\n**Lauro et al. (2020, 2021)** use mean-field models emphasizing degree heterogeneity to explore control measures and herd immunity:\n\n- In heterogeneous networks like configuration models, the \"first wave\" of infection acts like a *de facto targeted vaccination* because higher-degree nodes tend to be infected early and become immune.\n- This selective immunization of hubs *lowers the number of total infections* required to achieve herd immunity relative to homogeneous networks.\n- However, interventions that *shield* high-degree nodes during the first wave can paradoxically lower herd immunity thresholds and enable second waves.\n\n**Implication:**  \nHigh-degree nodes disproportionately influence epidemic propagation and immunity buildup; preferential targeting is crucial.\n\n---\n\n### 5. Vaccination with Partial Transmission & Link Targeting\n\n**Hurry et al. (2021)** extend understanding by relaxing perfect vaccine assumptions:\n\n- Vaccinated nodes having reduced but nonzero transmissibility still confer herd immunity.\n- Targeted removal or protection of connections between high-transmissibility (often high-degree) nodes more effectively raises thresholds than random link or node removal.\n  \nThis further supports prioritizing hubs and their immediate connections for vaccination/social distancing.\n\n---\n\n## Overall Conclusions\n\n- **The epidemic threshold in SIR models on configuration networks depends strongly on the network degree distribution**, particularly the presence of hubs.\n- **Targeted vaccination of high-degree nodes (hubs)**, including indirect acquaintance vaccination, significantly increases the epidemic threshold compared to random vaccination, effectively preventing large outbreaks.\n- This effect arises because hubs serve as super-spreaders; immunizing them disproportionately reduces transmission pathways.\n- Degree-based mean-field methods and dynamical message passing analytically capture these influences well, making them practical tools for threshold prediction.\n- However, interventions that shield hubs from initial infection may reduce this natural targeted immunization effect, potentially lowering herd immunity.\n- Targeted information dissemination or partial vaccination strategies focused on hubs similarly increase thresholds and reduce epidemic size.\n- Network structure nuances such as degree-degree correlations, k-core localization, and household clustering modulate these effects.\n\n---\n\n## References\n\n- Wang W., Wang W., Liu Q.-H., et al. (2015). Predicting the epidemic threshold of the susceptible-infected-recovered model. *Scientific Reports*, 6, 24676. DOI: 10.1038/srep24676\n- Ball F., Sirl D. (2013). Acquaintance Vaccination in an Epidemic on a Random Graph with Specified Degree Distribution. *Journal of Applied Probability*, 50(4), 1147-1168. DOI: 10.1239/jap/1389370105\n- Ball F., Sirl D. (2016). Evaluation of vaccination strategies for SIR epidemics on random networks incorporating household structure. *Journal of Mathematical Biology*, 76(3), 483-530. DOI: 10.1007/s00285-017-1139-0\n- Xian J., Zhang Z., Li Z., et al. (2023). Coupled Information–Epidemic Spreading Dynamics with Selective Mass Media. *Entropy*, 25(6), 927. DOI: 10.3390/e25060927\n- Lauro F. D., Berthouze L., Dorey M., et al. (2021). The Impact of Contact Structure and Mixing on Control Measures and Disease-Induced Herd Immunity in Epidemic Models: A Mean-Field Model Perspective. *Bulletin of Mathematical Biology*, 83(3), 1-26. DOI: 10.1007/s11538-021-00947-8\n- Hurry C., Mozeika A., Annibale A. (2021). Vaccination with partial transmission and social distancing on contact networks. *Journal of Statistical Mechanics: Theory and Experiment*, 2022(1), 014003. DOI: 10.1088/1742-5468/ac50ae\n\n---\n\nPlease let me know if you require more specific details or modeling equations related to these findings."
        },
        {
            "query": "simulation SIR vaccination strategies random targeted network threshold",
            "papers": [
                {
                    "paper_title": "Control of COVID-19 Pandemic: Vaccination Strategies Simulation under Probabilistic Node-Level Model",
                    "abstract": "This paper aims at constructing a probabilistic node-level time-dependent contagious disease spreading model for coronavirus disease (COVID-19) pandemic which is called SEINRVseinr by introducing exposed and asymptomatic infectious state, imperfect vaccination, reinfected possibility and weighted undirected graph for social network into the traditional probabilistic node-level Susceptible-Infectious-Recovered (SIR) network model. This paper simulates the effectiveness of five vaccination strategies (including random base, degree-target base, random acquaintance, first-neighbor and second neighbor strategies) in random network, small world network and scale-free network. Compared with the benchmark model, the results show that random acquaintance strategy is efficient strategy and neighbors’ strategies perform better in certain interval.",
                    "citation": "Mengxuan Chen, C. Kuo, Wai Kin Victor Chan (2021). Control of COVID-19 Pandemic: Vaccination Strategies Simulation under Probabilistic Node-Level Model. 2021 6th International Conference on Intelligent Computing and Signal Processing (ICSP), 119-125. DOI: 10.1109/ICSP51882.2021.9408970",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Results show that random acquaintance strategy is efficient strategy and neighbors’ strategies perform better in certain interval in the probabilistic node-level Susceptible-Infectious-Recovered (SIR) network model."
                    }
                },
                {
                    "paper_title": "Dynamics of SIR Model on Random Networks",
                    "abstract": "we focus on studying the dynamics of infectious disease spreading SIR model on random networks. We investigate how various parameters of the network influence the behavior of spreading and analyze the occurrence of phase transitions within this networkframework. Our analysis reveals the critical role of network connectivity in shaping the dynamics of disease transmission and highlights the presence of mean-field phase transitions.Additionally, we employ both analytical techniques and simulation methods to extract critical thresholds for the model and compare them for validation. By delving into the intricate dynamics of disease spreading on random networks, this work offers valuableinsights into the mechanisms driving epidemic propagation and provides a theoretical foundation for studying disease control strategies and public health interventions.",
                    "citation": "M. A. Saif, M. A. Shukri, F. H. Al-makhedhi (2024). Dynamics of SIR Model on Random Networks. مجلة جامعة عمران. DOI: 10.59145/jaust.v4i7.91",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This analysis reveals the critical role of network connectivity in shaping the dynamics of disease transmission and highlights the presence of mean-field phase transitions in the SIR model."
                    }
                },
                {
                    "paper_title": "Effective node vaccination and containing strategies to halt SIR epidemic spreading in real-world face-to-face contact networks",
                    "abstract": "We model the COVID-19 spreading by running SIR Monte-Carlo simulations in four real face-to-face contact networks. We evaluate the effectiveness of the ‘facemask use’ and ‘vaccination policies’ to curb epidemic spreading. We model the facemask use policy by assuming a lower individual infection probability $\\beta$. We found that while this strategy can delay the disease spreading, it does not significantly reduce the total number of infected individuals (TI), as 80% of the total population still is infected at the end of the epidemic. We model vaccination by setting individual's infection probability $\\beta=0$, which is equivalent to remove nodes/individuals from the network. The vaccination was found to be very effective. Even with a partial vaccination of 30% of the population nodes selected considering their centrality measure ranking, such as degree, betweenness, or PageRank, it was possible to reduce the TI of 14%. Finally, yet importantly, random partial vaccination is not effective at all, meaning that most of the unvaccinated population will be infected.",
                    "citation": "N. Nguyen, Thanh-Trung Nguyen, Tuan-Anh Nguyen... (2022). Effective node vaccination and containing strategies to halt SIR epidemic spreading in real-world face-to-face contact networks. 2022 RIVF International Conference on Computing and Communication Technologies (RIVF), 1-6. DOI: 10.1109/RIVF55975.2022.10013812",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work model the COVID-19 spreading by running SIR Monte-Carlo simulations in four real face-to-face contact networks and finds that the vaccination was found to be very effective and random partial vaccination is not effective, meaning that most of the unvaccinated population will be infected."
                    }
                },
                {
                    "paper_title": "Evaluation of vaccination strategies for SIR epidemics on random networks incorporating household structure",
                    "abstract": "This paper is concerned with the analysis of vaccination strategies in a stochastic susceptible →\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\rightarrow $$\\end{document} infected →\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\rightarrow $$\\end{document} removed model for the spread of an epidemic amongst a population of individuals with a random network of social contacts that is also partitioned into households. Under various vaccine action models, we consider both household-based vaccination schemes, in which the way in which individuals are chosen for vaccination depends on the size of the households in which they reside, and acquaintance vaccination, which targets individuals of high degree in the social network. For both types of vaccination scheme, assuming a large population with few initial infectives, we derive a threshold parameter which determines whether or not a large outbreak can occur and also the probability of a large outbreak and the fraction of the population infected by a large outbreak. The performance of these schemes is studied numerically, focusing on the influence of the household size distribution and the degree distribution of the social network. We find that acquaintance vaccination can significantly outperform the best household-based scheme if the degree distribution of the social network is heavy-tailed. For household-based schemes, when the vaccine coverage is insufficient to prevent a major outbreak and the vaccine is imperfect, we find situations in which both the probability and size of a major outbreak under the scheme which minimises the threshold parameter are larger than in the scheme which maximises the threshold parameter.",
                    "citation": "F. Ball, David Sirl (2016). Evaluation of vaccination strategies for SIR epidemics on random networks incorporating household structure. Journal of Mathematical Biology, 76, 483 - 530. DOI: 10.1007/s00285-017-1139-0",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that acquaintance vaccination can significantly outperform the best household-based scheme if the degree distribution of the social network is heavy-tailed and also the probability of a large outbreak and the fraction of the population infected by aLarge outbreak."
                    }
                },
                {
                    "paper_title": "Dynamical Analysis of an Improved Bidirectional Immunization SIR Model in Complex Network",
                    "abstract": "In order to investigate the impact of two immunization strategies—vaccination targeting susceptible individuals to reduce their infection rate and clinical medical interventions targeting infected individuals to enhance their recovery rate—on the spread of infectious diseases in complex networks, this study proposes a bilinear SIR infectious disease model that considers bidirectional immunization. By analyzing the conditions for the existence of endemic equilibrium points, we derive the basic reproduction numbers and outbreak thresholds for both homogeneous and heterogeneous networks. The epidemic model is then reconstructed and extensively analyzed using continuous-time Markov chain (CTMC) methods. This analysis includes the investigation of transition probabilities, transition rate matrices, steady-state distributions, and the transition probability matrix based on the embedded chain. In numerical simulations, a notable concordance exists between the outcomes of CTMC and mean-field (MF) simulations, thereby substantiating the efficacy of the CTMC model. Moreover, the CTMC-based model adeptly captures the inherent stochastic fluctuation in the disease transmission, which is consistent with the mathematical properties of Markov chains. We further analyze the relationship between the system’s steady-state infection density and the immunization rate through MCS. The results suggest that the infection density decreases with an increase in the immunization rate among susceptible individuals. The current research results will enhance our understanding of infectious disease transmission patterns in real-world scenarios, providing valuable theoretical insights for the development of epidemic prevention and control strategies.",
                    "citation": "Shixiang Han, Guanghui Yan, Huayan Pei... (2024). Dynamical Analysis of an Improved Bidirectional Immunization SIR Model in Complex Network. Entropy, 26. DOI: 10.3390/e26030227",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A bilinear SIR infectious disease model that considers bidirectional immunization is proposed that adeptly captures the inherent stochastic fluctuation in the disease transmission, which is consistent with the mathematical properties of Markov chains."
                    }
                },
                {
                    "paper_title": "Efficient vaccination strategies for epidemic control using network information",
                    "abstract": "Background: Network-based interventions are most powerful against epidemics when the full network structure is known. However, resource constraints often require decisions based on partial network data. We investigated how the effectiveness of network-based vaccination schemes varied based on the accuracy of network data available. Methods: We simulated propagating an SIR process on static empirical social networks from 75 rural Indian villages. First, we used regression analysis to predict the percentage of individuals ever infected (cumulative incidence) based on village-level networks. Second, we simulated vaccinating 10% of each village at baseline, selecting vaccinees using 1 of 5 network-based approaches: at random (Random); random contacts of random individuals (Nomination); random high-degree individuals (High Degree); highest degree (Highest Degree); or most central (Central). The first three approaches require only sample data; the latter two require full network data. We also simulated imposing a limit on how many contacts an individual can nominate (Fixed Choice Design, FCD), which reduces data collection burden but generates only partially observed networks. Results: We found the mean and standard deviation of the degree distribution to strongly predict cumulative incidence. In simulations, Nomination reduced cumulative incidence by one-sixth compared to Random vaccination; full network methods reduced infection by two-thirds. High Degree had intermediate effectiveness. Somewhat surprisingly, FCD truncating individuals' degrees at three was as effective as using complete networks. Conclusions: Using even partial network information to prioritize vaccines at either the village or individual level substantially improved epidemic outcomes. Such approaches may be feasible and effective in outbreak settings, and full ascertainment of network structure may not be required.",
                    "citation": "Yingrui Yang, Ashley McKhann, G. Harling... (2018). Efficient vaccination strategies for epidemic control using network information. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Using even partial network information to prioritize vaccines at either the village or individual level substantially improved epidemic outcomes, suggesting that such approaches may be feasible and effective in outbreak settings, and full ascertainment of network structure may not be required."
                    }
                },
                {
                    "paper_title": "The combination of targeted vaccination and ring vaccination.",
                    "abstract": "Complex networks have become an important tool for investigating epidemic dynamics. A widely concerned research field for epidemics is to develop and study mitigation strategies or control measures. In this paper, we devote our attention to ring vaccination and targeted vaccination and consider the combination of them. Based on the different roles ring vaccination plays in the mixed strategy, the whole parameter space can be roughly divided into two regimes. In one regime, the mixed strategy performs poorly compared with targeted vaccination alone, while in the other regime, the addition of ring vaccination can improve the performance of targeted vaccination. This result gives us the more general and overall comparison between targeted and ring vaccination. In addition, we construct a susceptible-infected-recovered epidemic model coupled with the immunization dynamics on random networks. The comparison between stochastic simulations and numerical simulations confirms the validity of the model we propose.",
                    "citation": "Weiqiang Li, Jin Zhou, Zhen Jin... (2021). The combination of targeted vaccination and ring vaccination.. Chaos, 31 6, \n          063108\n        . DOI: 10.1063/5.0048457",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A susceptible-infected-recovered epidemic model coupled with the immunization dynamics on random networks is constructed and the comparison between stochastic simulations and numerical simulations confirms the validity of the model."
                    }
                }
            ],
            "summary": "Based on the reviewed papers addressing simulation studies of SIR epidemic models under various vaccination strategies—including random and targeted—on different network topologies, I summarize the scientifically and practically relevant findings related to epidemic thresholds, vaccination effectiveness, and control strategies as follows:\n\n---\n\n### 1. Simulation Comparisons of Vaccination Strategies on Networks\n\n**Chen et al. (2021)** extended the classical node-level SIR model with exposed and asymptomatic states and imperfect vaccination. They simulated five vaccination strategies on random, small-world, and scale-free networks:\n\n- Strategies included **random, degree-targeted, random acquaintance, first-neighbor, and second-neighbor vaccinations**.\n- Results show that **random acquaintance vaccination** (vaccinating neighbors of randomly chosen nodes) is a highly efficient strategy.\n- Neighbor-based (first- and second-neighbor) strategies outperform random vaccination in many conditions because they target nodes with higher likelihood of spreading disease.\n- Scale-free networks with high degree variance benefit particularly from neighbor-based and degree-based targeting, as hubs get prioritized indirectly or directly, increasing epidemic thresholds.\n- This aligns with prior network epidemic understanding that targeting hubs delays or prevents large outbreaks by increasing threshold conditions.\n\n---\n\n### 2. Effectiveness of Targeted vs Random Vaccination in Realistic Contact Networks\n\n**Nguyen et al. (2022)** performed Monte Carlo SIR simulations on real face-to-face contact networks:\n\n- **Vaccination modeled as removing nodes from the network** (infection rate β = 0 for vaccinated).\n- Partial vaccination (about 30%) targeted to nodes ranked by network centrality measures such as degree, betweenness, or PageRank reduced total infected (TI) by approximately 14%, demonstrating significant effectiveness.\n- In contrast, **random partial vaccination was not effective**—most of the unvaccinated population still became infected.\n- Facemask use (modeled by lowering β) delayed but did not reduce infection size significantly.\n- These findings reinforce the importance of **targeted vaccination for meaningful epidemic control**, especially in networks with strong structural heterogeneity.\n\n---\n\n### 3. Vaccination Thresholds and Epidemic Outbreak Conditions on Random Networks\n\n**Saif et al. (2024)** and **Ball & Sirl (2016)** provide more theoretical and simulation-based insights around SIR model dynamics and vaccination threshold evaluation on random networks with additional household structures:\n\n- Increasing vaccination coverage generally raises the **epidemic threshold** (basic reproduction number R0 below 1).\n- **Acquaintance vaccination**, which targets high-degree nodes indirectly, significantly outperforms random household-based vaccination in networks with heavy-tailed degree distributions.\n- Partial vaccination strategies must consider **household structure and network degree distributions** to accurately predict threshold effects.\n- Imperfect vaccines and insufficient coverage can lead to counterintuitive situations where minor vaccination efforts fail to reduce outbreak probability or size.\n  \n---\n\n### 4. Bidirectional Immunization and Impact on Infection Density\n\n**Han et al. (2024)** modeled vaccination (susceptibles) and clinical interventions (infected) in a bilinear SIR framework on complex networks:\n\n- They show through simulations that increasing vaccination rate lowers steady-state infection density.\n- Both homogeneous and heterogeneous network structures demonstrate this phenomenon, with heterogeneous networks showing stronger epidemic potential but responding positively to targeted immunization.\n- The derived outbreak thresholds confirm that **targeted vaccination raises the epidemic threshold** and can suppress endemic states.\n\n---\n\n### 5. Network Data Quality and Vaccination Efficiency\n\n**Yang et al. (2018)** simulated vaccination strategies on empirical social networks and concluded:\n\n- Even **partial network data**, such as nomination of random contacts (acquaintance vaccination), substantially reduces cumulative incidence compared to purely random vaccination.\n- Full network information allows for higher efficacy, e.g., vaccinating highest degree or most central nodes reduces incidence by two-thirds.\n- Surprisingly, limiting the number of contacts each individual can nominate (to three) yields effectiveness nearly as good as full network data.\n- This suggests practical targeted vaccination via partial data collection remains feasible and effective for threshold control.\n\n---\n\n### 6. Combined Strategies: Targeted Vaccination and Ring Vaccination\n\n**Li et al. (2021)** examined a combination of **targeted vaccination (degree-based) and ring vaccination (vaccinating contacts of detected cases)** in stochastic random networks:\n\n- The combined strategy’s effectiveness depends on parameter regimes.\n- In some cases, adding ring vaccination improves targeted vaccination performance, raising the threshold and lowering final epidemic size.\n- In others, ring vaccination alone may perform worse than targeted vaccination alone.\n- This synergy underscores the need for adaptive vaccination policies based on network structure and epidemic dynamics for optimal threshold control.\n\n---\n\n### **Summary and Scientific Conclusions**\n\n- **Targeted vaccination strategies (degree-based or acquaintance-based) outperform random vaccination in raising epidemic thresholds and reducing epidemic size** in SIR models on random, scale-free, small-world, and real-world networks (Chen et al. 2021; Nguyen et al. 2022; Ball & Sirl 2016).\n- **Simulations confirm substantial reductions in total infected population and epidemic probability when vaccination prioritizes high-degree or central nodes**, even under partial coverage (Nguyen et al. 2022; Yang et al. 2018).\n- Robust epidemic thresholds can be analytically or numerically characterized for various vaccination strategies, illustrating the critical role of **network degree distribution and structure** (Saif et al. 2024; Han et al. 2024).\n- **Random vaccination is generally ineffective in heterogeneous networks** due to failure to disrupt core transmission hubs, while acquaintance or neighbor-based vaccination serves as a practical proxy for targeting hubs when full network data is lacking (Chen et al. 2021; Yang et al. 2018).\n- **Combination of vaccination strategies**, such as targeted plus ring vaccination, can further improve epidemic control if parameter conditions are favorable (Li et al. 2021).\n- Vaccination strategies that integrate network structure substantially increase the epidemic threshold (R0 reduced below 1), indicating **effective outbreak prevention or containment**.\n- Simulation studies align with theoretical threshold analyses, confirming that **strategic node removal via vaccination shifts the epidemic phase transition, limiting large outbreaks**.\n\n---\n\n### Key References\n\n- Chen M., Kuo C., Chan W.K.V. (2021). Control of COVID-19 Pandemic: Vaccination Strategies Simulation under Probabilistic Node-Level Model. ICSP 2021, DOI: 10.1109/ICSP51882.2021.9408970\n- Nguyen N., Nguyen T.-T., Nguyen T.-A., et al. (2022). Effective node vaccination and containing strategies to halt SIR epidemic spreading in real-world face-to-face contact networks. RIVF 2022, DOI: 10.1109/RIVF55975.2022.10013812\n- Ball F., Sirl D. (2016). Evaluation of vaccination strategies for SIR epidemics on random networks incorporating household structure. J. Math. Biol., 76, 483-530. DOI: 10.1007/s00285-017-1139-0\n- Han S., Yan G., Pei H., et al. (2024). Dynamical Analysis of an Improved Bidirectional Immunization SIR Model in Complex Network. Entropy 26, DOI: 10.3390/e26030227\n- Yang Y., McKhann A., Harling G., et al. (2018). Efficient vaccination strategies for epidemic control using network information.\n- Li W., Zhou J., Jin Z., et al. (2021). The combination of targeted vaccination and ring vaccination. Chaos, 31(6), 063108. DOI: 10.1063/5.0048457\n- Saif M.A., Shukri M.A., Al-makhedhi F.H. (2024). Dynamics of SIR Model on Random Networks. DOI: 10.59145/jaust.v4i7.91\n\n---\n\nIf you require further elaboration on specific vaccination strategies, network types, or threshold derivations, please let me know."
        }
    ]
}