{
    "results": [
        {
            "query": "Effect of network heterogeneity in SEIR models disease dynamics",
            "papers": [
                {
                    "title": "25th Annual Computational Neuroscience Meeting: CNS-2016",
                    "abstract": "Table of contentsA1 Functional advantages of cell-type heterogeneity in neural circuitsTatyana O. SharpeeA2 Mesoscopic modeling of propagating waves in visual cortexAlain DestexheA3 Dynamics and biomarkers of mental disordersMitsuo KawatoF1 Precise recruitment of spiking output at theta frequencies requires dendritic h-channels in multi-compartment models of oriens-lacunosum/moleculare hippocampal interneuronsVladislav Sekulić, Frances K. SkinnerF2 Kernel methods in reconstruction of current sources from extracellular potentials for single cells and the whole brainsDaniel K. Wójcik, Chaitanya Chintaluri, Dorottya Cserpán, Zoltán SomogyváriF3 The synchronized periods depend on intracellular transcriptional repression mechanisms in circadian clocks.Jae Kyoung Kim, Zachary P. Kilpatrick, Matthew R. Bennett, Kresimir JosićO1 Assessing irregularity and coordination of spiking-bursting rhythms in central pattern generatorsIrene Elices, David Arroyo, Rafael Levi, Francisco B. Rodriguez, Pablo VaronaO2 Regulation of top-down processing by cortically-projecting parvalbumin positive neurons in basal forebrainEunjin Hwang, Bowon Kim, Hio-Been Han, Tae Kim, James T. McKenna, Ritchie E. Brown, Robert W. McCarley, Jee Hyun ChoiO3 Modeling auditory stream segregation, build-up and bistabilityJames Rankin, Pamela Osborn Popp, John RinzelO4 Strong competition between tonotopic neural ensembles explains pitch-related dynamics of auditory cortex evoked fieldsAlejandro Tabas, André Rupp, Emili Balaguer-BallesterO5 A simple model of retinal response to multi-electrode stimulationMatias I. Maturana, David B. Grayden, Shaun L. Cloherty, Tatiana Kameneva, Michael R. Ibbotson, Hamish MeffinO6 Noise correlations in V4 area correlate with behavioral performance in visual discrimination taskVeronika Koren, Timm Lochmann, Valentin Dragoi, Klaus ObermayerO7 Input-location dependent gain modulation in cerebellar nucleus neuronsMaria Psarrou, Maria Schilstra, Neil Davey, Benjamin Torben-Nielsen, Volker SteuberO8 Analytic solution of cable energy function for cortical axons and dendritesHuiwen Ju, Jiao Yu, Michael L. Hines, Liang Chen, Yuguo YuO9 C. elegans interactome: interactive visualization of Caenorhabditis elegans worm neuronal networkJimin Kim, Will Leahy, Eli ShlizermanO10 Is the model any good? Objective criteria for computational neuroscience model selectionJustas Birgiolas, Richard C. Gerkin, Sharon M. CrookO11 Cooperation and competition of gamma oscillation mechanismsAtthaphon Viriyopase, Raoul-Martin Memmesheimer, Stan GielenO12 A discrete structure of the brain wavesYuri Dabaghian, Justin DeVito, Luca PerottiO13 Direction-specific silencing of the Drosophila gaze stabilization systemAnmo J. Kim, Lisa M. Fenk, Cheng Lyu, Gaby MaimonO14 What does the fruit fly think about values? A model of olfactory associative learningChang Zhao, Yves Widmer, Simon Sprecher,Walter SennO15 Effects of ionic diffusion on power spectra of local field potentials (LFP)Geir Halnes, Tuomo Mäki-Marttunen, Daniel Keller, Klas H. Pettersen,Ole A. Andreassen, Gaute T. EinevollO16 Large-scale cortical models towards understanding relationship between brain structure abnormalities and cognitive deficitsYasunori YamadaO17 Spatial coarse-graining the brain: origin of minicolumnsMoira L. Steyn-Ross, D. Alistair Steyn-RossO18 Modeling large-scale cortical networks with laminar structureJorge F. Mejias, John D. Murray, Henry Kennedy, Xiao-Jing WangO19 Information filtering by partial synchronous spikes in a neural populationAlexandra Kruscha, Jan Grewe, Jan Benda, Benjamin LindnerO20 Decoding context-dependent olfactory valence in Drosophila\n Laurent Badel, Kazumi Ohta, Yoshiko Tsuchimoto, Hokto KazamaP1 Neural network as a scale-free network: the role of a hubB. KahngP2 Hemodynamic responses to emotions and decisions using near-infrared spectroscopy optical imagingNicoladie D. TamP3 Phase space analysis of hemodynamic responses to intentional movement directions using functional near-infrared spectroscopy (fNIRS) optical imaging techniqueNicoladie D.Tam, Luca Pollonini, George ZouridakisP4 Modeling jamming avoidance of weakly electric fishJaehyun Soh, DaeEun KimP5 Synergy and redundancy of retinal ganglion cells in predictionMinsu Yoo, S. E. PalmerP6 A neural field model with a third dimension representing cortical depthViviana Culmone, Ingo BojakP7 Network analysis of a probabilistic connectivity model of the Xenopus tadpole spinal cordAndrea Ferrario, Robert Merrison-Hort, Roman BorisyukP8 The recognition dynamics in the brainChang Sub KimP9 Multivariate spike train analysis using a positive definite kernelTaro TezukaP10 Synchronization of burst periods may govern slow brain dynamics during general anesthesiaPangyu JooP11 The ionic basis of heterogeneity affects stochastic synchronyYoung-Ah Rho, Shawn D. Burton, G. Bard Ermentrout, Jaeseung Jeong, Nathaniel N. UrbanP12 Circular statistics of noise in spike trains with a periodic componentPetr MarsalekP14 Representations of directions in EEG-BCI using Gaussian readoutsHoon-Hee Kim, Seok-hyun Moon, Do-won Lee, Sung-beom Lee, Ji-yong Lee, Jaeseung JeongP15 Action selection and reinforcement learning in basal ganglia during reaching movementsYaroslav I. Molkov, Khaldoun Hamade, Wondimu Teka, William H. Barnett, Taegyo Kim, Sergey Markin, Ilya A. RybakP17 Axon guidance: modeling axonal growth in T-Junction assayCsaba Forro, Harald Dermutz, László Demkó, János VörösP19 Transient cell assembly networks encode persistent spatial memoriesYuri Dabaghian, Andrey BabichevP20 Theory of population coupling and applications to describe high order correlations in large populations of interacting neuronsHaiping HuangP21 Design of biologically-realistic simulations for motor controlSergio Verduzco-FloresP22 Towards understanding the functional impact of the behavioural variability of neuronsFilipa Dos Santos, Peter AndrasP23 Different oscillatory dynamics underlying gamma entrainment deficits in schizophreniaChristoph Metzner, Achim Schweikard, Bartosz ZurowskiP24 Memory recall and spike frequency adaptationJames P. Roach, Leonard M. Sander, Michal R. ZochowskiP25 Stability of neural networks and memory consolidation preferentially occur near criticalityQuinton M. Skilling, Nicolette Ognjanovski, Sara J. Aton, Michal ZochowskiP26 Stochastic Oscillation in Self-Organized Critical States of Small Systems: Sensitive Resting State in Neural SystemsSheng-Jun Wang, Guang Ouyang, Jing Guang, Mingsha Zhang, K. Y. Michael Wong, Changsong ZhouP27 Neurofield: a C++ library for fast simulation of 2D neural field modelsPeter A. Robinson, Paula Sanz-Leon, Peter M. Drysdale, Felix Fung, Romesh G. Abeysuriya, Chris J. Rennie, Xuelong ZhaoP28 Action-based grounding: Beyond encoding/decoding in neural codeYoonsuck Choe, Huei-Fang YangP29 Neural computation in a dynamical system with multiple time scalesYuanyuan Mi, Xiaohan Lin, Si WuP30 Maximum entropy models for 3D layouts of orientation selectivityJoscha Liedtke, Manuel Schottdorf, Fred WolfP31 A behavioral assay for probing computations underlying curiosity in rodentsYoriko Yamamura, Jeffery R. WickensP32 Using statistical sampling to balance error function contributions to optimization of conductance-based modelsTimothy Rumbell, Julia Ramsey, Amy Reyes, Danel Draguljić, Patrick R. Hof, Jennifer Luebke, Christina M. WeaverP33 Exploration and implementation of a self-growing and self-organizing neuron network building algorithmHu He, Xu Yang, Hailin Ma, Zhiheng Xu, Yuzhe WangP34 Disrupted resting state brain network in obese subjects: a data-driven graph theory analysisKwangyeol Baek, Laurel S. Morris, Prantik Kundu, Valerie VoonP35 Dynamics of cooperative excitatory and inhibitory plasticityEverton J. Agnes, Tim P. VogelsP36 Frequency-dependent oscillatory signal gating in feed-forward networks of integrate-and-fire neuronsWilliam F. Podlaski, Tim P. VogelsP37 Phenomenological neural model for adaptation of neurons in area ITMartin Giese, Pradeep Kuravi, Rufin VogelsP38 ICGenealogy: towards a common topology of neuronal ion channel function and genealogy in model and experimentAlexander Seeholzer, William Podlaski, Rajnish Ranjan, Tim VogelsP39 Temporal input discrimination from the interaction between dynamic synapses and neural subthreshold oscillationsJoaquin J. Torres, Fabiano Baroni, Roberto Latorre, Pablo VaronaP40 Different roles for transient and sustained activity during active visual processingBart Gips, Eric Lowet, Mark J. Roberts, Peter de Weerd, Ole Jensen, Jan van der EerdenP41 Scale-free functional networks of 2D Ising model are highly robust against structural defects: neuroscience implicationsAbdorreza Goodarzinick, Mohammad D. Niry, Alireza ValizadehP42 High frequency neuron can facilitate propagation of signal in neural networksAref Pariz, Shervin S. Parsi, Alireza ValizadehP43 Investigating the effect of Alzheimer’s disease related amyloidopathy on gamma oscillations in the CA1 region of the hippocampusJulia M. Warburton, Lucia Marucci, Francesco Tamagnini, Jon Brown, Krasimira Tsaneva-AtanasovaP44 Long-tailed distributions of inhibitory and excitatory weights in a balanced network with eSTDP and iSTDPFlorence I. Kleberg, Jochen TrieschP45 Simulation of EMG recording from hand muscle due to TMS of motor cortexBahar Moezzi, Nicolangelo Iannella, Natalie Schaworonkow, Lukas Plogmacher, Mitchell R. Goldsworthy, Brenton Hordacre, Mark D. McDonnell, Michael C. Ridding, Jochen TrieschP46 Structure and dynamics of axon network formed in primary cell cultureMartin Zapotocky, Daniel Smit, Coralie Fouquet, Alain TrembleauP47 Efficient signal processing and sampling in random networks that generate variabilitySakyasingha Dasgupta, Isao Nishikawa, Kazuyuki Aihara, Taro ToyoizumiP48 Modeling the effect of riluzole on bursting in respiratory neural networksDaniel T. Robb, Nick Mellen, Natalia ToporikovaP49 Mapping relaxation training using effective connectivity analysisRongxiang Tang",
                    "citation": "T. Sharpee, A. Destexhe, M. Kawato, et al. (2016). 25th Annual Computational Neuroscience Meeting: CNS-2016. BMC Neuroscience. Citations: 81, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Table of contents Functional advantages of cell-type heterogeneity in neural circuits, Dynamics and biomarkers of mental disorders, and Objective criteria for computational neuroscience model selection are presented."
                    },
                    "url": "https://www.semanticscholar.org/paper/23a30ca55aef3e307c9e761b22a34080ebf6985f"
                },
                {
                    "title": "Impact of Seeding and Spatial Heterogeneity on Metapopulation Disease Dynamics",
                    "abstract": null,
                    "citation": "Rohit Rajuladevi (2022). Impact of Seeding and Spatial Heterogeneity on Metapopulation Disease Dynamics. Unknown Journal. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This study constructed and open-sourced metapopulation networks for countries around the world and used them to study the effect of seeding using an extension of a discrete-time SEIR simulator, PatchSim, to provide early insights into the impact of model initialization."
                    },
                    "url": "https://www.semanticscholar.org/paper/7c5ae7885195d514b6314472359b08a540492cec"
                },
                {
                    "title": "Modeling the Spatial Dynamics and Human Mobility in Zika Virus Transmission: A Review",
                    "abstract": "Spatial dynamics and human mobility significantly influence the transmission dynamics of vector-borne diseases like Zika virus. This paper reviews advancements in mathematical modeling that integrate spatial factors and human movement to enhance our understanding of disease transmission dynamics. Traditional SEIR (Susceptible-Exposed-Infectious-Recovered) models have been foundational but lack spatial heterogeneity and human mobility considerations. Recent studies have addressed these limitations by developing spatially explicit models that incorporate local interactions, environmental conditions, and human mobility patterns. By synthesizing findings from these studies, we identify strengths, limitations, and future research directions for improving predictive modeling of Zika virus transmission. Key insights include the amplifying effect of local interactions on disease spread and the critical role of human mobility networks in shaping transmission pathways. Addressing remaining challenges, such as refining spatial modeling techniques and integrating real-time data sources, will enhance the accuracy and applicability of spatial disease models in informing public health strategies.",
                    "citation": "Kasyoki Brandon Musili, M. Wainaina, Isaac Okwany (2024). Modeling the Spatial Dynamics and Human Mobility in Zika Virus Transmission: A Review. Asian Research Journal of Mathematics. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Key insights include the amplifying effect of local interactions on disease spread and the critical role of human mobility networks in shaping transmission pathways."
                    },
                    "url": "https://www.semanticscholar.org/paper/33338f7079bd4a8f050ef5d0c5d486dcc39a93ec"
                },
                {
                    "title": "25th Annual Computational Neuroscience Meeting: CNS-2016",
                    "abstract": "A1 Functional advantages of cell-type heterogeneity in neural circuits Tatyana O. Sharpee A2 Mesoscopic modeling of propagating waves in visual cortex Alain Destexhe A3 Dynamics and biomarkers of mental disorders Mitsuo Kawato F1 Precise recruitment of spiking output at theta frequencies requires dendritic h-channels in multi-compartment models of oriens-lacunosum/moleculare hippocampal interneurons Vladislav Sekulić, Frances K. Skinner F2 Kernel methods in reconstruction of current sources from extracellular potentials for single cells and the whole brains Daniel K. Wójcik, Chaitanya Chintaluri, Dorottya Cserpán, Zoltán Somogyvári F3 The synchronized periods depend on intracellular transcriptional repression mechanisms in circadian clocks. Jae Kyoung Kim, Zachary P. Kilpatrick, Matthew R. Bennett, Kresimir Josić O1 Assessing irregularity and coordination of spiking-bursting rhythms in central pattern generators Irene Elices, David Arroyo, Rafael Levi, Francisco B. Rodriguez, Pablo Varona O2 Regulation of top-down processing by cortically-projecting parvalbumin positive neurons in basal forebrain Eunjin Hwang, Bowon Kim, Hio-Been Han, Tae Kim, James T. McKenna, Ritchie E. Brown, Robert W. McCarley, Jee Hyun Choi O3 Modeling auditory stream segregation, build-up and bistability James Rankin, Pamela Osborn Popp, John Rinzel O4 Strong competition between tonotopic neural ensembles explains pitch-related dynamics of auditory cortex evoked fields Alejandro Tabas, André Rupp, Emili Balaguer-Ballester O5 A simple model of retinal response to multi-electrode stimulation Matias I. Maturana, David B. Grayden, Shaun L. Cloherty, Tatiana Kameneva, Michael R. Ibbotson, Hamish Meffin O6 Noise correlations in V4 area correlate with behavioral performance in visual discrimination task Veronika Koren, Timm Lochmann, Valentin Dragoi, Klaus Obermayer O7 Input-location dependent gain modulation in cerebellar nucleus neurons Maria Psarrou, Maria Schilstra, Neil Davey, Benjamin Torben-Nielsen, Volker Steuber O8 Analytic solution of cable energy function for cortical axons and dendrites Huiwen Ju, Jiao Yu, Michael L. Hines, Liang Chen, Yuguo Yu O9 C. elegans interactome: interactive visualization of Caenorhabditis elegans worm neuronal network Jimin Kim, Will Leahy, Eli Shlizerman O10 Is the model any good? Objective criteria for computational neuroscience model selection Justas Birgiolas, Richard C. Gerkin, Sharon M. Crook O11 Cooperation and competition of gamma oscillation mechanisms Atthaphon Viriyopase, Raoul-Martin Memmesheimer, Stan Gielen O12 A discrete structure of the brain waves Yuri Dabaghian, Justin DeVito, Luca Perotti O13 Direction-specific silencing of the Drosophila gaze stabilization system Anmo J. Kim, Lisa M. Fenk, Cheng Lyu, Gaby Maimon O14 What does the fruit fly think about values? A model of olfactory associative learning Chang Zhao, Yves Widmer, Simon Sprecher,Walter Senn O15 Effects of ionic diffusion on power spectra of local field potentials (LFP) Geir Halnes, Tuomo Mäki-Marttunen, Daniel Keller, Klas H. Pettersen,Ole A. Andreassen, Gaute T. Einevoll O16 Large-scale cortical models towards understanding relationship between brain structure abnormalities and cognitive deficits Yasunori Yamada O17 Spatial coarse-graining the brain: origin of minicolumns Moira L. Steyn-Ross, D. Alistair Steyn-Ross O18 Modeling large-scale cortical networks with laminar structure Jorge F. Mejias, John D. Murray, Henry Kennedy, Xiao-Jing Wang O19 Information filtering by partial synchronous spikes in a neural population Alexandra Kruscha, Jan Grewe, Jan Benda, Benjamin Lindner O20 Decoding context-dependent olfactory valence in Drosophila Laurent Badel, Kazumi Ohta, Yoshiko Tsuchimoto, Hokto Kazama P1 Neural network as a scale-free network: the role of a hub B. Kahng P2 Hemodynamic responses to emotions and decisions using near-infrared spectroscopy optical imaging Nicoladie D. Tam P3 Phase space analysis of hemodynamic responses to intentional movement directions using functional near-infrared spectroscopy (fNIRS) optical imaging technique Nicoladie D.Tam, Luca Pollonini, George Zouridakis P4 Modeling jamming avoidance of weakly electric fish Jaehyun Soh, DaeEun Kim P5 Synergy and redundancy of retinal ganglion cells in prediction Minsu Yoo, S. E. Palmer P6 A neural field model with a third dimension representing cortical depth Viviana Culmone, Ingo Bojak P7 Network analysis of a probabilistic connectivity model of the Xenopus tadpole spinal cord Andrea Ferrario, Robert Merrison-Hort, Roman Borisyuk P8 The recognition dynamics in the brain Chang Sub Kim P9 Multivariate spike train analysis using a positive definite kernel Taro Tezuka P10 Synchronization of burst periods may govern slow brain dynamics during general anesthesia Pangyu Joo P11 The ionic basis of heterogeneity affects stochastic synchrony Young-Ah Rho, Shawn D. Burton, G. Bard Ermentrout, Jaeseung Jeong, Nathaniel N. Urban P12 Circular statistics of noise in spike trains with a periodic component Petr Marsalek P14 Representations of directions in EEG-BCI using Gaussian readouts Hoon-Hee Kim, Seok-hyun Moon, Do-won Lee, Sung-beom Lee, Ji-yong Lee, Jaeseung Jeong P15 Action selection and reinforcement learning in basal ganglia during reaching movements Yaroslav I. Molkov, Khaldoun Hamade, Wondimu Teka, William H. Barnett, Taegyo Kim, Sergey Markin, Ilya A. Rybak P17 Axon guidance: modeling axonal growth in T-Junction assay Csaba Forro, Harald Dermutz, László Demkó, János Vörös P19 Transient cell assembly networks encode persistent spatial memories Yuri Dabaghian, Andrey Babichev P20 Theory of population coupling and applications to describe high order correlations in large populations of interacting neurons Haiping Huang P21 Design of biologically-realistic simulations for motor control Sergio Verduzco-Flores P22 Towards understanding the functional impact of the behavioural variability of neurons Filipa Dos Santos, Peter Andras P23 Different oscillatory dynamics underlying gamma entrainment deficits in schizophrenia Christoph Metzner, Achim Schweikard, Bartosz Zurowski P24 Memory recall and spike frequency adaptation James P. Roach, Leonard M. Sander, Michal R. Zochowski P25 Stability of neural networks and memory consolidation preferentially occur near criticality Quinton M. Skilling, Nicolette Ognjanovski, Sara J. Aton, Michal Zochowski P26 Stochastic Oscillation in Self-Organized Critical States of Small Systems: Sensitive Resting State in Neural Systems Sheng-Jun Wang, Guang Ouyang, Jing Guang, Mingsha Zhang, K. Y. Michael Wong, Changsong Zhou P27 Neurofield: a C++ library for fast simulation of 2D neural field models Peter A. Robinson, Paula Sanz-Leon, Peter M. Drysdale, Felix Fung, Romesh G. Abeysuriya, Chris J. Rennie, Xuelong Zhao P28 Action-based grounding: Beyond encoding/decoding in neural code Yoonsuck Choe, Huei-Fang Yang P29 Neural computation in a dynamical system with multiple time scales Yuanyuan Mi, Xiaohan Lin, Si Wu P30 Maximum entropy models for 3D layouts of orientation selectivity Joscha Liedtke, Manuel Schottdorf, Fred Wolf P31 A behavioral assay for probing computations underlying curiosity in rodents Yoriko Yamamura, Jeffery R. Wickens P32 Using statistical sampling to balance error function contributions to optimization of conductance-based models Timothy Rumbell, Julia Ramsey, Amy Reyes, Danel Draguljić, Patrick R. Hof, Jennifer Luebke, Christina M. Weaver P33 Exploration and implementation of a self-growing and self-organizing neuron network building algorithm Hu He, Xu Yang, Hailin Ma, Zhiheng Xu, Yuzhe Wang P34 Disrupted resting state brain network in obese subjects: a data-driven graph theory analysis Kwangyeol Baek, Laurel S. Morris, Prantik Kundu, Valerie Voon P35 Dynamics of cooperative excitatory and inhibitory plasticity Everton J. Agnes, Tim P. Vogels P36 Frequency-dependent oscillatory signal gating in feed-forward networks of integrate-and-fire neurons William F. Podlaski, Tim P. Vogels P37 Phenomenological neural model for adaptation of neurons in area IT Martin Giese, Pradeep Kuravi, Rufin Vogels P38 ICGenealogy: towards a common topology of neuronal ion channel function and genealogy in model and experiment Alexander Seeholzer, William Podlaski, Rajnish Ranjan, Tim Vogels P39 Temporal input discrimination from the interaction between dynamic synapses and neural subthreshold oscillations Joaquin J. Torres, Fabiano Baroni, Roberto Latorre, Pablo Varona P40 Different roles for transient and sustained activity during active visual processing Bart Gips, Eric Lowet, Mark J. Roberts, Peter de Weerd, Ole Jensen, Jan van der Eerden P41 Scale-free functional networks of 2D Ising model are highly robust against structural defects: neuroscience implications Abdorreza Goodarzinick, Mohammad D. Niry, Alireza Valizadeh P42 High frequency neuron can facilitate propagation of signal in neural networks Aref Pariz, Shervin S. Parsi, Alireza Valizadeh P43 Investigating the effect of Alzheimer’s disease related amyloidopathy on gamma oscillations in the CA1 region of the hippocampus Julia M. Warburton, Lucia Marucci, Francesco Tamagnini, Jon Brown, Krasimira Tsaneva-Atanasova P44 Long-tailed distributions of inhibitory and excitatory weights in a balanced network with eSTDP and iSTDP Florence I. Kleberg, Jochen Triesch P45 Simulation of EMG recording from hand muscle due to TMS of motor cortex Bahar Moezzi, Nicolangelo Iannella, Natalie Schaworonkow, Lukas Plogmacher, Mitchell R. Goldsworthy, Brenton Hordacre, Mark D. McDonnell, Michael C. Ridding, Jochen Triesch P46 Structure and dynamics of axon network formed in primary cell culture Martin Zapotocky, Daniel Smit, Coralie Fouquet, Alain Trembleau P47 Efficient signal processing and sampling in random networks that generate variability Sakyasingha Dasgupta, Isao Nishikawa, Kazuyuki Aihara, Taro Toyoizumi P48 Modeling the effect of riluzole on bursting in respiratory neural networks Daniel T",
                    "citation": "T. Sharpee, A. Destexhe, M. Kawato, et al. (2016). 25th Annual Computational Neuroscience Meeting: CNS-2016. BMC Neuroscience. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A functional advantages of cell-type heterogeneity in neural circuits and a model of olfactory associative learning for computational neuroscience model selection are presented."
                    },
                    "url": "https://www.semanticscholar.org/paper/50920b36cca05c524a658a453fd5484e1498b898"
                },
                {
                    "title": "Festschrift on the occasion of Ulrike Feudel’s 60th birthday",
                    "abstract": null,
                    "citation": "J. Freund, Ksenia Guseva, C. Grebogi (2017). Festschrift on the occasion of Ulrike Feudel’s 60th birthday. Unknown Journal. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/0f9fdfb4833a3a9e5ffea14360f8a9ed9b688fcd"
                }
            ],
            "summary": ""
        },
        {
            "query": "SEIR model parameters transmission rate incubation latent rate recovery rate respiratory diseases influenza COVID-19",
            "papers": [
                {
                    "title": "A Susceptible Exposed Infected Recovered Susceptible (SEIRS) Model for the Transmission of Tuberculosis",
                    "abstract": "In this paper, a deterministic mathematical model was proposed and analyzed to understand the dynamics of tuberculosis based on the SEIRS model. The disease-free equilibrium, the endemic equilibrium, and their stabilities were examined. The R0 (basic reproduction number) was derived using the Next Generation Matrix method and its sensitivity analysis showed that the birth rate and infectious rate were the most sensitive parameters of R0. The behaviour of exposed individuals at the latent period with varied treatment rates were examined through numerical simulation. From the analysis carried out, the effect of variations of the treatments of latent TB shows that it affects the disease burden. This implies that testing and treatment of latent TB are important in preventing it from becoming infectious. The re-infection rate was examined to see the effect it had both on the recovered and susceptible populations. The study concludes by recommending the extension of the model to an age structured model with co-infection with another respiratory infectious disease like COVID-19. \nKeywords: Epidemiology; Latent TB treatment; Basic Reproduction Number; sensitivity analysis; numerical simulation",
                    "citation": "L. M. Erinle-Ibrahim, Waheed O Lawal, O. Adebimpe, et al. (2021). A Susceptible Exposed Infected Recovered Susceptible (SEIRS) Model for the Transmission of Tuberculosis. Tanzania Journal of Science. Citations: 3, Influential: 1.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "From the analysis carried out, the effect of variations of the treatments of latent TB shows that it affects the disease burden, which implies that testing and treatment of latentTB are important in preventing it from becoming infectious."
                    },
                    "url": "https://www.semanticscholar.org/paper/1e727d7c94cd21035927549042b82435c2e4460e"
                },
                {
                    "title": "The Study of COVID-19 Virus Infection Based on the SEIR Model",
                    "abstract": "From the Black Death to SARS to influenza A (H1N1), communicable diseases have always been among the uppermost problem endangering human health and have caused crises all over the world countless times. Practical relevance of a thorough knowledge of the transmission pathways and related mechanisms of infectious diseases are complex. Investigating the laws of infectious illness transmission mostly depends on the building of dynamic models. Designing corresponding models based on specific transmission mechanisms can more realistically depict the transmission dynamics of infectious diseases and provide higher accuracy for parameter estimation. This study suggested an enhanced SEIR model and performed a comprehensive investigation of its equilibrium point and stability, acknowledging that individuals infected with the novel coronavirus are contagious in time of their incubation period. Consequently, an empirical investigation was undertaken utilizing this model to analyze the overall trend of the epidemic in China and the outbreak aboard the Diamond Princess cruise ship. Key model parameters, such as the infection rate coefficient, control coefficient, basic reproduction number, and the particular time at which the effective reproduction number declines to 1, were ascertained by the maximum likelihood estimation approach. The cumulative confirmed case fitting curves for the national pandemic in China and the Diamond Princess outbreak were presented concurrently to further validate the model's efficacy",
                    "citation": "Fan Gao (2025). The Study of COVID-19 Virus Infection Based on the SEIR Model. Theoretical and Natural Science. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This study suggested an enhanced SEIR model and performed a comprehensive investigation of its equilibrium point and stability, acknowledging that individuals infected with the novel coronavirus are contagious in time of their incubation period."
                    },
                    "url": "https://www.semanticscholar.org/paper/26d24990cca8d35f34dadd9d197a49fd3d8b5a60"
                },
                {
                    "title": "RLIM: a recursive and latent infection model for the prediction of US COVID-19 infections and turning points",
                    "abstract": "Initially found in Hubei, Wuhan, and identified as a novel virus of the coronavirus family by the WHO, COVID-19 has spread worldwide at exponential speed, causing millions of deaths and public fear. Currently, the USA, India, Brazil, and other parts of the world are experiencing a secondary wave of COVID-19. However, the medical, mathematical, and pharmaceutical aspects of its transmission, incubation, and recovery processes are still unclear. The classical susceptible–infected–recovered model has limitations in describing the dynamic behavior of COVID-19. Hence, it is necessary to introduce a recursive, latent model to predict the number of future COVID-19 infection cases in the USA. In this article, a dynamic recursive and latent infection model (RLIM) based on the classical SEIR model is proposed to predict the number of COVID-19 infections. Given COVID-19 infection and recovery data for a certain period, the RLIM is able to fit current values and produce an optimal set of parameters with a minimum error rate according to actual reported numbers. With these optimal parameters assigned, the RLIM model then becomes able to produce predictions of infection numbers within a certain period. To locate the turning point of COVID-19 transmission, an initial value for the secondary infection rate is given to the RLIM algorithm for calculation. RLIM will then calculate the secondary infection rates of a continuous time series with an iterative search strategy to speed up the convergence of the prediction outcomes and minimize the maximum square errors. Compared with other forecast algorithms, RLIM is able to adapt the COVID-19 infection curve faster and more accurately and, more importantly, provides a way to identify the turning point in virus transmission by searching for the equilibrium between recoveries and new infections. Simulations of four US states show that with the secondary infection rate ω\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\omega $$\\end{document} initially set to 0.5 within the selected latent period of 14 days, RLIM is able to minimize this value at 0.07 and reach an equilibrium condition. A successful forecast is generated using New York state’s COVID-19 transmission, in which a turning point is predicted to emerge on January 31, 2021.",
                    "citation": "Xiang Yu, Lihua Lu, Jianyi Shen, et al. (2021). RLIM: a recursive and latent infection model for the prediction of US COVID-19 infections and turning points. Nonlinear dynamics. Citations: 5, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A dynamic recursive and latent infection model (RLIM) based on the classical SEIR model is proposed to predict the number of COVID-19 infections in the USA and provides a way to identify the turning point in virus transmission by searching for the equilibrium between recoveries and new infections."
                    },
                    "url": "https://www.semanticscholar.org/paper/31cfcfc96337cc0886b5d5486975903dfd83b2cd"
                },
                {
                    "title": "Dynamic analysis of a three-strain COVID-19 SEIR epidemic model with general incidence rates",
                    "abstract": null,
                    "citation": "Omar Khyar (2020). Dynamic analysis of a three-strain COVID-19 SEIR epidemic model with general incidence rates. Unknown Journal. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": null
                    },
                    "url": "https://www.semanticscholar.org/paper/756243d8c6e71b1ec534b168b7a2ba46c5a9cc74"
                },
                {
                    "title": "Bayesian approach for modelling the dynamic of COVID-19 outbreak on the Diamond Princess Cruise Ship",
                    "abstract": "The outbreaks of acute respiratory infectious disease with high attack rates on cruise ships were rarely studied. The outbreak of COVID-19 on the Diamond Princess Cruise Ship provides an unprecedented opportunity to estimate its original transmissibility with basic reproductive number (R0) and the effectiveness of containment measures. The traditional deterministic approach for estimating R0 is based on the outbreak of a large population size rather than that a small cohort of cruise ship. The parameters are therefore fraught with uncertainty. To tackle this problem, we developed a Bayesian Susceptible-Exposed-Infected-Recovery (SEIR) model with ordinary differential equation (ODE) to estimate three parameters, including transmission coefficients, the latent period, and the recovery rate given the uncertainty implicated the outbreak of COVID-19 on cruise ship with modest population size. Based on the estimated results on these three parameters before the introduction of partial containment measures, the natural epidemic curve after intervention was predicted and compared with the observed curve in order to assess the efficacy of containment measures. With the application of the Bayesian model to the empirical data on COVID-19 outbreak on the Diamond Princess Cruise Ship, the R0 was estimated as high as 5.71(95% credible interval: 4.08-7.55) because of its aerosols and fomite transmission mode. The simulated trajectory shows the entire epidemic period without containment measurements was approximately 47 days and reached the peak one month later after the index case. The partial containment measure reduced 34% (95% credible interval: 31-36%) infected passengers. Such a discovery provides an insight into timely evacuation and early isolation and quarantine with decontamination for containing other cruise ships and warship outbreaks.",
                    "citation": "C.-C. Lai, C.-y. Hsu, Hsiao-Hsuan Jen, et al. (2020). Bayesian approach for modelling the dynamic of COVID-19 outbreak on the Diamond Princess Cruise Ship. medRxiv. Citations: 3, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A Bayesian Susceptible-Exposed-Infected-Recovery (SEIR) model with ordinary differential equation (ODE) was developed to estimate three parameters, including transmission coefficients, the latent period, and the recovery rate given the uncertainty implicated the outbreak of COVID-19 on cruise ship with modest population size."
                    },
                    "url": "https://www.semanticscholar.org/paper/31525d24783d3d4b61638fab8cd0828940255dd7"
                },
                {
                    "title": "The Evolution of the Identifiable Analysis of the COVID-19 Virus",
                    "abstract": "It is important to accurately forecast a new infection such as COVID-19 in order to effectively 4 implement control measures. For this purpose, we study whether the epidemiological parameters 5 such as the rate of infection, incubation period, and rate of recovery for the COVID-19 disease 6 can be identified from daily incidences and death data. The data are obtained from the Florida 7 Department of Health, which reports the numbers of daily COVID-19 cases and disease-induced 8 casualties. Two mathematical models that consist of a system of ordinary differential equations are 9 used to simulate the spread of the coronavirus in the Florida population. Structural identifiability 10 analysis is conducted on the models to determine whether the models are well-structured to forecast 11 the outbreak. Analysis revealed that the SEIR model is structurally identifiable, while the social 12 distancing model is not structurally identifiable. If the model is structurally unidentifiable, it may 13 not accurately forecast the pandemic, and in turn, may lead to inaccurate control measures. Then, 14 the practical identifiability of parameter estimates that provide the best fit was investigated using 15 Monte Carlo simulations. The practical identifiability analysis revealed that all of the parameters 16 in the SEIR model are practically identifiable, but the parameters δ, δE , and ρ were found to be 17 unidentifiable in the social distancing model. By comparing two models in this project, we were able 18 to determine the effectiveness of social distancing in preventing incidences and saving lives from the 19 disease in Florida. Furthermore, we consider how people’s behavior changes over time, and how this 20 may affect the rate of disease spread in the population. To represent this, we develop a recipe to 21 determine the time-dependent transmission rate, β(t), from the data and introduce a methodology 22 of how to accomplish this. 23",
                    "citation": "Vivek Sreejithkumar (2021). The Evolution of the Identifiable Analysis of the COVID-19 Virus. SIAM Undergraduate Research Online. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Whether the epidemiological parameters for the COVID-19 disease can be identified from daily incidences and death data and how people’s behavior changes over time may affect the rate of disease spread in the population is considered."
                    },
                    "url": "https://www.semanticscholar.org/paper/66dba97fd4399f796894d5d7434a0862b00da00a"
                },
                {
                    "title": "Computational modelling of COVID-19: A study of compliance and superspreaders",
                    "abstract": "Background: The success of social distancing implementations of severe acute respiratory syndrome coronavirus 2 (SARS-Cov-2) depends heavily on population compliance. Mathematical modelling has been used extensively to assess the rate of viral transmission from behavioural responses. Previous epidemics of SARS-Cov-2 have been characterised by superspreaders, a small number of individuals who transmit a disease to a large group of individuals, who contribute to the stochasticity (or randomness) of transmission compared to other pathogens such as Influenza. This growing evidence proves an urgent matter to understand transmission routes in order to target and combat outbreaks. Objective: To investigate the role of superspreaders in the rate of viral transmission with various levels of compliance. Method: A SEIRS inspired social network model is adapted and calibrated to observe the infected links of a general population with and without superspreaders on four compliance levels. Local and global connection parameters are adjusted to simulate close contact networks and travel restrictions respectively and each performance assessed. The mean and standard deviation of infections with superspreaders and non-superspreaders were calculated for each compliance level. Results: Increased levels of compliance of superspreaders proves a significant reduction in infections. Assuming long-lasting immunity, superspreaders could potentially slow down the spread due to their high connectivity. Discussion: The main advantage of applying the network model is to capture the heterogeneity and locality of social networks, including the role of superspreaders in epidemic dynamics. The main challenge is the immediate attention on social settings with targeted interventions to tackle superspreaders in future empirical work. Conclusion: Superspreaders play a central role in slowing down infection spread following compliance guidelines. It is crucial to adjust social distancing measures to prevent future outbreaks accompanied by population-wide testing and effective tracing.",
                    "citation": "F. Lee, Maria Perez Ortiz, J. Shawe-Taylor (2021). Computational modelling of COVID-19: A study of compliance and superspreaders. medRxiv. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is crucial to adjust social distancing measures to prevent future outbreaks accompanied by population-wide testing and effective tracing to investigate the role of superspreaders in the rate of viral transmission with various levels of compliance."
                    },
                    "url": "https://www.semanticscholar.org/paper/696ecbb83748aa44e777f2f05c631abe42906884"
                }
            ],
            "summary": ""
        }
    ]
}