{
    "results": [
        {
            "query": "systemic risk financial networks core-periphery threshold cascade contagion failure propagation",
            "papers": [
                {
                    "title": "Systemic Risk and Default Cascades in Global Equity Markets: Extending the Gai-Kapadia Framework with Stochastic Simulations and Network Analysis",
                    "abstract": "This study pioneers the application of the Gai-Kapadia framework, originally developed for interbank contagion, to global equity markets. It offers a novel approach to assess systemic risk and default cascades. Using a 20-asset network (13 Brazilian and 7 developed market assets) from 2015 to 2025, we construct exposure-based networks from price co-movements, applying thresholds theta = 0.3 and theta = 0.5 to capture significant interconnections. Cascade dynamics are evaluated through Monte Carlo simulations (n = 1000) with shocks ranging from 10 to 50 percent, complemented by deterministic propagation analysis. Results show that high clustering among Brazilian assets (Ci approx 1.0) leads to localized contagion, with an average of 2.0 failed assets per simulation. In contrast, developed markets with lower connectivity (Ci approx 0.2 to 0.4) show resilience, with zero failures beyond Brazil in all scenarios. Network visualizations highlight structural vulnerabilities: deterministic cascades reach up to 20 assets at theta = 0.3, but only 3 to 4 at theta = 0.5. Risk measures such as VaR and CVaR at 95 percent confidence confirm higher tail risks in emerging markets. This adaptation of the Gai-Kapadia model provides a robust framework for systemic risk assessment. The findings suggest that regulators should target high-clustering nodes in emerging markets, while portfolio managers may benefit from the resilience of developed markets to enhance diversification.",
                    "citation": "Ana I. C. Pereda (2025). Systemic Risk and Default Cascades in Global Equity Markets: Extending the Gai-Kapadia Framework with Stochastic Simulations and Network Analysis. Unknown Journal. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/c45721cc4451b9594850e00264fcd67a9d83af27"
                },
                {
                    "title": "Intelligent Risk Management and Decision-Making in Complex Offshore Engineering Projects",
                    "abstract": "The offshore engineering industry stands at the confluence of extreme environmental conditions, intricate supply chains, and high capital intensity. Such projects—spanning from subsea infrastructure development to deep-water production systems—are inherently exposed to multifaceted uncertainties across technical, financial, environmental, and human domains. Traditional risk management frameworks, though methodologically sound, have proven insufficient in coping with the dynamic, data-rich, and uncertainty-dominated nature of modern offshore projects. The central research problem addressed in this study is the persistent limitation of deterministic and semi-quantitative risk management approaches in managing complex, uncertain, and interdependent risks throughout the offshore project lifecycle. This paper proposes an integrated decision-support model that leverages intelligent risk analysis, probabilistic simulation, and organizational learning principles to enhance decision-making under uncertainty in offshore project planning and execution. The primary objective of this research is to develop and validate a hybrid intelligent risk management model—referred to herein as the Intelligent Offshore Decision-Support Model (IODSM)—that integrates artificial intelligence (AI)-assisted analytics, probabilistic risk quantification (using Monte Carlo simulation), and qualitative reasoning (through fuzzy logic) within a unified decision-support framework. The model is designed to operate across the Front-End Engineering Design (FEED) and Engineering, Procurement, Construction, Installation, and Commissioning (EPCIC) phases, enabling continuous risk learning and adaptive decision optimization. The novelty of the IODSM lies in its multi-layered integration: combining data-driven insights from historical and real-time project data with probabilistic forecasting and human-centered learning systems to achieve both predictive precision and organizational adaptability. The methodology adopted in this study synthesizes three core components. The first component is data-driven risk identification and mitigation, enabled through advanced analytics and AI techniques. This includes the use of supervised learning algorithms for pattern recognition in failure and performance datasets, unsupervised clustering for anomaly detection in cost and schedule deviations, and Bayesian belief networks for dynamic probabilistic inference under uncertainty. These techniques transform disparate project data—ranging from engineering design parameters to procurement logistics—into actionable risk intelligence. The second component is advanced risk prioritization, integrating Monte Carlo simulation and fuzzy logic. Monte Carlo simulation provides quantitative insights into cost and schedule variability by propagating probabilistic input distributions through project models, generating a risk-informed range of possible outcomes. Fuzzy logic complements this by incorporating qualitative or incomplete risk information (e.g., expert judgment, environmental unpredictability, and human reliability factors) into a structured reasoning framework that supports more nuanced risk prioritization. The third component introduces Learning Organization principles, embedding continuous learning, feedback loops, and psychological safety within the risk management process. Through structured post-event reviews, digital knowledge repositories, and AI-assisted learning analytics, the organization evolves into a learning ecosystem capable of adaptive decision-making. This triadic integration—AI-driven analytics, probabilistic simulation, and learning-oriented culture—forms the methodological foundation of the proposed decision-support model. A simulated application of the IODSM was conducted using representative offshore project data, encompassing FEED cost estimation uncertainties, EPCIC schedule deviations, and marine installation risk profiles. The results demonstrate substantial improvements in predictive accuracy, decision robustness, and organizational learning outcomes. From a quantitative perspective, the integration of Monte Carlo simulation reduced cost estimation uncertainty ranges by approximately 25% compared to traditional deterministic models. The inclusion of fuzzy logic in qualitative risk scoring improved prioritization accuracy by 18%, as measured against post-project validation data. AI-assisted anomaly detection identified latent correlations between procurement delays and weather-related offshore installation risks that were previously overlooked in conventional risk registers. These findings underscore the value of intelligent risk analytics in enhancing the comprehensiveness and responsiveness of offshore risk management. From an organizational perspective, embedding the Learner Mindset into the IODSM yielded qualitative benefits in project culture and long-term resilience. The model’s learning feedback loops facilitated iterative improvement across successive projects, transforming historical “lessons learned” into predictive knowledge assets. Psychological safety—defined as the freedom to voice concerns or share errors without fear of reprisal—proved critical to fostering a data-sharing culture that feeds the AI analytics engine. Moreover, the structured reflection processes enabled by the model promoted a shift from reactive risk mitigation to proactive risk anticipation. In this sense, the IODSM not only enhances decision quality but also cultivates a sustainable organizational learning capability—a critical differentiator in an industry where the cost of error is measured in both capital and environmental terms. A key contribution of this research lies in the systemic integration of technology and human factors within a coherent risk management architecture. The IODSM transcends the conventional divide between quantitative risk modeling and qualitative human judgment by embedding both into a continuous learning cycle. Data from project execution phases feed back into the AI models, refining probabilistic parameters and fuzzy inference systems. Simultaneously, human feedback from project teams updates contextual understanding and calibrates the model’s learning algorithms. This dual-loop feedback mechanism—one digital and one cognitive—ensures that the system remains both technically accurate and contextually relevant. Such integration aligns with modern systems engineering principles and the emerging paradigm of intelligent infrastructure management. The implications of the research are multifaceted. At the strategic level, the adoption of the IODSM enables offshore project stakeholders—operators, contractors, and regulators—to make risk-informed decisions with greater confidence and transparency. The model supports scenario-based planning, enabling decision-makers to test the resilience of project strategies under varying uncertainty conditions (e.g., market volatility, supply chain disruptions, or environmental hazards). At the operational level, the model enhances the efficiency of project planning and control by dynamically updating risk profiles as new data emerge. This adaptive capability reduces the lag between risk detection and mitigation, thereby minimizing the likelihood of cascading project failures. At the organizational level, the IODSM provides a structural mechanism for institutional learning, allowing knowledge gained from one project to inform future endeavors. This represents a critical shift from static risk registers to dynamic, self-evolving knowledge systems. The research further highlights several practical enablers for implementation. These include the establishment of integrated data platforms capable of consolidating design, procurement, and construction data; the deployment of AI-driven risk dashboards for real-time visualization of uncertainty propagation; and the incorporation of learning analytics modules to measure the effectiveness of risk interventions over time. The study also emphasizes the importance of leadership commitment and governance structures in embedding learning organization principles. Without psychological safety, transparent communication, and an open feedback culture, the technological sophistication of the IODSM cannot yield its full benefits. Thus, successful implementation requires alignment across technology, process, and culture. In conclusion, this study advances the field of offshore project management by presenting a comprehensive, intelligent, and adaptive framework for risk-informed decision-making under uncertainty. The proposed IODSM embodies a paradigm shift from deterministic, reactive risk management to probabilistic, proactive, and learning-oriented governance. By coupling AI-assisted analytics with probabilistic modeling and embedding these within a culture of continuous learning, offshore organizations can achieve greater resilience, efficiency, and innovation. The findings suggest that intelligent risk management, when supported by a learner mindset, can transform uncertainty from a source of vulnerability into a strategic asset for organizational growth and sustainability. This integration marks a critical evolution in offshore engineering—where the convergence of data intelligence, probabilistic reasoning, and human learning forms the foundation for safer, more adaptive, and future-ready project ecosystems",
                    "citation": "James Aigboduwa (2025). Intelligent Risk Management and Decision-Making in Complex Offshore Engineering Projects. International journal of petroleum and gas engineering research. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/a7f3f4a68c233b90e7b626a446e5cf49e1ab0f51"
                },
                {
                    "title": "Supervision of Banking Networks Using the Multivariate Threshold-Minimum Dominating Set (mT-MDS)",
                    "abstract": "The global financial crisis of 2008, triggered by the collapse of Lehman Brothers, highlighted a banking system that was widely exposed to systemic risk. The minimization of the systemic risk via a close and detailed monitoring of the entire banking network became a priority. This is a complex and demanding task considering the size of the banking systems; in the US and the EU they include more than 10,000 institutions. In this paper, we introduce a methodology which identifies a subset of banks that can: (a) efficiently represent the behavior of the whole banking system, and (b), provide, in the case of a failure, a plausible range of the crisis dispersion. The proposed methodology can be used by the regulators as an auxiliary monitoring tool to identify groups of banks that are potentially in distress and try to swiftly remedy their problems and minimize the propagation of the crisis by restricting contagion. This methodology is based on graph theory, and more specifically, complex networks. We termed this setting a “multivariate Threshold–Minimum Dominating Set” (mT-MDS), and it is an extension of the Threshold–Minimum Dominating Set methodology. The method was tested on a dataset of 570 U.S. banks, including 429 solvent ones and 141 failed ones. The variables used to create the networks were as follows: the total interest expense; the total interest income; the tier 1 (core) risk-based capital; and the total assets. The empirical results reveal that the proposed methodology can be successfully employed as an auxiliary tool for the efficient supervision of a large banking network.",
                    "citation": "Periklis Gogas, Theophilos Papadimitriou, M. Matthaiou (2022). Supervision of Banking Networks Using the Multivariate Threshold-Minimum Dominating Set (mT-MDS). Journal of Risk and Financial Management. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A methodology which identifies a subset of banks that can efficiently represent the behavior of the whole banking system and provide, in the case of a failure, a plausible range of the crisis dispersion is introduced."
                    },
                    "url": "https://www.semanticscholar.org/paper/61127f017517280331c91642bd3f386173890581"
                },
                {
                    "title": "Financial fire sales as continuous-state complex contagion",
                    "abstract": "Trading activities in financial systems create various channels through which systemic risk can propagate. An important contagion channel is financial fire sales, where a bank failure causes asset prices to fall due to asset liquidation, which in turn drives further bank defaults, triggering the next rounds of liquidation. This process can be considered as complex contagion, yet it cannot be modeled using the conventional binary-state contagion models because there is a continuum of states representing asset prices. Here, we develop a threshold model of continuous-state cascades in which the states of each node are represented by real values. We show that the solution of a multi-state contagion model, for which the continuous states are discretized, accurately replicates the simulated continuous state distribution as long as the number of states is moderately large. This discretization approach allows us to exploit the power of approximate master equations (AME) to trace the trajectory of the fraction of defaulted banks and obtain the distribution of asset prices that characterize the dynamics of fire sales on asset-bank bipartite networks. We examine the accuracy of the proposed method using real data on asset-holding relationships in exchange-traded funds (ETFs).",
                    "citation": "Tomokatsu Onaga, F. Caccioli, Teruyoshi Kobayashi (2022). Financial fire sales as continuous-state complex contagion. Physical Review Research. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A threshold model of continuous-state cascades in which the states of each node are represented by real values is developed, and the solution of a multi-state contagion model, for which the continuous states are discretized, accurately replicates the simulated continuous state distribution as long as the number of states is moderately large."
                    },
                    "url": "https://www.semanticscholar.org/paper/1110335c872424e914f0e3a9ee87aac132dc510b"
                },
                {
                    "title": "Speed of Financial Contagion and Optimal Timing for Intervention∗",
                    "abstract": null,
                    "citation": "Diana G. Mikhail (2020). Speed of Financial Contagion and Optimal Timing for Intervention∗. Unknown Journal. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/1efb755735c11783925cd94be590b5956a44b16e"
                },
                {
                    "title": "Assessing the impact of incomplete information on the resilience of financial networks",
                    "abstract": null,
                    "citation": "Matteo Cinelli, Giovanna Ferraro, Antonio Iovanella, et al. (2019). Assessing the impact of incomplete information on the resilience of financial networks. Annals of Operations Research. Citations: 17, Influential: 1.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Simulations showed that the actual network was far from the worst scenario for the propagation of contagion, meaning that the role of unobserved links can substantially alter the resilience of the whole network."
                    },
                    "url": "https://www.semanticscholar.org/paper/838c9bc3f9ffdde5713a9b3c3ab38c4484a71963"
                },
                {
                    "title": "Interconnectedness: mapping the shadow banking system",
                    "abstract": null,
                    "citation": "R. Portes (2018). Interconnectedness: mapping the shadow banking system. Unknown Journal. Citations: 7, Influential: 1.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/1041222c7fb1cdf77319f3aca1ab4d6cbfb71ff4"
                }
            ],
            "summary": ""
        }
    ]
}