{
    "results": [
        {
            "query": "final size relation SIR model validation by simulation and network effects",
            "papers": [
                {
                    "paper_title": "Edge-Based Compartmental Modelling of an SIR Epidemic on a Dual-Layer Static–Dynamic Multiplex Network with Tunable Clustering",
                    "abstract": "The duration, type and structure of connections between individuals in real-world populations play a crucial role in how diseases invade and spread. Here, we incorporate the aforementioned heterogeneities into a model by considering a dual-layer static–dynamic multiplex network. The static network layer affords tunable clustering and describes an individual’s permanent community structure. The dynamic network layer describes the transient connections an individual makes with members of the wider population by imposing constant edge rewiring. We follow the edge-based compartmental modelling approach to derive equations describing the evolution of a susceptible–infected–recovered epidemic spreading through this multiplex network of individuals. We derive the basic reproduction number, measuring the expected number of new infectious cases caused by a single infectious individual in an otherwise susceptible population. We validate model equations by showing convergence to pre-existing edge-based compartmental model equations in limiting cases and by comparison with stochastically simulated epidemics. We explore the effects of altering model parameters and multiplex network attributes on resultant epidemic dynamics. We validate the basic reproduction number by plotting its value against associated final epidemic sizes measured from simulation and predicted by model equations for a number of set-ups. Further, we explore the effect of varying individual model parameters on the basic reproduction number. We conclude with a discussion of the significance and interpretation of the model and its relation to existing research literature. We highlight intrinsic limitations and potential extensions of the present model and outline future research considerations, both experimental and theoretical.",
                    "citation": "R. Barnard, I. Kiss, L. Berthouze... (2018). Edge-Based Compartmental Modelling of an SIR Epidemic on a Dual-Layer Static–Dynamic Multiplex Network with Tunable Clustering. Bulletin of Mathematical Biology, 80, 2698 - 2733. DOI: 10.1007/s11538-018-0484-5",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The duration, type and structure of connections between individuals in real-world populations play a crucial role in how diseases invade and spread and here, heterogeneities are incorporated into a model by considering a dual-layer static–dynamic multiplex network."
                    }
                },
                {
                    "paper_title": "An Edge-Based Model of SEIR Epidemics on Static Random Networks",
                    "abstract": null,
                    "citation": "Cherrylyn P Alota, C. P. Pilar-Arceo, A. de los Reyes V (2020). An Edge-Based Model of SEIR Epidemics on Static Random Networks. Bulletin of Mathematical Biology, 82. DOI: 10.1007/s11538-020-00769-0",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results in this paper can be used as an alternative way of explaining the spread of disease and it provides implications on the control strategies applied to mitigate the disease transmission."
                    }
                },
                {
                    "paper_title": "Simulation of Hydrate Plug Prevention in Natural Gas Pipeline from Bohai Bay to Onshore Facilities in China",
                    "abstract": "Natural gas hydrates occasionally plug the 58 km subsea pipeline that transports natural gas from Platform QK18-1 in southwest of Bohai Bay to the processing facility onshore in Northeast China. This is because it is a wet gas subsea pipeline that operates at high pressures and low temperatures, which are the conditions that are appropriate for hydrate formation to occur. In this study, we proposed that the best way to prevent the occasional plugging of the pipeline is to rightly evaluate the upper limit of water that can be permitted in the bulk gas and dehydrate the gas accordingly before transport. Current industrial techniques are mainly based on water dewpoint evaluations. In our recent work we have proposed another approach that considers the impact of the rust (Hematite) on the internal walls of pipelines. These two methods have been used for this study. The results of the method of adsorption of water onto rusty (Hematite) surfaces suggest that the current approach (dewpoint method) overestimates the safe-limit of water about 18 to 19 times higher. Thus, the risk of hydrate formation may still exist if the dewpoint method is used as basis for drying the gas. Sensitivity analysis shows the influence of pressure on the upper limit of waterthe higher the pressure the lower the maximum concentration of water that is safe to accompany the gas. Our calculations were done using a FORTRAN code that utilize thermodynamic data from molecular dynamics simulation. Introduction Hydrate discovery is dated back to 1810 and credited to Sir Humphrey Davy [1-3]. But natural gas hydrate (NGH) formation in pipeline transporting natural gas became a major research focus in the 1930’s through the work of Hammerschmidt [4]. NGH are non-stoichiometric crystalline inclusion compounds formed when hydrogen-bonded water molecules form three-dimensional solid cage-like structures with cavities which entrap suitably small sized molecules of certain gases and volatile liquids known as guest molecules. Methane, ethane, propane, isobutane, carbon dioxide (CO2) and hydrogen sulphide (H2S) [5, 6] are guest molecules that can form hydrate in their pure form. Hydrates are ice-like solid substances that form at high pressures and low temperatures conditions when free water (liquid) is available in a gas containing guest molecules. Hydrate formation is a crucial flow assurance challenge to the oil and gas industry since water is always produced together with hydrocarbons. This water can drop out of the bulk gas. With the appropriate thermodynamic conditions of high pressure and low temperature [6-8], and favourable mass and heat transport, this could lead to hydrate formation. Subsequently, accumulation and agglomeration of the formed hydrate can occur and eventually lead to plugging [4] of pipelines. This results in stopping of operations which means economic losses [9]. Sometimes there could be destruction [9, 10] of pipelines and equipment, and even loss of live [5]. There are many pipeline networks all over the world transporting hydrocarbons [11]. In this work we have focused on the 58 km subsea pipeline [12] from Platform QK18-1 in southwest of Bohai Bay (part of the Bohai Gulf), transporting natural gas to the processing facility SNE 31(3), 2021, 151-157, DOI: 10.11128/sne.31.tn.10576 Received: March 10, 2021 (Selected EUROSIM 2019 Postconf. Publ.); Revised: Sept. 1, 2021; Accepted: September 3, 2021 SNE Simulation Notes Europe, ARGESIM Publisher Vienna ISSN Print 2305-9974, Online 2306-0271, www.sne-journal.org Aromada & Kvamme Simulation of Hydrate Plug Prevention in Natural Gas Pipeline 152 SNE 31(3) – 9/2021 T N onshore in Northeast China. It is a wet gas subsea pipeline and it is exposed to elevated pressure and low temperature [12]. Plugging of the pipeline by hydrate occurs once in a while [12]. Li et al. [12] performed an experimental study on the pipeline and suggested the following solutions: pressure reduction or raising the temperature (heating the pipeline), dehydration of gas before subsea pipeline transport, and thirdly, addition of chemical additives such as kinetic hydrate inhibitors (KHI), to ensure safe operations. In this work, our focus is on the second recommendation. This is also in accordance with what Li et al. [12] proposed as the best choice out of their three recommendations. However, their work did not go into details of how to estimate the upper limit of water content in the gas for prevention of hydrate formation in the subsea pipeline. In a recent work [13], we hproposed an alternative approach for evaluating the upper limit of water in natural gas during pipeline transport to avoid the risk of hydrate formation. The study focused on hydrocarbon components of methane, ethane, propane and isobutane which are the primary hydrocarbon hydrate guest molecules. Therefore, there is a need to carry out this study with a real and specific gas field data. This also involves some content of inorganic gases like CO2 which is a very strong hydrate former. Nitrogen cannot form hydrate in its pure form [14] but can still enter hydrate which is mainly stabilized by other components. In the other end of the guest molecule size scale is normal butane [15-17], which does not make hydrate as pure component, but gauche conformation can fit into large cavity of structure I when methane fills small cavities. Both trans and gauche conformations fit large cavities of structure II although the trans configuration gives low stabilization and will only form hydrate with methane or other good hydrate former in small cavities. 1 Thermodynamics of Hydrate: Description and Validation of Model We used residual thermodynamics with Soave–Redlich– Kwong (SRK) equation of state [18] for all components in each phase (hydrate, ice and liquid water). We did that by making use of molecular dynamics (MD) simulations results for water in empty hydrates, liquid water, and ice phases [19]. We used equation (1) to estimate the chemical potential of component j in the gas phase. To ensure the same reference value for free energy of all the estimates of chemical potentials, regardless of the phase, ideal gas is used as the reference state: , , = , , + , , (1) lim ( ) 1.0 ...for ideal gas Where is the fugacity coefficient for component j in the given phase, R is universal gas constant, is the mole fraction vector of the gas, P and T are pressure and temperature respectively. The chemical potential of component j in water is estimated as: , , = , , + , , (2) lim( ) 1.0 when xj 1.0 Where stands for the activity coefficient of component j in the liquid phase and is the mole fraction vector of the liquid. It is also proper to use a reference state of infinite dilution since the solubility of methane and higher hydrocarbons in water is low: , , ) = , , , ) + . , , , ) (3) lim( , ) when xj 0 Where , represents the chemical potential of component j in water, denotes infinite dilution, , stands for activity coefficient of component j in aqueous phase based on the same reference state. The solubility of methane and higher hydrocarbons are each very low. Thus, equation (4) could be applied together with equation (3): ( , , ) , ( , , ) + . , ( , , ) (4) Superscript i stands for different phases with low solubility, while subscript j represents different components. We evaluated the chemical potential of water in hydrate using the statistical mechanical model for water in hydrate (equation 5). This is a typical Langmuir type of adsorption model. The version we used is different from that of van der Waal and Platteuw [20] which assumes rigid lattice. Aromada & Kvamme Simulation of Hydrate Plug Prevention in Natural Gas Pipeline SNE 31(3) – 9/2021 153 T N It is the one proposed by Kvamme and Tanaka [19]. This one takes into account the movements of the lattice and the corresponding impacts of different guest molecules. That is, the collisions between guest molecules and water which are adequately strong enough to affect the water motion. ( ) = ( , ) . . . 1 + (5) Where stands for hydrate phase, ( ) refers to the chemical potential of water in hydrate, ( , ) signifies the chemical potential of water in empty hydrate structure, and is the fraction of cavity type i per water molecule. The in equation (11) is the canonical cavity partition function of component j in cavity type i, and is the number of guest molecules in the system. We evaluated the canonical partition function using the relation: = (12) Where is inverse of gas constant times temperature ( . ), and is the effects of inclusion of the guest molecules j in the cavity i on hydrate water. The free energy change related to hydrate phase transition ( gH) is evaluated using equation (14): = (14) Where H refers to hydrate phase of molecule j, P here is parent phase of molecule j. And equation (15) gives the relation between the filling fraction, the mole fractions and cavity partition function as shown below: = ( ) = (15) Where signifies total mole fractions of all hydrate formers in the hydrate, refers to the filling fraction of component j in cavity type i, and stands for mole fraction of component j in cavity type i. 2 Composition of the Natural Gas from Bohai Bay The composition of the wet natural gas from the southwestern Bohai Bay and the dry gas (City gas) used by Reference [12] are given in the Table 1. All other hydrocarbon components after iC4, that is nC4 and C5+ and CO are not considered in this study as they are not relevant. Therefore, the molar compositions are normalised. Components Composition [Mole fractions] Wet gas from subsea pipeline Dry gas",
                    "citation": "S. Aromada, B. Kvamme (2019). Simulation of Hydrate Plug Prevention in Natural Gas Pipeline from Bohai Bay to Onshore Facilities in China. Simul. Notes Eur., 31, 151-157. DOI: 10.11128/sne.31.tn.10576",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results of the method of adsorption of water onto rusty (Hematite) surfaces suggest that the current approach (dewpoint method) overestimates the safe-limit of water about 18 to 19 times higher, which may still exist if the dewpoint method is used as basis for drying the gas."
                    }
                },
                {
                    "paper_title": "INCORPORATING METAPOPULATION DYNAMICS OF GREATER GLIDERS INTO RESERVE DESIGN IN DISTURBED LANDSCAPES",
                    "abstract": null,
                    "citation": "MICHAELA. Mccartf (2007). INCORPORATING METAPOPULATION DYNAMICS OF GREATER GLIDERS INTO RESERVE DESIGN IN DISTURBED LANDSCAPES. . DOI: Unknown",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Carcinogenicity Prediction of Aromatic Compounds Using Self-organising Data Mining",
                    "abstract": null,
                    "citation": "F. Lemke, Johann-Adolf Mueller (2002). Carcinogenicity Prediction of Aromatic Compounds Using Self-organising Data Mining. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A self-organising data mining approach for describing and predicting carcinogenicity of aromatic compounds from molecular descriptors and an automated procedure introduced that may help evaluating the usefulness of a created model is application of an algorithms’ noise sensitivity characteristic."
                    }
                }
            ],
            "summary": "The focused topic is the \"final size relation for the SIR model validation by simulation and network effects.\" Among the papers provided, the most relevant material comes from:\n\n1. **Barnard et al. (2018): \"Edge-Based Compartmental Modelling of an SIR Epidemic on a Dual-Layer Static–Dynamic Multiplex Network with Tunable Clustering\"**  \n   - This paper advances an edge-based compartmental model (EBCM) for SIR epidemic spreading on a multiplex network, composed of a static layer with tunable clustering and a dynamic layer with transient connections modeled by edge rewiring.  \n   - Key contributions include:  \n     - Derivation of model equations capturing susceptible-infected-recovered (SIR) epidemic dynamics including realistic heterogeneous contact patterns.  \n     - Analytical derivation of the basic reproduction number \\(R_0\\), accounting for multiplex network structure and temporal dynamics of contacts.  \n     - Validation of model equations through convergence to existing EBCM results in limiting cases and stochastic simulation comparison.  \n     - Numerical exploration of how network parameters (e.g., clustering, rewiring rates) affect epidemic dynamics and final epidemic sizes.  \n     - Presentation of final size relations plotted against \\(R_0\\), confirming theoretical predictions align well with stochastic simulation outcomes.  \n   - The study highlights that network structure—especially clustering in the static layer—and dynamic rewiring in the transient layer significantly influence epidemic spread, modifying both the basic reproduction number and final epidemic size.  \n   - This work therefore provides a robust validation of final epidemic size relations derived from edge-based models through stochastic simulation on multiplex networks.  \n   - Limitations and potential extensions are acknowledged, e.g., treatment of more complex network dynamics, non-Markovian disease stages.\n\n2. **Alota et al. (2020): \"An Edge-Based Model of SEIR Epidemics on Static Random Networks\"**  \n   - While the abstract is unavailable, based on the title and journal (Bulletin of Mathematical Biology), this work likely builds on classical EBCM to incorporate SEIR dynamics on static random graphs.  \n   - This possibly includes derivations of epidemic thresholds and final size relations, extending earlier EBCM work to models with exposed compartments.  \n   - The focus on static random networks contrasts with Barnard et al.'s dual-layer multiplex but likely shares methods for validating final size relations through simulation.\n\nOther papers provided are unrelated to epidemic modeling or SIR final size relations and thus excluded from the synthesis.\n\n---\n\n### Scientific Summary on Final Size Relations and Network Effects in SIR Models:\n\n**Final Size Relations in SIR Models:**\n\nIn classical compartmental SIR modeling assuming homogeneous mixing, the final epidemic size (total fraction infected by epidemic end) is linked to the basic reproduction number \\( R_0 \\) via the transcendental equation (e.g., \\( 1 - S_\\infty = 1 - e^{-R_0 (1-S_\\infty)} \\), where \\(S_\\infty\\) is the susceptible fraction at epidemic end). However, real populations exhibit heterogeneous contact patterns, temporal contact dynamics, and community clustering that alter epidemic thresholds and final sizes.\n\n**Network Effects:**\n\nBarnard et al. (2018) extend final size relations to SIR epidemics on multiplex networks with two distinct edge types:\n\n- **Static Layer:** Represents permanent, community-based connections that can be tuned for clustering (triangle closures). Higher clustering tends to slow initial epidemic spread due to redundancy in contacts but may lead to more localized outbreaks.\n\n- **Dynamic Layer:** Represents transient, fleeting contacts modeled via constant edge rewiring, mimicking dynamic mixing in the broader population.\n\nTheir edge-based compartmental model captures the epidemic state evolution on such complex network structures. They analytically derive the basic reproduction number \\(R_0\\), including contributions from each layer, and show how \\(R_0\\) depends strongly on network parameters (clustering coefficients, rewiring rates).\n\n**Validation:**\n\n- They validate their model via stochastic simulations on networks with defined static and dynamic components, showing convergence of predicted epidemic final size from the model equations to simulation results.\n\n- Plots of final epidemic sizes against \\(R_0\\) for multiple parameter regimes exhibit good agreement between theory and simulation, establishing that final size relations derived from EBCM remain accurate even in complex multiplex networks.\n\n- Comparisons with limiting cases reproduce established edge-based model results, enhancing confidence in the approach.\n\n**Implications:**\n\n- The structure and dynamics of contacts in a population critically influence epidemic outcomes, affecting both \\(R_0\\) and epidemic final size.\n\n- Including clustered static contacts introduces heterogeneity that modifies final size relations from classical mass-action models.\n\n- Dynamic contacts modeled via edge rewiring inject additional mixing, often increasing \\(R_0\\) and potentially epidemic spread.\n\n**Complementary Work:**\n\n- Alota et al. (2020) likely extend EBCM final size relations to SEIR dynamics on static random networks, reinforcing the method's flexibility and validity through simulations.\n\n---\n\n### Conclusion:\n\nThe SIR final size relations derived via edge-based compartmental modeling are valid and accurately describe epidemic dynamics on complex contact networks when validated by stochastic simulations incorporating realistic network effects such as:\n\n- multiplex static and dynamic layers,\n\n- tunable clustering,\n\n- temporal contact rewiring.\n\nThis demonstrates that traditional final size relations require extension to account for network heterogeneity but remain fundamentally interpretable and quantifiable via EBCM frameworks.\n\n---\n\n### References:\n\n- Barnard, R., Kiss, I., Berthouze, L., (2018). Edge-Based Compartmental Modelling of an SIR Epidemic on a Dual-Layer Static–Dynamic Multiplex Network with Tunable Clustering. *Bulletin of Mathematical Biology*, 80, 2698–2733. https://doi.org/10.1007/s11538-018-0484-5\n\n- Alota, C. P., Pilar-Arceo, C. P., de los Reyes, V. A. (2020). An Edge-Based Model of SEIR Epidemics on Static Random Networks. *Bulletin of Mathematical Biology*, 82. https://doi.org/10.1007/s11538-020-00769-0\n\n---\n\nIf further detailed equations or specific numerical results are requested, please provide more text or data from the papers. Otherwise, I hope this concise review clarifies the state of the art in final size relation validation in SIR epidemic models incorporating network effects."
        }
    ]
}