{
  "problems": {
    "scenarios": [
      "A measles outbreak has been reported in Gaines County, Texas, with a total of 1,000 confirmed cases. The outbreak is rapidly spreading through the community, primarily affecting unvaccinated individuals. Public health authorities are seeking effective mitigation strategies to control the spread and minimize severe outcomes.\nTask:\nThe goal of this study is mitigation—to develop and evaluate intervention strategies to reduce transmission and hospitalizations.\nGoal:\nThe target is to have peak of infected cases less 5 percent within a 360-day simulation period.\nDisease Information:\n- Disease Name: Measles\n- Compartment Model: we do not know\nInitial Conditions:\n- Total population: we do not know\n- Initially infected: 1,000\n- Transmission Rate : We do not know, search for it\n- Incubation Period: 10-14 days\n- Infectious Period: 7-10 days\nBasic Reproduction Number (R_0):\n- we are not sure\nNetwork and Data Availability:\n- contact Network Structure:  it should be extracted by the agent, contact network of the population is not available\n- Data Path: we do not have any data available",
      "Scenario 2 description",
      "Scenario 3 description",
      "Consider a small static network of 100 nodes representing individuals in a population, connected in a complete graph (every node is connected to every other node). Assume an SIR model where each infected individual has a transmission probability 𝛽= 0.1 β=0.1 per contact per time step and a recovery rate 𝛾=0.2γ=0.2 per time step. Starting with one randomly chosen infected node, compute the expected number of infected individuals after 5 time steps using a deterministic approximation (mean-field model) and simulate the epidemic on the network to compare the results.",
      "On a Watts–Strogatz small‑world network (N=1 000, ⟨k⟩=6, rewiring p=0.1), implement an SI1I2S model with two strains: strain 1 (β₁=0.15, γ₁=0.05) and strain 2 (β₂=0.25, γ₂=0.1). Scenario A: prioritize vaccinating 20% of highest‑degree nodes against strain 1 only. Scenario B: randomly vaccinate 20% of nodes with a two‑dose vaccine effective against both strains. Compare final sizes of each strain and overall epidemic outcomes under both scenarios."
    ],
    "question": [
      "What is the effect of incorporating  degree‐heterogeneous networks structure in an SEIR model on disease dynamics, compared to a homogeneous‐mixing network? Analyze it using both deterministic analytical methods and stochastic simulations",
      "What is the reason for The chain of transmission to break:1-the decline in infectives, or2- a complete lack of susceptibles? address this question in both scenarios in analytcal and simulation approaches.",
      "In an activity-driven temporal network with 1000 nodes, where each node activates with a rate of alpha=0.1 and forms m=2 transient connections upon activation, how does the temporal structure of the network influence the spread of an infectious disease modeled using the SIR model with a basic reproduction number R0 = 3, compared to its corresponding time-aggregated static network in which edge weights represent the frequency of interactions over time?",
      "Competitive SIS model over two multiplex layer A and B same set of nodes. the two viruses are exclusive: A node cannot be infected by virus 1 and virus 2 simultaneously. Beta 1 and delta 1 for layer 1 and beta2 and delta 2 for layer 2 Assume the effective infection rates of each virus are larger than their no-spreading mean field threshold, i.e., 𝜏1>1/𝜆1(𝐴) and 𝜏2>1/𝜆1(𝐵).Question1-:  Will both viruses survive (coexistence), or will one virus completely remove the other (absolute dominance)?2-which characteristics of a multilayer network structure allow for coexistence?",
      "An epidemic has a reproductive number of R0 = 4, i.e. the mean excess degree of the effective network across which it is spreading is q = 4. Let's say the mean degree of this network is z = 3 and there are no degree correlations. You want to stop the epidemic by vaccinating people, using a vaccine that gives sterilizing immunity, so that a vaccinated person cannot transmit the disease. What proportion of the nodes do you need to vaccinate if you vaccinate random people? Also what proportion of nodes would you need to vaccinate if you are just vaccinating people who have a degree of exactly k = 10.address this question in both scenarios in analytcal and simulation approaches."
    ],
    "s-questions": [
      "A meme has a reproductive number of R0 = 4, i.e. the mean excess degree of the effective network across which it is spreading is q = 4. Let's say the mean degree of this network is z = 3 and there are no degree correlations. You want to stop the meme by vaccinating people, using a vaccine that gives sterilizing immunity, so that a vaccinated person cannot transmit the meme. What proportion of the nodes do you need to vaccinate if you vaccinate random people? Also what proportion of nodes would you need to vaccinate if you are just vaccinating people who have a degree of exactly k = 10.address this question in both scenarios in analytcal and simulation approaches.",
      "Competitive SIS model over two multiplex layer A and B same set of nodes. the two memes are exclusive: A node cannot adopt meme 1 and meme 2 simultaneously. Beta 1 and delta 1 for layer 1 and beta2 and delta 2 for layer 2 Assume the effective adoption rates of each meme are larger than their no-sharing mean field threshold, i.e., 𝜏1>1/𝜆1(𝐴) and 𝜏2>1/𝜆1(𝐵).Question1-:  Will both memes survive (coexistence), or will one meme completely remove the other (absolute dominance)?2-which characteristics of a multilayer network structure allow for coexistence?"
    ],
    "temporal": [
      "In an activity-driven temporal network with 1000 nodes, where each node activates with a probability of alpha=0.1 per discrete time unit and forms m=2 transient connections upon activation in time horizon of 1000 steps, how does the temporal structure of the network influence the spread of a meme modeled using the SIR model with a basic reproduction number R0 = 3, compared to its corresponding time-aggregated static network in which edge weights represent the relative frequency  of interactions over time?",
      "In an activity-driven temporal network with 1000 nodes, where each node activates with a probability of alpha=0.1 per discrete time unit and forms m=2 transient connections upon activation in time horizon of 1000 steps, how does the temporal structure of the network influence the spread of a meme modeled using the SIR model with a basic reproduction number of meme being R0 = 3, compared to its corresponding time-aggregated static network in which edge weights represent the empirical probability of interactions over time?"
    ]
  }
}