{
    "results": [
        {
            "query": "systemic risk threshold cascade financial networks core-periphery",
            "papers": [
                {
                    "title": "The influence of bank-firm loan network structure on systemic risk: from the perspective of complex networks",
                    "abstract": "The structure of the bank-firm loan network is crucial for understanding the transmission of systemic risk within the banking system. Drawing on complex network theory, this study analyzes loan data from 370 Chinese commercial banks spanning January 2013 to December 2023 to construct a syndicated loan network, wherein different banks lend to the same enterprise. This analysis reveals how the structure of this network influences systemic risk in the banking sector across various periods. Our findings indicate that, in the long term, network density and centralization significantly mitigate systemic risk, whereas transitivity and average clustering coefficients have a positive effect on systemic risk. In the short term, the network demonstrates strong mean-reverting properties. Additionally, we observe a noteworthy phenomenon: the bank-firm loan relationships exhibit a ‘core-periphery’ hierarchical structure, characterized by a network that is both robust and fragile. These insights offer a novel perspective on the relationship between bank network structures and systemic risk, contributing to the interdisciplinary application of physics in economic and financial studies.",
                    "citation": "Zhengyong Li, Deyin Fu, Haiting Li (2025). The influence of bank-firm loan network structure on systemic risk: from the perspective of complex networks. Frontiers of Physics. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/48bb2247686d11a23747828518bff81a379760ef"
                },
                {
                    "title": "Intelligent Risk Management and Decision-Making in Complex Offshore Engineering Projects",
                    "abstract": "The offshore engineering industry stands at the confluence of extreme environmental conditions, intricate supply chains, and high capital intensity. Such projects—spanning from subsea infrastructure development to deep-water production systems—are inherently exposed to multifaceted uncertainties across technical, financial, environmental, and human domains. Traditional risk management frameworks, though methodologically sound, have proven insufficient in coping with the dynamic, data-rich, and uncertainty-dominated nature of modern offshore projects. The central research problem addressed in this study is the persistent limitation of deterministic and semi-quantitative risk management approaches in managing complex, uncertain, and interdependent risks throughout the offshore project lifecycle. This paper proposes an integrated decision-support model that leverages intelligent risk analysis, probabilistic simulation, and organizational learning principles to enhance decision-making under uncertainty in offshore project planning and execution. The primary objective of this research is to develop and validate a hybrid intelligent risk management model—referred to herein as the Intelligent Offshore Decision-Support Model (IODSM)—that integrates artificial intelligence (AI)-assisted analytics, probabilistic risk quantification (using Monte Carlo simulation), and qualitative reasoning (through fuzzy logic) within a unified decision-support framework. The model is designed to operate across the Front-End Engineering Design (FEED) and Engineering, Procurement, Construction, Installation, and Commissioning (EPCIC) phases, enabling continuous risk learning and adaptive decision optimization. The novelty of the IODSM lies in its multi-layered integration: combining data-driven insights from historical and real-time project data with probabilistic forecasting and human-centered learning systems to achieve both predictive precision and organizational adaptability. The methodology adopted in this study synthesizes three core components. The first component is data-driven risk identification and mitigation, enabled through advanced analytics and AI techniques. This includes the use of supervised learning algorithms for pattern recognition in failure and performance datasets, unsupervised clustering for anomaly detection in cost and schedule deviations, and Bayesian belief networks for dynamic probabilistic inference under uncertainty. These techniques transform disparate project data—ranging from engineering design parameters to procurement logistics—into actionable risk intelligence. The second component is advanced risk prioritization, integrating Monte Carlo simulation and fuzzy logic. Monte Carlo simulation provides quantitative insights into cost and schedule variability by propagating probabilistic input distributions through project models, generating a risk-informed range of possible outcomes. Fuzzy logic complements this by incorporating qualitative or incomplete risk information (e.g., expert judgment, environmental unpredictability, and human reliability factors) into a structured reasoning framework that supports more nuanced risk prioritization. The third component introduces Learning Organization principles, embedding continuous learning, feedback loops, and psychological safety within the risk management process. Through structured post-event reviews, digital knowledge repositories, and AI-assisted learning analytics, the organization evolves into a learning ecosystem capable of adaptive decision-making. This triadic integration—AI-driven analytics, probabilistic simulation, and learning-oriented culture—forms the methodological foundation of the proposed decision-support model. A simulated application of the IODSM was conducted using representative offshore project data, encompassing FEED cost estimation uncertainties, EPCIC schedule deviations, and marine installation risk profiles. The results demonstrate substantial improvements in predictive accuracy, decision robustness, and organizational learning outcomes. From a quantitative perspective, the integration of Monte Carlo simulation reduced cost estimation uncertainty ranges by approximately 25% compared to traditional deterministic models. The inclusion of fuzzy logic in qualitative risk scoring improved prioritization accuracy by 18%, as measured against post-project validation data. AI-assisted anomaly detection identified latent correlations between procurement delays and weather-related offshore installation risks that were previously overlooked in conventional risk registers. These findings underscore the value of intelligent risk analytics in enhancing the comprehensiveness and responsiveness of offshore risk management. From an organizational perspective, embedding the Learner Mindset into the IODSM yielded qualitative benefits in project culture and long-term resilience. The model’s learning feedback loops facilitated iterative improvement across successive projects, transforming historical “lessons learned” into predictive knowledge assets. Psychological safety—defined as the freedom to voice concerns or share errors without fear of reprisal—proved critical to fostering a data-sharing culture that feeds the AI analytics engine. Moreover, the structured reflection processes enabled by the model promoted a shift from reactive risk mitigation to proactive risk anticipation. In this sense, the IODSM not only enhances decision quality but also cultivates a sustainable organizational learning capability—a critical differentiator in an industry where the cost of error is measured in both capital and environmental terms. A key contribution of this research lies in the systemic integration of technology and human factors within a coherent risk management architecture. The IODSM transcends the conventional divide between quantitative risk modeling and qualitative human judgment by embedding both into a continuous learning cycle. Data from project execution phases feed back into the AI models, refining probabilistic parameters and fuzzy inference systems. Simultaneously, human feedback from project teams updates contextual understanding and calibrates the model’s learning algorithms. This dual-loop feedback mechanism—one digital and one cognitive—ensures that the system remains both technically accurate and contextually relevant. Such integration aligns with modern systems engineering principles and the emerging paradigm of intelligent infrastructure management. The implications of the research are multifaceted. At the strategic level, the adoption of the IODSM enables offshore project stakeholders—operators, contractors, and regulators—to make risk-informed decisions with greater confidence and transparency. The model supports scenario-based planning, enabling decision-makers to test the resilience of project strategies under varying uncertainty conditions (e.g., market volatility, supply chain disruptions, or environmental hazards). At the operational level, the model enhances the efficiency of project planning and control by dynamically updating risk profiles as new data emerge. This adaptive capability reduces the lag between risk detection and mitigation, thereby minimizing the likelihood of cascading project failures. At the organizational level, the IODSM provides a structural mechanism for institutional learning, allowing knowledge gained from one project to inform future endeavors. This represents a critical shift from static risk registers to dynamic, self-evolving knowledge systems. The research further highlights several practical enablers for implementation. These include the establishment of integrated data platforms capable of consolidating design, procurement, and construction data; the deployment of AI-driven risk dashboards for real-time visualization of uncertainty propagation; and the incorporation of learning analytics modules to measure the effectiveness of risk interventions over time. The study also emphasizes the importance of leadership commitment and governance structures in embedding learning organization principles. Without psychological safety, transparent communication, and an open feedback culture, the technological sophistication of the IODSM cannot yield its full benefits. Thus, successful implementation requires alignment across technology, process, and culture. In conclusion, this study advances the field of offshore project management by presenting a comprehensive, intelligent, and adaptive framework for risk-informed decision-making under uncertainty. The proposed IODSM embodies a paradigm shift from deterministic, reactive risk management to probabilistic, proactive, and learning-oriented governance. By coupling AI-assisted analytics with probabilistic modeling and embedding these within a culture of continuous learning, offshore organizations can achieve greater resilience, efficiency, and innovation. The findings suggest that intelligent risk management, when supported by a learner mindset, can transform uncertainty from a source of vulnerability into a strategic asset for organizational growth and sustainability. This integration marks a critical evolution in offshore engineering—where the convergence of data intelligence, probabilistic reasoning, and human learning forms the foundation for safer, more adaptive, and future-ready project ecosystems",
                    "citation": "James Aigboduwa (2025). Intelligent Risk Management and Decision-Making in Complex Offshore Engineering Projects. International journal of petroleum and gas engineering research. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/a7f3f4a68c233b90e7b626a446e5cf49e1ab0f51"
                },
                {
                    "title": "Plutocracy in the Protocol: A Quantitative Triangulation of Power Concentration in Decentralized Finance Governance",
                    "abstract": "Decentralized Finance (DeFi) proposes a paradigm shift towards a democratized financial ecosystem governed by its users. This vision of decentralization is predicated on the distribution of governance tokens. However, the verity of this claim lacks rigorous empirical validation, raising concerns about a potential \"decentralization illusion.\" This study quantitatively investigates the concentration of governance power within leading DeFi protocols to empirically test this narrative. We employed a multi-faceted quantitative triangulation framework using on-chain data from three archetypal DeFi protocols, selected to represent the core sectors of the ecosystem: a lending market (ProtoLend), a decentralized exchange (ProtoSwap), and a yield aggregator (ProtoYield). Our methodology integrates: (1) Empirical Network Analysis based on on-chain voting power delegation to map the topology of influence; (2) Economic Inequality Metrics, including the Gini Coefficient and Lorenz Curve Analysis, to quantify the distribution of governance tokens; and (3) Systemic Risk Assessment via the Nakamoto Coefficient to determine the minimum number of colluding actors required for a 51% governance attack. The empirical network analysis revealed a distinct core-periphery topology across all protocols, indicative of highly centralized influence structures. This was substantiated by extreme economic inequality, with Gini coefficients of 0.91 for ProtoLend, 0.95 for ProtoSwap, and 0.89 for ProtoYield. Lorenz curves visually confirmed that a minuscule fraction of holders controls the vast majority of voting power. The Nakamoto coefficients were critically low, calculated at 8 for ProtoLend, 5 for ProtoSwap, and 11 for ProtoYield, exposing profound vulnerabilities to collusion and capture. In conclusion, our findings provide robust, triangulated evidence of a pervasive \"decentralization illusion\" within DeFi. Governance power is not distributed but is instead highly concentrated, replicating the plutocratic power dynamics of traditional finance. This concentration poses significant systemic risks and fundamentally challenges the core value proposition of the DeFi ecosystem.",
                    "citation": "Arya Ganendra¹, Neva Dian Permana², Muhammad Faiz³, et al. (2025). Plutocracy in the Protocol: A Quantitative Triangulation of Power Concentration in Decentralized Finance Governance. Enigma in Economics. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/9dedf8d736bef6054c9fcd7cb2f64e6e6232de5c"
                },
                {
                    "title": "Systemic risk in Chinese interbank lending networks: insights from short-term and long-term lending data",
                    "abstract": null,
                    "citation": "Shuyue Jin, Lei Song, Lei Shu, et al. (2024). Systemic risk in Chinese interbank lending networks: insights from short-term and long-term lending data. Empirical Economics. Citations: 6, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/e6411e8e385909808ac9669b72a589fbb2e099ea"
                },
                {
                    "title": "Counterparty risk and contagion in financial networks",
                    "abstract": "ABSTRACT Based on the concept of multi-orbit contagion, we develop a network-based probabilistic model to illustrate the risk contagion among institutions and the stability of financial networks. Our examination focuses on two key aspects: the size of component, which the network divided into different components, and the number of institutional partners. Our study finds a non-monotonic relationship between the systemic risk and the connection density, and there needs a trade-off between the number of partners and the risk contagion to reduce systemic risk. Furthermore, our analysis of core-periphery structures provides an understanding of why the”too big to fail” phenomenon occurs. Our research contributes to systemic risk analysis and has significant theoretical implications for regulators.",
                    "citation": "Xiaoyu Zhang, Qi Hu (2024). Counterparty risk and contagion in financial networks. Applied Economics Letters. Citations: 2, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/b27d66fa51b234265740b364e52c0797f7cc0402"
                },
                {
                    "title": "A Conceptual Framework for Financial Network Resilience Integrating Cybersecurity, Risk Management, and Digital Infrastructure Stability",
                    "abstract": "The increasing digitalization of financial systems has amplified both opportunities for innovation and risks of systemic disruption. Global financial networks now rely heavily on interconnected digital infrastructures that support real-time transactions, algorithmic trading, blockchain-based settlements, and cross-border data flows. While these advancements have enhanced efficiency and expanded financial inclusion, they have simultaneously introduced unprecedented vulnerabilities, particularly in the realms of cybersecurity, risk management, and operational continuity. Cyberattacks, ranging from ransomware to advanced persistent threats, increasingly target financial institutions and critical service providers, posing systemic risks to market stability. At the same time, operational failures in digital infrastructures—such as cloud service outages, distributed denial-of-service (DDoS) attacks, or software supply chain compromises—can trigger cascading effects across global markets. This develops a conceptual framework for financial network resilience that integrates three interdependent pillars: cybersecurity, risk management, and digital infrastructure stability. Cybersecurity forms the defensive shield, ensuring robust protection, detection, and incident response against evolving threat vectors. Risk management provides a strategic layer, incorporating scenario planning, stress testing, and regulatory compliance to mitigate financial and operational vulnerabilities. Digital infrastructure stability, underpinned by redundancy, secure interoperability, and adaptive recovery mechanisms, ensures continuity of core financial services in the face of disruptions. The framework emphasizes governance, cross-sector collaboration, and adherence to global standards (e.g., Basel Committee, FSB, ISO/IEC) to foster trust and accountability across stakeholders. By conceptualizing resilience as a dynamic, adaptive capability rather than a static safeguard, this framework highlights the need for financial systems to not only withstand shocks but also learn and evolve from them. Ultimately, integrating cybersecurity, risk management, and infrastructure stability establishes a holistic pathway toward secure, trusted, and future-proof financial networks capable of supporting sustainable digital economies.",
                    "citation": "Nnennaya Halliday (2023). A Conceptual Framework for Financial Network Resilience Integrating Cybersecurity, Risk Management, and Digital Infrastructure Stability. International Journal of Advanced Multidisciplinary Research and Studies. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This framework develops a conceptual framework for financial network resilience that integrates three interdependent pillars: cybersecurity, risk management, and digital infrastructure stability, establishing a holistic pathway toward secure, trusted, and future-proof financial networks capable of supporting sustainable digital economies."
                    },
                    "url": "https://www.semanticscholar.org/paper/4399fd9125bab4991ab0c5f8563c09595f5f0052"
                },
                {
                    "title": "Evolution of Complex Network Topology for Chinese Listed Companies Under the COVID-19 Pandemic",
                    "abstract": null,
                    "citation": "Kaihao Liang, Shuliang Li, Wenfeng Zhang, et al. (2023). Evolution of Complex Network Topology for Chinese Listed Companies Under the COVID-19 Pandemic. Computational Economics. Citations: 1, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/ddddaf1bb41672f72834f6895bcd9f0fb8ea9139"
                }
            ],
            "summary": ""
        }
    ]
}