{
    "results": [
        {
            "query": "temporal activity-driven networks epidemic threshold final size SIR",
            "papers": [
                {
                    "paper_title": "Active and inactive quarantine in epidemic spreading on adaptive activity-driven networks",
                    "abstract": "We consider an epidemic process on adaptive activity-driven temporal networks, with adaptive behavior modeled as a change in activity and attractiveness due to infection. By using a mean-field approach, we derive an analytical estimate of the epidemic threshold for susceptible-infected-susceptible (SIS) and susceptible-infected-recovered (SIR) epidemic models for a general adaptive strategy, which strongly depends on the correlations between activity and attractiveness in the susceptible and infected states. We focus on strong social distancing, implementing two types of quarantine inspired by recent real case studies: an active quarantine, in which the population compensates the loss of links rewiring the ineffective connections towards nonquarantining nodes, and an inactive quarantine, in which the links with quarantined nodes are not rewired. Both strategies feature the same epidemic threshold but they strongly differ in the dynamics of the active phase. We show that the active quarantine is extremely less effective in reducing the impact of the epidemic in the active phase compared to the inactive one and that in the SIR model a late adoption of measures requires inactive quarantine to reach containment.",
                    "citation": "Marco Mancastroppa, R. Burioni, V. Colizza... (2020). Active and inactive quarantine in epidemic spreading on adaptive activity-driven networks. Physical review. E, 102 2-1, \n          020301\n        . DOI: 10.1103/PHYSREVE.102.020301",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown that the active quarantine is extremely less effective in reducing the impact of the epidemic in the active phase compared to the inactive one and that in the SIR model a late adoption of measures requires inactive quarantine to reach containment."
                    }
                },
                {
                    "paper_title": "Impact of environmental factors on the coevolution of information–emotions–epidemic dynamics in activity-driven multiplex networks",
                    "abstract": "During public health emergencies, the diffusion of negative information can exacerbate the transmission of adverse emotions, such as fear and anxiety. These emotions can adversely affect immune function and, consequently, influence the spread of the epidemic. In this study, we established a coupled model incorporating environmental factors to explore the coevolution dynamic process of information–emotions–epidemic dynamics in activity-driven multiplex networks. In this model, environmental factors refer to the external conditions or pressures that affect the spread of information, emotions, and epidemics. These factors include media coverage, public opinion, and the prevalence of diseases in the neighborhood. These layers are dynamically cross-coupled, where the environmental factors in the information layer are influenced by the emotional layer; the higher the levels of anxious states among neighboring individuals, the greater the likelihood of information diffusion. Although environmental factors in the emotional layer are influenced by both the information and epidemic layers, they come from the factors of global information and the proportion of local infections among surrounding neighbors. Subsequently, we utilized the microscopic Markov chain approach to describe the dynamic processes, thereby obtaining the epidemic threshold. Finally, conclusions are drawn through numerical modeling and analysis. The conclusions suggest that when negative information increases, the probability of the transmission of anxious states across the population increases. The transmission of anxious states increases the final size of the disease and decreases its outbreak threshold. Reducing the impact of environmental factors at both the informational and emotional levels is beneficial for controlling the scale of the spread of the epidemic. Our findings can provide a reference for improving public health awareness and behavioral decision-making, mitigating the adverse impacts of anxious states, and ultimately controlling the spread of epidemics.",
                    "citation": "L. Huo 霍, Bingjie 炳杰 Liu 刘, Xiaomin 晓敏 Zhao 赵 (2024). Impact of environmental factors on the coevolution of information–emotions–epidemic dynamics in activity-driven multiplex networks. Chinese Physics B, 33. DOI: 10.1088/1674-1056/ad7df5",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A coupled model incorporating environmental factors to explore the coevolution dynamic process of information–emotions–epidemic dynamics in activity-driven multiplex networks suggests that when negative information increases, the probability of the transmission of anxious states across the population increases."
                    }
                },
                {
                    "paper_title": "A study of epidemic spreading on activity-driven networks",
                    "abstract": "The epidemic spreading was explored on activity-driven networks (ADNs), accounting for the study of dynamics both on and of the ADN. By employing the susceptible-infected-susceptible (SIS) model, two aspects were considered: (1) the infection rate of susceptible agent (depending on the number of its infected neighbors) evolves due to the temporal structure of ADN, rather than being a constant number; (2) the susceptible and infected agents generate unequal links while being activated, namely, the susceptible agent gets few contacts with others in order to protect itself. Results show that, in both cases, the larger epidemic threshold and smaller outbreak size were obtained.",
                    "citation": "Yijiang Zou, Weibing Deng, Wei Li... (2016). A study of epidemic spreading on activity-driven networks. International Journal of Modern Physics C, 27, 1650090. DOI: 10.1142/S012918311650090X",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The epidemic spreading was explored on activity-driven networks (ADNs), accounting for the study of dynamics both on and of the ADN by employing the susceptible-infected-susceptible (SIS) model, showing that the larger epidemic threshold and smaller outbreak size were obtained."
                    }
                },
                {
                    "paper_title": "Contrasting effects of strong ties on SIR and SIS processes in temporal networks",
                    "abstract": "Most real networks are characterized by connectivity patterns that evolve in time following complex, non-Markovian, dynamics. Here we investigate the impact of this ubiquitous feature by studying the Susceptible-Infected-Recovered (SIR) and Susceptible-Infected-Susceptible (SIS) epidemic models on activity driven networks with and without memory (i.e., Markovian and non-Markovian). We find that memory inhibits the spreading process in SIR models by shifting the epidemic threshold to larger values and reducing the final fraction of recovered nodes. On the contrary, in SIS processes memory reduces the epidemic threshold and, for a wide range of disease parameters, increases the fraction of nodes affected by the disease in the endemic state. The heterogeneity in tie strengths, and the frequent repetition of strong ties it entails, allows in fact less virulent SIS-like diseases to survive in tightly connected local clusters that serve as reservoir for the virus. We validate this picture by studying both processes on two real temporal networks.",
                    "citation": "K. Sun, Andrea Baronchelli, N. Perra (2015). Contrasting effects of strong ties on SIR and SIS processes in temporal networks. The European Physical Journal B, 88, 1-8. DOI: 10.1140/EPJB/E2015-60568-4",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that memory inhibits the spreading process in SIR models by shifting the epidemic threshold to larger values and reducing the final fraction of recovered nodes and, for a wide range of disease parameters, increases the fraction of nodes affected by the disease in the endemic state."
                    }
                },
                {
                    "paper_title": "Epidemic spreading and aging in temporal networks with memory",
                    "abstract": "Time-varying network topologies can deeply influence dynamical processes mediated by them. Memory effects in the pattern of interactions among individuals are also known to affect how diffusive and spreading phenomena take place. In this paper we analyze the combined effect of these two ingredients on epidemic dynamics on networks. We study the susceptible-infected-susceptible (SIS) and the susceptible-infected-recovered (SIR) models on the recently introduced activity-driven networks with memory. By means of an activity-based mean-field approach, we derive, in the long-time limit, analytical predictions for the epidemic threshold as a function of the parameters describing the distribution of activities and the strength of the memory effects. Our results show that memory reduces the threshold, which is the same for SIS and SIR dynamics, therefore favoring epidemic spreading. The theoretical approach perfectly agrees with numerical simulations in the long-time asymptotic regime. Strong aging effects are present in the preasymptotic regime and the epidemic threshold is deeply affected by the starting time of the epidemics. We discuss in detail the origin of the model-dependent preasymptotic corrections, whose understanding could potentially allow for epidemic control on correlated temporal networks.",
                    "citation": "Michele Tizzani, Simone Lenti, Enrico Ubaldi... (2018). Epidemic spreading and aging in temporal networks with memory. Physical Review. E, 98. DOI: 10.1103/PhysRevE.98.062315",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper derives analytical predictions for the epidemic threshold as a function of the parameters describing the distribution of activities and the strength of the memory effects and shows that memory reduces the threshold, which is the same for SIS and SIR dynamics, therefore favoring epidemic spreading."
                    }
                },
                {
                    "paper_title": "Contrasting effects of strong ties on SIR and SIS processes in temporal networks",
                    "abstract": "Most real networks are characterized by connectivity patterns that evolve in time following complex, non-Markovian, dynamics. Here we investigate the impact of this ubiquitous feature by studying the Susceptible-Infected-Recovered (SIR) and Susceptible-Infected-Susceptible (SIS) epidemic models on activity driven networks with and without memory (i.e., Markovian and non-Markovian). We find that memory inhibits the spreading process in SIR models by shifting the epidemic threshold to larger values and reducing the final fraction of recovered nodes. On the contrary, in SIS processes memory reduces the epidemic threshold and, for a wide range of disease parameters, increases the fraction of nodes affected by the disease in the endemic state. The heterogeneity in tie strengths, and the frequent repetition of strong ties it entails, allows in fact less virulent SIS-like diseases to survive in tightly connected local clusters that serve as reservoir for the virus. We validate this picture by studying both processes on two real temporal networks.",
                    "citation": "K. Sun, Andrea Baronchelli, N. Perra (2015). Contrasting effects of strong ties on SIR and SIS processes in temporal networks. The European Physical Journal B, 88. DOI: 10.1140/epjb/e2015-60568-4",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that memory inhibits the spreading process in SIR models by shifting the epidemic threshold to larger values and reducing the final fraction of recovered nodes and, for a wide range of disease parameters, increases the fraction of nodes affected by the disease in the endemic state."
                    }
                },
                {
                    "paper_title": "Epidemic spreading of interacting diseases with activity of nodes reshapes the critical threshold",
                    "abstract": "In this paper, based on susceptible–infected–susceptible (SIS) scheme, we introduce a framework that allows us to describe the spreading dynamics of two interacting diseases with active nodes. Different from previous studies, the two different diseases, propagating concurrently on the same population, can interact with each other by modifying their transmission rates. Meanwhile, according to certain probabilities, each node on the complex networks rotates between active state and inactive state. Based on heterogeneous mean-field approach, we analyze the epidemic thresholds of the two diseases and compute the temporal evolution characterizing the spreading dynamics. In addition, we validate these theoretical predictions by numerical simulations with phase diagrams. Results show that the secondary thresholds for the two opposite scenarios (mutual enhancement scenario and mutual impairment scenario) are different. We also find that the value of critical threshold and the final size of spreading dynamics are reduced as the node activity rate decreases.",
                    "citation": "Chongjun Fan, Yang Jin, Liang’an Huo... (2017). Epidemic spreading of interacting diseases with activity of nodes reshapes the critical threshold. International Journal of Modern Physics C, 28, 1750013. DOI: 10.1142/S0129183117500139",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A framework that allows us to describe the spreading dynamics of two interacting diseases with active nodes and finds that the value of critical threshold and the final size of spreading dynamics are reduced as the node activity rate decreases."
                    }
                }
            ],
            "summary": ""
        }
    ]
}