{
    "results": [
        {
            "query": "activity driven temporal networks SIR disease spread modeling network epidemiology",
            "papers": [
                {
                    "title": "Epidemic Dynamics and Intervention Measures in Campus Settings Based on Multilayer Temporal Networks",
                    "abstract": "This study simulates the spread of epidemics on university campuses using a multilayer temporal network model combined with the SEIR (Susceptible–Exposed–Infectious–Recovered) transmission model. The proposed approach explicitly captures the time-varying contact patterns across four distinct layers (Rest, Dining, Activity, and Academic) to reflect realistic student mobility driven by class schedules and spatial constraints. It evaluates the impact of various intervention measures on epidemic spreading, including subnetwork closure and zoned management. Our analysis reveals that the Academic and Activity layers emerge as high-risk transmission hubs due to their dynamic, high-density contact structures. Intervention measures exhibit layer-dependent efficacy: zoned management is highly effective in high-contact subnetworks, its impact on low-contact subnetworks remains limited. Consequently, intervention measures must be dynamically adjusted based on the characteristics of each subnetwork and the epidemic situations, with higher participation rates enhancing the effectiveness of these measures. This work advances methodological innovation in temporal network epidemiology by bridging structural dynamics with SEIR processes, offering actionable insights for campus-level pandemic preparedness. The findings underscore the necessity of layer-aware policies to optimize resource allocation in complex, time-dependent contact systems.",
                    "citation": "Xianyang Zhang, Ming Tang (2025). Epidemic Dynamics and Intervention Measures in Campus Settings Based on Multilayer Temporal Networks. Entropy. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work advances methodological innovation in temporal network epidemiology by bridging structural dynamics with SEIR processes, offering actionable insights for campus-level pandemic preparedness and underscores the necessity of layer-aware policies to optimize resource allocation in complex, time-dependent contact systems."
                    },
                    "url": "https://www.semanticscholar.org/paper/81f7741148efa0ee64e08f7ac00820e5d70d3578"
                },
                {
                    "title": "Unifying Physics- and Data-Driven Modeling via Novel Causal Spatiotemporal Graph Neural Network for Interpretable Epidemic Forecasting",
                    "abstract": "Accurate epidemic forecasting is crucial for effective disease control and prevention. Traditional compartmental models often struggle to estimate temporally and spatially varying epidemiological parameters, while deep learning models typically overlook disease transmission dynamics and lack interpretability in the epidemiological context. To address these limitations, we propose a novel Causal Spatiotemporal Graph Neural Network (CSTGNN), a hybrid framework that integrates a Spatio-Contact SIR model with Graph Neural Networks (GNNs) to capture the spatiotemporal propagation of epidemics. Inter-regional human mobility exhibits continuous and smooth spatiotemporal patterns, leading to adjacent graph structures that share underlying mobility dynamics. To model these dynamics, we employ an adaptive static connectivity graph to represent the stable components of human mobility and utilize a temporal dynamics model to capture fluctuations within these patterns. By integrating the adaptive static connectivity graph with the temporal dynamics graph, we construct a dynamic graph that encapsulates the comprehensive properties of human mobility networks. Additionally, to capture temporal trends and variations in infectious disease spread, we introduce a temporal decomposition model to handle temporal dependence. This model is then integrated with a dynamic graph convolutional network for epidemic forecasting. We validate our model using real-world datasets at the provincial level in China and the state level in Germany. Extensive studies demonstrate that our method effectively models the spatiotemporal dynamics of infectious diseases, providing a valuable tool for forecasting and intervention strategies. Furthermore, analysis of the learned parameters offers insights into disease transmission mechanisms, enhancing the interpretability and practical applicability of our model.",
                    "citation": "Shuai Han, Lukas Stelz, T. Sokolowski, et al. (2025). Unifying Physics- and Data-Driven Modeling via Novel Causal Spatiotemporal Graph Neural Network for Interpretable Epidemic Forecasting. arXiv.org. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel Causal Spatiotemporal Graph Neural Network (CSTGNN), a hybrid framework that integrates a Spatio-Contact SIR model with Graph Neural Networks (GNNs) to capture the spatiotemporal propagation of epidemics, providing a valuable tool for forecasting and intervention strategies."
                    },
                    "url": "https://www.semanticscholar.org/paper/823e2e052d955a4ea7203f79537542c8ae8c3d6c"
                },
                {
                    "title": "Epidemic spreading in networked metapopulation coupling with activity-driven information dissemination",
                    "abstract": "The information dissemination profoundly influences epidemic spreading, yet their interplay in time-varying systems remains underexplored. To tackle this issue, firstly, a multilayer time-varying network is established to model the coupled information-epidemic dynamics, which comprises a physical layer structured as networked metapopulation with community-preference migration for epidemic transmission and a virtual layer with activity-driven interactions, including media, for information diffusion. Then, using the Microscopic Markov Chain Approach, the temporal evolution of the system state is captured and the expression of the epidemic threshold is derived. Finally, extensive experiments are conducted to explore the role of information dissemination and human mobility in epidemic propagation. Our findings reveal that information dissemination elevates the epidemic threshold, reducing disease prevalence, with media credibility proving more effective than media quantity in mitigating outbreaks. Community heterogeneity and asymmetric mobility further amplify epidemic and awareness spread, particularly in densely connected regions. This study provides a robust theoretical framework for understanding the feedback loop between the coupled information-epidemic spreading dynamics, providing actionable insights for designing public health interventions in spatially and socially complex environments.",
                    "citation": "Yi Wang, Xiaoming Miao, Di Lu (2025). Epidemic spreading in networked metapopulation coupling with activity-driven information dissemination. Physica Scripta. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This study provides a robust theoretical framework for understanding the feedback loop between the coupled information-epidemic spreading dynamics, providing actionable insights for designing public health interventions in spatially and socially complex environments."
                    },
                    "url": "https://www.semanticscholar.org/paper/db3dc330e08658ab5d0c3e51171a9e478d1cdde6"
                },
                {
                    "title": "Tracking mob Dynamics in online social networks Using epidemiology model based on Mobility Equations",
                    "abstract": "Nowadays, social media is the main tool in our new lives. The outbreak news and all related obtained from social media, and mob events affect the of spread these news fast. Recently, epidemiological models to study disease spread and analyze the behavior of mob groups by dealing with\"contagions\"that propagate through user networks. In this research, we introduced a mathematical model to analyze social behavior related to COVID-19 spread by examining Twitter activity from April 2020 to June 2020. The main feature of this model is the integration of mobility dynamics that be derived from the above real data, to adjust the rate of outbreak based on the response of social interactions. Consider mobility as a parameter of time-varying, and fluctuations in the rate of contact that is driven by factors like personal behavior or external affecting such as\"lockdown\"and\"quarantine\"etc., to track public sentiment and engagement trends during the pandemic. The threshold number is derived, and the existence of bifurcation and the stability of the steady states are established. Numerical simulations and sensitivity analysis of relevant parameters are also carried out.",
                    "citation": "Jumana H. S. Alkhalissi, Ahmed Al‐Taweel (2025). Tracking mob Dynamics in online social networks Using epidemiology model based on Mobility Equations. Quality &amp; Quantity. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A mathematical model to analyze social behavior related to COVID-19 spread by examining Twitter activity from April 2020 to June 2020 and considers mobility as a parameter of time-varying, and fluctuations in the rate of contact that is driven by factors like personal behavior or external affecting to track public sentiment and engagement trends during the pandemic."
                    },
                    "url": "https://www.semanticscholar.org/paper/8047611329e1604efb0cc1fff3ca7d7e49df693a"
                },
                {
                    "title": "Epidemic spreading in temporal multilayer networks coupling with individual behavioral changes",
                    "abstract": null,
                    "citation": "Huiying Cao, Bowen Xu, Dengxiu Yu, et al. (2025). Epidemic spreading in temporal multilayer networks coupling with individual behavioral changes. Nonlinear dynamics. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A multilayer activity-driven network with attractiveness is proposed to capture spatiotemporal epidemic spreading at the same timescale with the evolution of social interactions and provides a theoretical fundamental to control spatiotemporal epidemic spreading."
                    },
                    "url": "https://www.semanticscholar.org/paper/fe29c46e5590b7450f53b84cf3f0f702adcdd343"
                },
                {
                    "title": "Impact of message fatigue and individual behavioral responses on epidemiological spread in temporal simplicial networks",
                    "abstract": "Health information spreads rapidly, which can effectively control epidemics. However, the swift dissemination of information also has potential negative impacts, which increasingly attracts attention. Message fatigue refers to the psychological response characterized by feelings of boredom and anxiety that occur after receiving an excessive amount of similar information. This phenomenon can alter individual behaviors related to epidemic prevention. Additionally, recent studies indicate that pairwise interactions alone are insufficient to describe complex social transmission processes, and higher-order structures representing group interactions are crucial. To address this, we develop a novel epidemic model that investigates the interactions between information, behavioral responses, and epidemics. Our model incorporates the impact of message fatigue on the entire transmission system. The information layer is modeled using a static simplicial network to capture group interactions, while the disease layer uses a time-varying network based on activity-driven model with attractiveness to represent the self-protection behaviors of susceptible individuals and self-isolation behaviors of infected individuals. We theoretically describe the co-evolution equations using the microscopic Markov chain approach (MMCA) and get the epidemic threshold. Experimental results show that while the negative impact of message fatigue on epidemic transmission is limited, it significantly weakens the group interactions depicted by higher-order structures. Individual behavioral responses strongly inhibit the epidemic. Our simulations using the Monte Carlo (MC) method demonstrate that greater intensity in these responses leads to clustering of susceptible individuals in the disease layer. Finally, we apply the proposed model to real networks to verify its reliability. In summary, our research results enhance the understanding of the information–epidemic coupling dynamics, and we expect to provide valuable guidance for managing future emerging epidemics.",
                    "citation": "Xiao-Nan 晓楠 Fan 樊, Xuemei 雪梅 You 由 (2025). Impact of message fatigue and individual behavioral responses on epidemiological spread in temporal simplicial networks. Chinese Physics B. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel epidemic model is developed that investigates the interactions between information, behavioral responses, and epidemics and incorporates the impact of message fatigue on the entire transmission system, which enhances the understanding of the information–epidemic coupling dynamics."
                    },
                    "url": "https://www.semanticscholar.org/paper/3b4be34c82e18219c7a8a2dd986d106cce5d699d"
                },
                {
                    "title": "Assessing Reactive Responses and Gathering Restrictions for Eradicating Epidemic Diseases on Networks with Higher-Order Interactions",
                    "abstract": "—We characterize the dynamics of epidemic disease propagation on realistic temporal networks, where individuals participate in both pairwise and higher-order interactions. The latter captures large gatherings that may lead to superspreading events. We introduce an analytically tractable mathematical model for these temporal networks, based on continuous-time activity-driven networks, and study a susceptible–infected–susceptible (SIS) model spreading on its fabric. Utilizing a mean-field approach, we derive a system of ordinary differential equations (ODEs) that dictate the mean dynamics of the SIS process. By analyzing these ODEs, we identify the epidemic threshold of the model—revealing a phase transition between a regime where trajectories converge to a disease-free equilibrium and one where they stabilize at an endemic equilibrium (EE)—and delineate the unique EE for homogeneous networks. Subsequently, we integrate two distinct control measures into the model: i) restricting gatherings and ii) promoting a reactive behavioral response. We evaluate the efficacy of these control measures by computing the epidemic threshold of the controlled SIS model and employing various tools, including sensitivity analysis, mathematical optimization, and numerical simulations, to quantitatively assess how the control measures elevate the threshold, thus aiding in disease eradication, and how to amalgamate them for designing an optimal control policy.",
                    "citation": "Lorenzo Zino, Alessandro Rizzo (2025). Assessing Reactive Responses and Gathering Restrictions for Eradicating Epidemic Diseases on Networks with Higher-Order Interactions. IEEE Transactions on Control of Network Systems. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The dynamics of epidemic disease propagation on realistic temporal networks, where individuals participate in both pairwise and higher-order interactions, are characterized, and a system of ordinary differential equations (ODEs) that dictate the mean dynamics of the SIS process are derived."
                    },
                    "url": "https://www.semanticscholar.org/paper/bfb4cb9941a849f947f3327109d289fd0ecc162d"
                }
            ],
            "summary": ""
        }
    ]
}