{
    "results": [
        {
            "query": "SIR epidemic spreading in activity-driven temporal networks vs static aggregated networks",
            "papers": [
                {
                    "title": "Contagion dynamics in time-varying metapopulation networks",
                    "abstract": "The metapopulation framework is adopted in a wide array of disciplines to describe systems of well separated yet connected subpopulations. The subgroups or patches are often represented as nodes in a network whose links represent the migration routes among them. The connections have been so far mostly considered as static, but in general evolve in time. Here we address this case by investigating simple contagion processes on time-varying metapopulation networks. We focus on the SIR process and determine analytically the mobility threshold for the onset of an epidemic spreading in the framework of activity-driven network models. We find profound differences from the case of static networks. The threshold is entirely described by the dynamical parameters defining the average number of instantaneously migrating individuals and does not depend on the properties of the static network representation. Remarkably, the diffusion and contagion processes are slower in time-varying graphs than in their aggregated static counterparts, the mobility threshold being even two orders of magnitude larger in the first case. The presented results confirm the importance of considering the time-varying nature of complex networks.",
                    "citation": "Suyu Liu, Andrea Baronchelli, N. Perra (2012). Contagion dynamics in time-varying metapopulation networks. arXiv.org. Citations: 78, Influential: 3.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work focuses on the SIR process and determines analytically the mobility threshold for the onset of an epidemic spreading in the framework of activity-driven network models, and finds profound differences from the case of static networks."
                    },
                    "url": "https://www.semanticscholar.org/paper/98769290b14d1b6cb885d6677ce8fbc5224052b0"
                },
                {
                    "title": "Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone",
                    "abstract": "Activity-driven networks (ADNs) are a powerful paradigm to study epidemic spreading in temporal networks, where the dynamics of the disease and the evolution of the links share a common time-scale. One of the key assumptions of ADNs is the lack of preferential connections among individuals. This assumption hinders the application of ADNs to several realistic scenarios where some contacts persist in time, rather than intermittently activate. Here, we examine an improved modeling framework that superimposes an ADN to a static backbone network, toward the integration of persistent contacts with time-varying connections. To demonstrate the interplay between the ADN and the static backbone, we investigate the effect of behavioral changes on the disease dynamics. In this framework, each individual may adapt his/her activity as a function of the health status, thereby adjusting the relative weight of time-varying versus static links. To illustrate the approach, we consider two classes of backbone networks, Erdős-Rényi and random regular, and two disease models, SIS and SIR. A general mean-field theory is established for predicting the epidemic threshold, and numerical simulations are conducted to shed light on the role of network parameters on the epidemic spreading and estimate the epidemic size.",
                    "citation": "Matthieu Nadini, A. Rizzo, M. Porfiri (2020). Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone. IEEE Transactions on Network Science and Engineering. Citations: 37, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/85188024918e9c0d11cab72e0ddec96d4b9e562d"
                },
                {
                    "title": "Risk assessment of Ebola virus disease spreading in Uganda using a two-layer temporal network",
                    "abstract": "Network-based modelling of infectious diseases apply compartmental models on a contact network, which makes the epidemic process crucially dependent on the network structure. For highly contagious diseases such as Ebola virus disease (EVD), interpersonal contact plays the most vital role in human-to-human transmission. Therefore, for accurate representation of EVD spreading, the contact network needs to resemble the reality. Prior research has mainly focused on static networks (only permanent contacts) or activity-driven networks (only temporal contacts) for Ebola spreading. A comprehensive network for EVD spreading should include both these network structures, as there are always some permanent contacts together with temporal contacts. Therefore, we propose a two-layer temporal network for Uganda, which is at risk of an Ebola outbreak from the neighboring Democratic Republic of Congo (DRC) epidemic. The network has a permanent layer representing permanent contacts among individuals within the family level, and a data-driven temporal network for human movements motivated by cattle trade, fish trade, or general communications. We propose a Gillespie algorithm with the susceptible-infected-recovered (SIR) compartmental model to simulate the evolution of EVD spreading as well as to evaluate the risk throughout our network. As an example, we applied our method to a network consisting of 23 districts along different movement routes in Uganda starting from bordering districts of the DRC to Kampala. Simulation results show that some regions are at higher risk of infection, suggesting some focal points for Ebola preparedness and providing direction to inform interventions in the field. Simulation results also show that decreasing physical contact as well as increasing preventive measures result in a reduction of chances to develop an outbreak. Overall, the main contribution of this paper lies in the novel method for risk assessment, which can be more precise with an increasing volume of accurate data for creating the network model.",
                    "citation": "Mahbubul H. Riad, M. Sekamatte, Felix Ocom, et al. (2019). Risk assessment of Ebola virus disease spreading in Uganda using a two-layer temporal network. Scientific Reports. Citations: 19, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel method for risk assessment that can be more precise with an increasing volume of accurate data for creating the network model is proposed, which shows that some regions are at higher risk of infection."
                    },
                    "url": "https://www.semanticscholar.org/paper/9f9ccf99595f27b4b39ef92eea16c8336eaddadf"
                },
                {
                    "title": "Risk assessment of Ebola virus disease spreading in Uganda using a multilayer temporal network",
                    "abstract": "Network-based modelling of infectious diseases apply compartmental models on a contact network, which makes the epidemic process crucially dependent on the network structure. For highly contagious diseases such as Ebola virus disease (EVD), the inter-personal contact plays the most vital role in the human to human transmission. Therefore, for accurate representation of the EVD spreading, the contact network needs to resemble the reality. Prior research work has mainly focused on static networks (only permanent contacts) or activity driven networks (only temporal contacts) for Ebola spreading. A comprehensive network for EVD spreading should include both these network structures, as there are always some permanent contacts together with temporal contacts. Therefore, we propose a multilayer temporal network for Uganda, which is at risk of Ebola outbreak from the neighboring Democratic Republic of Congo (DRC) epidemic. The network has a permanent layer representing permanent contacts among individuals within family level, and a data driven temporal network for human movements motivated by cattle trade, fish trade, or general communications. We propose a Gillespie algorithm with the susceptible-infected-recovered (SIR) compartmental model to simulate the evolution of the EVD spreading as well as to evaluate the risk throughout our network. As an example, we applied our method to a multilayer network consisting of 23 districts along different movement routes in Uganda starting from bordering districts of DRC to Kampala. Simulation results shows that some regions are at higher risk of infection, suggesting some focal points for Ebola preparedness and providing direction to inform interventions in the field. Simulation results also shows that decreasing physical contacts as well as increasing preventive measures result in a reduction of chances to develop an outbreak. Overall, the main contribution of this paper lies in the novel method for risk assessment, the accuracy of which can be increased by increasing the amount and the accuracy of the data used to build the network and the model.",
                    "citation": "Mahbubul H. Riad, M. Sekamatte, Felix Ocom, et al. (2019). Risk assessment of Ebola virus disease spreading in Uganda using a multilayer temporal network. bioRxiv. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A Gillespie algorithm with the susceptible-infected-recovered (SIR) compartmental model is proposed to simulate the evolution of the EVD spreading as well as to evaluate the risk throughout the network, which shows that some regions are at higher risk of infection."
                    },
                    "url": "https://www.semanticscholar.org/paper/5796112d90c471bc2b300a873205219cb4beb958"
                },
                {
                    "title": "Impact of temporal connectivity patterns on epidemic process",
                    "abstract": "To provide a comprehensive view for dynamics of and on many real- world temporal networks, we investigate the interplay of temporal connectivity patterns and spreading phenomena, in terms of the susceptible-infected-removed (SIR) model on the modified activity-driven temporal network (ADTN) with memory. In particular, we focus on how the epidemic threshold of the SIR model is affected by the heterogeneity of nodal activities and the memory strength in temporal and static regimes, respectively. While strong ties (memory) between nodes inhibit the spread of epidemic to be localized, the heterogeneity of nodal activities enhances it to be globalized initially. Since the epidemic threshold of the SIR model is very sensitive to the degree distribution of nodes in static networks, we test the SIR model on the modified ADTNs with the possible set of the activity exponents and the memory exponents that generates the same degree distributions in temporal networks. We also discuss the role of spatiotemporal scaling properties of the largest cluster and the maximum degree in the epidemic threshold. It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network. This implies that there is the trade-off between the spreading time of epidemic and its outbreak size. Finally, we suggest the phase diagram of the SIR model on ADTNs and the optimal condition for the spread of epidemic under the circumstances.",
                    "citation": "Hyewon Kim, Meesoon Ha, Hawoong Jeong (2019). Impact of temporal connectivity patterns on epidemic process. European Physical Journal B : Condensed Matter Physics. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network, which implies that there is the trade-off between the spreading time of epidemic and its outbreak size."
                    },
                    "url": "https://www.semanticscholar.org/paper/5997d33b9a34ea5c904935b18dbbe0a48496dbf9"
                },
                {
                    "title": "Abstract Submitted for the MAR13 Meeting of The American Physical Society Contagion dynamics in time-varying metapopulation networks",
                    "abstract": null,
                    "citation": "N. Perra (2013). Abstract Submitted for the MAR13 Meeting of The American Physical Society Contagion dynamics in time-varying metapopulation networks. Unknown Journal. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/4e7661548cc25cea78338b22bb6ab7d263494734"
                }
            ],
            "summary": ""
        }
    ]
}