{
    "results": [
        {
            "query": "SIRS model small-world network epidemic oscillations viral trends digital contagion",
            "papers": [
                {
                    "title": "Homogenous mixing and network approximations in discrete-time formulation of a SIRS model",
                    "abstract": "A discrete-time deterministic epidemic model is proposed to better understand the contagious dynamics and the behaviour observed in the incidence of real infectious diseases. For this purpose, we analyse a SIRS model both in a random-mixing approach and in a small-world network formulation. The models include the basic parameters that characterize an epidemic: infection and recovery times, as well as mechanisms of contagion. Depending on the parameters, the random-mixing model has different types of behaviour of an epidemic: pathogen extinction; endemic infection; sustained oscillations and dynamic extinction. Spatial effects are included in our network-based approach, where each individual of a population is represented by a node of a small-world network. Our network-based approach includes rewiring connections to account for time-varying network structure, a consequence of the natural response to the emergence of an epidemic (e.g. avoiding contacts with infected individuals). Random and adaptive rewiring conditions are analysed and numerical simulation are made. A comparison of model predictions with the actual effects of COVID-19 infection on population that occurred in Italy and France is produced. Results of the time series of infected people show that our adaptive evolving networks represent effective strategies able to decrease the epidemic spreading.",
                    "citation": "Ilaria Renna (2021). Homogenous mixing and network approximations in discrete-time formulation of a SIRS model. Journal of Biological Dynamics. Citations: 2, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Results of the time series of infected people show that the adaptive evolving networks represent effective strategies able to decrease the epidemic spreading."
                    },
                    "url": "https://www.semanticscholar.org/paper/f33d56c63626bbbf8909ac35b4287eb9fc959429"
                }
            ],
            "summary": ""
        },
        {
            "query": "SIRS model dynamic oscillations small-world network viral information spread",
            "papers": [
                {
                    "title": "Identifying influential nodes in spreading process in complex networks by integrating node dynamic propagation features and local structure",
                    "abstract": "Identifying the most influential nodes in the spreading process in complex networks is crucial in many applications, such as accelerating the diffusion of information and suppressing the spread of viruses or rumors. Existing methods for identifying influential spreaders have their limitations: classical network centrality methods rely solely on local or global topology to predict node influence; traditional machine learning and deep learning methods are not suitable for graph-structured data; and existing graph neural network-based methods neglect the dynamic characteristics of the propagation process itself. However, researches have pointed out that a node’s spreading influence does not only depend on its structural location, but is also significantly influenced by the dynamics of the spreading process itself. In this paper, we propose a Propagation Dynamics Graph Neural Network (PDGNN) that integrates the dynamic features of the propagation process and the structural features of nodes to identify influential nodes. Specifically speaking, based on the Susceptible-Infected-Recovered (SIR) propagation model, the dynamic infection features and potential infection capacity of nodes are extracted from the epidemic spreading process. Then a high-dimensional feature vector consisting of the embedding and the degree of the local transmission tree, and the dynamic sensitivity centrality of each node is constructed and used as the input to the graph neural network. To deal with the problem of imbalanced numbers between critical nodes and non-critical nodes in training the model and optimizing the output, an optimized loss function is designed, which combines Focal Loss with Mean Squared Error. Experimental results on two synthetic networks and seven real-world networks show that PDGNN outperforms classical centrality methods, traditional machine learning and deep learning-based methods, and existing graph neural network-based methods in identifying influential nodes in the spreading process in complex networks. The performance of PDGNN is robust when the infection rate and the size of the training set change. Under a wide range of infection rates, the proposed PDGNN can accurately identify influential spreaders. Even when the training set is 30% of the total dataset, the imprecision of PDGNN is small in all nine studied networks.",
                    "citation": "HOU Shiyu, Liu Ying, TANG Ming (2025). Identifying influential nodes in spreading process in complex networks by integrating node dynamic propagation features and local structure. Acta Physica Sinica. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Experimental results show that PDGNN outperforms classical centrality methods, traditional machine learning and deep learning-based methods, and existing graph neural network-based methods in identifying influential nodes in the spreading process in complex networks."
                    },
                    "url": "https://www.semanticscholar.org/paper/dcf6599d4c261bc4e471adfdad4841c8b00ba5b0"
                },
                {
                    "title": "ICDC: Ranking Influential Nodes in Complex Networks Based on Isolating and Clustering Coefficient Centrality Measures",
                    "abstract": "Over the past decade, there has been extensive research conducted on complex networks, primarily driven by their crucial role in understanding the various real-world networks such as social networks, communication networks, transportation networks, and biological networks. Ranking influential nodes is one of the fundamental research problems in the areas of rumor spreading, disease research, viral marketing, and drug development. Influential nodes in any network are used to disseminate the information as fast as possible. Centrality measures are designed to quantify the node’s significance and rank the influential nodes in complex networks. However, these measures typically focus on either the local or global topological structure within and outside network communities. In particular, many measures limit their ability to capture the node’s overall impact on small-scale networks. To address these challenges, we develop a novel centrality measure called Isolating Clustering Distance Centrality (ICDC) by integrating the isolating and clustering coefficient centrality measures. The proposed metric gives a more thorough assessment of the node’s importance by integrating the local isolation and global topological influence in large-scale complex networks. We employ the SIR and ICM epidemic models to study the efficiency of ICDC against traditional centrality measures across real-world complex networks. Our experimental findings consistently highlight the superior efficacy of ICDC in terms of fast spreading and computational efficiency when compared to existing centrality measures.",
                    "citation": "Mondikathi Chiranjeevi, V. S. Dhuli, M. Enduri, et al. (2023). ICDC: Ranking Influential Nodes in Complex Networks Based on Isolating and Clustering Coefficient Centrality Measures. IEEE Access. Citations: 9, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel centrality measure called Isolating Clustering Distance Centrality (ICDC), integrating the isolating and clustering coefficient centrality measures, which gives a more thorough assessment of the node’s importance by integrating the local isolation and global topological influence in large-scale complex networks."
                    },
                    "url": "https://www.semanticscholar.org/paper/ca0dd0c171ac8a57ed0bb312d705dbe6b0b810e8"
                },
                {
                    "title": "Homogenous mixing and network approximations in discrete-time formulation of a SIRS model",
                    "abstract": "A discrete-time deterministic epidemic model is proposed to better understand the contagious dynamics and the behaviour observed in the incidence of real infectious diseases. For this purpose, we analyse a SIRS model both in a random-mixing approach and in a small-world network formulation. The models include the basic parameters that characterize an epidemic: infection and recovery times, as well as mechanisms of contagion. Depending on the parameters, the random-mixing model has different types of behaviour of an epidemic: pathogen extinction; endemic infection; sustained oscillations and dynamic extinction. Spatial effects are included in our network-based approach, where each individual of a population is represented by a node of a small-world network. Our network-based approach includes rewiring connections to account for time-varying network structure, a consequence of the natural response to the emergence of an epidemic (e.g. avoiding contacts with infected individuals). Random and adaptive rewiring conditions are analysed and numerical simulation are made. A comparison of model predictions with the actual effects of COVID-19 infection on population that occurred in Italy and France is produced. Results of the time series of infected people show that our adaptive evolving networks represent effective strategies able to decrease the epidemic spreading.",
                    "citation": "Ilaria Renna (2021). Homogenous mixing and network approximations in discrete-time formulation of a SIRS model. Journal of Biological Dynamics. Citations: 2, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Results of the time series of infected people show that the adaptive evolving networks represent effective strategies able to decrease the epidemic spreading."
                    },
                    "url": "https://www.semanticscholar.org/paper/f33d56c63626bbbf8909ac35b4287eb9fc959429"
                },
                {
                    "title": "Small-world effects in a modified epidemiological model with mutation and permanent immune mechanism",
                    "abstract": "Pandemic with mutation and permanent immune spreading in a small-world network described is studied by a modified SIR model, with consideration of mutation-immune mechanism. First, a novel mutation-immune model is proposed to modify the classical SIR model to simulate the transmission of mutable viruses that can be permanently immunized in small-world networks. Then, the influences of the size, coordination number and disorder parameter of the small-world network on the spread of the epidemic are analyzed in detail. Finally, the influences of mutation cycle and infection rate on epidemic transmission in small-world network are investigated further. The results show that the structure of the small-world network and the virus mutation cycle have an important impact on the spread of the epidemic. For viruses that can be permanently immunized, virus mutation is equivalent to making the immune cycle of human beings from infinite to finite. The dynamical behavior of the modified SIR epidemic model changes from an irregular, low-amplitude evolution at small disorder parameter to a spontaneous state of wide amplitude oscillations at large disorder parameter. Moreover, similar transition can also be found in increasing mutation cycle parameter. The maximum valid variation mutation decreases with the increase of disorder parameter and coordination number, but increase with respect to system size. In addition above, as the infection rate increases, the fraction of the infected increases and then decreases. As the mutation cycle increases, the time-average fraction of the infected and the infection rate corresponding to the maximum time-average fraction of the infected also decrease. As one conclusion, the results could give a deep understanding Pandemic with mutation and permanent immune spreading, from viewpoint of small-world network.",
                    "citation": "Shengli Cao, Peihua Feng, Wei Wang, et al. (2021). Small-world effects in a modified epidemiological model with mutation and permanent immune mechanism. Nonlinear dynamics. Citations: 4, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results show that the structure of the small-world network and the virus mutation cycle have an important impact on the spread of the epidemic, equivalent to making the immune cycle of human beings from infinite to finite."
                    },
                    "url": "https://www.semanticscholar.org/paper/3d866a7b136878cfe67d5bfe84fb82902b65bd06"
                },
                {
                    "title": "Information Propagation Model in Hybrid Networks",
                    "abstract": "It is in practice impossible to describe the topology of a real network or its message propagation process using a single dynamic model. To address this issue, we constructed a new hybrid network model based on scale-free (SF), small-world (SW) features that functions as closely as possible to a real network. And the hybrid propagation model is constructed with susceptible-infected-susceptible (SIS), susceptible-infected-recovered (SIR) and susceptible-infected-recovered-susceptible (SIRS) model mixed in arbitrary proportions. The model applies the concepts of blockbuster effect and implicit node edges to reflect explosive spread as a significant characteristic of information propagation. A theoretical analysis and derivation of the new model in which hybrid networks were simulated revealed that the network degree distribution closely follows a power law. Using an improved similarity function to define the degree of closeness to real network cases, the proposed model was shown to be valid and very close to a real network.",
                    "citation": "Fuzhong Nian, Hongyuan Diao (2020). Information Propagation Model in Hybrid Networks. arXiv.org. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A new hybrid network model based on scale-free, small-world features that functions as closely as possible to a real network is constructed that applies the concepts of blockbuster effect and implicit node edges to reflect explosive spread as a significant characteristic of information propagation."
                    },
                    "url": "https://www.semanticscholar.org/paper/9b55f868a0049ae88395fe31fbbe1b53772c6aae"
                },
                {
                    "title": "Population-scale testing can suppress the spread of COVID-19",
                    "abstract": "We propose an additional intervention that would contribute to the control of the COVID-19 pandemic, offer more protection for people working in essential jobs, and help guide an eventual reopening of society. The intervention is based on: (1) testing every individual (2) repeatedly, and (3) self-quarantine of infected individuals. Using a standard epidemiological model (SIR), we show here that by identification and isolation of the majority of infectious individuals, including those who may be asymptomatic, the reproduction number R0 of SARS-CoV-2 would be reduced well below 1.0, and the epidemic would collapse. We replicate these observations in a more complex stochastic dynamic model on a social network graph. We also find that the testing regime would be additive to other interventions, and be effective at any level of prevalence. If adopted as a policy, any industrial society could sustain the regime for as long as it takes to find a safe and effective cure or vaccine. Our model also indicates that unlike sampling-based tests, population-scale testing does not need to be very accurate: false negative rates up to 15% could be tolerated if 80% comply with testing every ten days, and false positives can be almost arbitrarily high when a high fraction of the population is already effectively quarantined. Testing at the required scale would be feasible if existing qPCR-based methods are scaled up and multiplexed. A mass produced, low throughput field test kit could also be carried out at home. Economic analysis also supports the feasibility of the approach: current reagent costs for tests are in the range of a dollar or less, and the estimated benefits for population-scale testing are so large that the policy would be cost-effective even if the costs were larger by more than two orders of magnitude. To identify both active and previous infections, both viral RNA and antibodies could be tested. All technologies to build such test kits, and to produce them in the scale required to test the entire world's population exist already. Integrating them, scaling up production, and implementing the testing regime will require resources and planning, but at a scale that is very small compared to the effort that every nation would devote to defending itself against a more traditional foe.",
                    "citation": "J. Taipale, P. Romer, S. Linnarsson (2020). Population-scale testing can suppress the spread of COVID-19. medRxiv. Citations: 64, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "By identification and isolation of the majority of infectious individuals, including those who may be asymptomatic, the reproduction number R0 of SARS-CoV-2 would be reduced well below 1.0, and the epidemic would collapse, it is shown."
                    },
                    "url": "https://www.semanticscholar.org/paper/e23cbdcfe6ad83648de16283bd0f4187c1b60d64"
                },
                {
                    "title": "A Human Flesh Search Model Based on Multiple Effects",
                    "abstract": "A new model of human flesh search (HFS) was established based on the susceptible-infected-susceptible model (SIS model) and susceptible-infected-recovered model (SIR model). Four effects - impulsive effect, hot effect, herd effect and coupling effect - were proposed. In addition, the corresponding influence was investigated in the process of HFS. The results show that the impulse effect is the major factor at the early stage of propagation, and the hot effect and the herding effect play a major role at the mid-propagation. Furthermore, the coupling effect indicates that the spreading of one information fragment would be influenced by others. Moreover, the dynamic propagation rate and dynamic recovery rate were introduced; they are different from the propagation probability and recovery probability of the classical model. The propagation properties of the new model were then analyzed, and numerical simulations were performed on the small-world networks and the scale-free networks. At the same time, the validity of the new model was verified through the comparative experiment between the simulation of the proposed model and real case.",
                    "citation": "Fuzhong Nian, Hongyuan Diao (2020). A Human Flesh Search Model Based on Multiple Effects. IEEE Transactions on Network Science and Engineering. Citations: 17, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/45b92dc6ada223f23068ccfbe295800fd8aa37f5"
                }
            ],
            "summary": ""
        }
    ]
}