{
    "results": [
        {
            "query": "Activity-driven temporal networks parameters realism human contact",
            "papers": [
                {
                    "title": "momentuHMM: R package for generalized hidden Markov models of animal movement",
                    "abstract": "Discrete‐time hidden Markov models (HMMs) have become an immensely popular tool for inferring latent animal behaviours from telemetry data. While movement HMMs typically rely solely on location data (e.g. step length and turning angle), auxiliary biotelemetry and environmental data are powerful and readily‐available resources for incorporating much more ecological and behavioural realism. However, complex movement or observation process models often necessitate custom and computationally demanding HMM model‐fitting techniques that are impractical for most practitioners, and there is a paucity of generalized user‐friendly software available for implementing multivariate HMMs of animal movement. Here, we introduce an open‐source R package, momentuHMM, that addresses many of the deficiencies in existing HMM software. Features include: (1) data pre‐processing and visualization; (2) user‐specified probability distributions for an unlimited number of data streams and latent behaviour states; (3) biased and correlated random walk movement models, including dynamic “activity centres” associated with attractive or repulsive forces; (4) user‐specified design matrices and constraints for covariate modelling of parameters using formulas familiar to most R users; (5) multiple imputation methods that account for measurement error and temporally irregular or missing data; (6) seamless integration of spatio‐temporal covariate raster data; (7) cosinor and spline models for cyclical and other complicated patterns; (8) model checking and selection; and (9) simulation. After providing an overview of the main features of the package, we demonstrate some of the capabilities of momentuHMM using real‐world examples. These include models for cyclical movement patterns of African elephants, foraging trips of northern fur seals, loggerhead turtle movements relative to ocean surface currents, and grey seal movements among three activity centres. momentuHMM considerably extends the capabilities of existing HMM software while accounting for common challenges associated with telemetry data. It therefore facilitates more realistic hypothesis‐driven animal movement analyses that have hitherto been largely inaccessible to non‐statisticians. While motivated by telemetry data, the package can be used for analysing any type of data that is amenable to HMMs. Practitioners interested in additional features are encouraged to contact the authors.",
                    "citation": "B. McClintock, T. Michelot (2017). momentuHMM: R package for generalized hidden Markov models of animal movement. Unknown Journal. Citations: 274, Influential: 38.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": null
                    },
                    "url": "https://www.semanticscholar.org/paper/9aa33838f3008edf4ff86bb8e7c2275933600dea"
                },
                {
                    "title": "Key role of coupling, delay, and noise in resting brain fluctuations",
                    "abstract": null,
                    "citation": "G. Deco, Viktor Jirsa, A. Mcintosh, et al. (2009). Key role of coupling, delay, and noise in resting brain fluctuations. Proceedings of the National Academy of Sciences of the United States of America. Citations: 753, Influential: 34.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "In numerical simulation, the dynamics of a simplified cortical network using 38 noise-driven (Wilson–Cowan) oscillators, which in isolation remain just below their oscillatory threshold are studied, indicating the presence of stochastic resonance and high sensitivity to changes in diffuse feedback activity."
                    },
                    "url": "https://www.semanticscholar.org/paper/b387c1bf4dbe5b80d621b824ee301c0cf2c4e31c"
                },
                {
                    "title": "High-amplitude cofluctuations in cortical activity drive functional connectivity",
                    "abstract": "Significance Despite widespread applications, the origins of functional connectivity remain elusive. Here we analyze human functional neuroimaging data. We decompose resting-state functional connectivity across time to assess the contributions of moment-to-moment activity cofluctuations to the overall connectivity pattern. We show that functional connectivity is driven by a small number of high-amplitude frames. We show that these frames are underpinned by a specific mode of brain activity; that the topography of this mode gets modulated during in-scanner tasks; and that high-amplitude frames encode personalized, subject-specific information. In summary, our parameter-free method provides an exact mathematical link between functional connectivity and frame-wise cofluctuations, creating opportunities for studying both static and time-varying functional brain networks. Resting-state functional connectivity is used throughout neuroscience to study brain organization and to generate biomarkers of development, disease, and cognition. The processes that give rise to correlated activity are, however, poorly understood. Here we decompose resting-state functional connectivity using a temporal unwrapping procedure to assess the contributions of moment-to-moment activity cofluctuations to the overall connectivity pattern. This approach temporally resolves functional connectivity at a timescale of single frames, which enables us to make direct comparisons of cofluctuations of network organization with fluctuations in the blood oxygen level-dependent (BOLD) time series. We show that surprisingly, only a small fraction of frames exhibiting the strongest cofluctuation amplitude are required to explain a significant fraction of variance in the overall pattern of connection weights as well as the network’s modular structure. These frames coincide with frames of high BOLD activity amplitude, corresponding to activity patterns that are remarkably consistent across individuals and identify fluctuations in default mode and control network activity as the primary driver of resting-state functional connectivity. Finally, we demonstrate that cofluctuation amplitude synchronizes across subjects during movie watching and that high-amplitude frames carry detailed information about individual subjects (whereas low-amplitude frames carry little). Our approach reveals fine-scale temporal structure of resting-state functional connectivity and discloses that frame-wise contributions vary across time. These observations illuminate the relation of brain activity to functional connectivity and open a number of directions for future research.",
                    "citation": "Farnaz Zamani Esfahlani, Youngheun Jo, Joshua Faskowitz, et al. (2020). High-amplitude cofluctuations in cortical activity drive functional connectivity. Proceedings of the National Academy of Sciences of the United States of America. Citations: 194, Influential: 15.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This approach temporally resolves functional connectivity at a timescale of single frames, which enables us to make direct comparisons of cofluctuations of network organization with fluctuations in the blood oxygen level-dependent (BOLD) time series."
                    },
                    "url": "https://www.semanticscholar.org/paper/dcec346434b6d0c3d24ff6075dcb5320f79e2c6b"
                },
                {
                    "title": "GroundLink: A Dataset Unifying Human Body Movement and Ground Reaction Dynamics",
                    "abstract": "The physical plausibility of human motions is vital to various applications in fields including but not limited to graphics, animation, robotics, vision, biomechanics, and sports science. While fully simulating human motions with physics is an extreme challenge, we hypothesize that we can treat this complexity as a black box in a data-driven manner if we focus on the ground contact, and have sufficient observations of physics and human activities in the real world. To prove our hypothesis, we present GroundLink, a unified dataset comprised of captured ground reaction force (GRF) and center of pressure (CoP) synchronized to standard kinematic motion captures. GRF and CoP of GroundLink are not simulated but captured at high temporal resolution using force platforms embedded in the ground for uncompromising measurement accuracy. This dataset contains 368 processed motion trials (∼ 1.59M recorded frames) with 19 different movements including locomotion and weight-shifting actions such as tennis swings to signify the importance of capturing physics paired with kinematics. GroundLinkNet, our benchmark neural network model trained with GroundLink, supports our hypothesis by predicting GRFs and CoPs accurately and plausibly on unseen motions from various sources. The dataset, code, and benchmark models are made public for further research on various downstream tasks leveraging the rich physics information at https://csr.bu.edu/groundlink/.",
                    "citation": "Xingjian Han, Ben Senderling, Stanley To, et al. (2023). GroundLink: A Dataset Unifying Human Body Movement and Ground Reaction Dynamics. ACM SIGGRAPH Conference and Exhibition on Computer Graphics and Interactive Techniques in Asia. Citations: 16, Influential: 6.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "GroundLinkNet, the benchmark neural network model trained with GroundLink, supports the hypothesis by predicting GRFs and CoPs accurately and plausibly on unseen motions from various sources by predicting the importance of capturing physics paired with kinematics."
                    },
                    "url": "https://www.semanticscholar.org/paper/600ccb4da2ed6ea274fb14d1472f06474bce57d5"
                },
                {
                    "title": "The CA3 region of the hippocampus: how is it? What is it for? How does it do it?",
                    "abstract": "The hippocampus, in the temporal lobe, is phylogenetically one of the oldest parts of the brain and forms part of the limbic system. The hippocampus proper is defined by the dentate gyrus and Cornu Ammonis (CA). While the dentate gyrus contains the fascia dentata and the hilus, the CA is anatomically and functionally differentiated into distinct subfields named CA1, CA2, CA3, and CA4. The CA3 region has attracted major attention in recent years for its specific role in memory processes, susceptibility to seizures and neuro-degeneration. \n \nInternal connectivity in the CA3 subfield is more rich than in other hippocampal regions. Recurrent axon collaterals of CA3 pyramidal cells ramify extensively making excitatory contacts with neighboring excitatory and inhibitory neurons (Lorente de No, 1934). This circuit is implicated in encoding spatial representations (O'Keefe and Nadel, 1978) and episodic memories (Scoville and Milner, 1957). It generates coherent population synchronies, including gamma, theta and sharp-waves, presumed to associate firing in selected assemblies of cells in different behavioral conditions (Buzsaki et al., 1983). The CA3 region receives inputs from the entorhinal cortex either directly via the perforant path or indirectly from the dentate gyrus via the mossy fibers (Amaral and Witter, 1983). Mossy fiber connections made with principal or mossy cells terminate with large boutons (5–8 μm) while those with interneurons are targeted by smaller filopodial extensions. The mossy fiber pathway acts as a high-pass filter that translates densely coded cortical signals to a sparse, specific hippocampal code, essential for memory formation. \n \nThis e-book aims to highlight recent advances by bringing together experts on the cellular and molecular mechanisms regulating the wiring properties of the CA3 hippocampal microcircuit in both physiological and pathological conditions. The seven reviews and four research articles are organized to follow neuronal information flowing from the dentate gyrus to the CA3 associative network. \n \nFirstly, Munster-Wandowski et al. (2013) (Inst. Integrative Neuroanatomy, La Charite, Berlin and Instituto Politecnico Nacional, Mexico City) review recent data showing that MF terminals can transiently release GABA as well as glutamate, both in early post-natal life and after periods of intense activity in adulthood. GABA and glutamate co-release from single identified MF boutons has been recently demonstrated. Mossy fibers apparently form electrical synapses, as well as chemical synapses, with CA3 pyramidal cells potentially permitting a fast excitation to overcome a strong, but delayed, feed-forward inhibition. \n \nSince MF axons of dentate granule cells may be generated post-natally, Pedroni et al. (2014) (Dept. Neurosci, SISSA, Trieste and European Brain Research Inst, Rome) studied immature granule cells at P0–P3. At this age, with a clear GABAergic phenotype, granule cells have small somata, few dendritic branches and axons often terminate as growth cones in the CA3 region. Depolarization induces either rudimentary or overshooting sodium spikes and low threshold calcium spikes. Post-synaptic CA3 pyramidal cells participate in spontaneous GDPs driven by synergistic actions of GABA and glutamate. The excitatory actions of GABA released from mossy fiber terminals may be crucial for network synchrony, suggested to refine microcircuits of the CA3 region. \n \nRadial glial cells guide migrating CA3 neurons during development. After characterizing signaling molecules and the temporal sequence of hippocampal development, Belvindrah et al. (2014) (INSERM U839, Inst. Fer a Moulin, Paris) review abnormalities of migration linked to human brain malformations: agenesia, lissencephaly, holoprosencephaly, polymicrogyria, heterotopia, and focal cortical dysplasia. Mutations in genes associated with neuronal migration in mouse models result in lamination defects of the CA3 area, a region especially vulnerable to stress and seizure-induced damage. This review links genetic, migration and cellular defects and multiple inherited neurological and psychiatric disorders. \n \nAn overview of how CA3 neurons process afferent activity from dentate granule cells is provided by Evstratova and Toth (2014) (Dept. Psychiatry and Neuroscience, Universite Laval, Quebec City). They describe how the shape of mossy fiber terminals affects transmission to both CA3 pyramidal cells and interneurons. Transmission exhibits short-term plasticities over different frequencies which vary according to post-synaptic cell type. Granule cells usually fire at 0.01–0.1 Hz, but frequency can increase to 15–50 Hz or even higher when spatial information is coded. At these higher frequencies, glutamate also activates presynaptic autoreceptors, which modulate calcium signaling and release from mossy fiber terminals. These processes, including synaptic plasticity, differ at MF. \n \nLorente de No (1934) suggested that recurrent cortical connections might underly reverberating neuronal discharges as a short-term electrical memory. Le Duigou et al. (2014) (INSERM U112, Inst. du Cerveau et de la Moelle, Paris) review recurrent circuits in the CA3 region. CA3 pyramidal cell axons form an associative network associated with sharp waves and other EEG oscillations as well as epileptiform synchrony. Paired records from CA3 pyramidal cells and interneurons have provided data on synaptic contacts and efficacy within recurrent circuits. Connectivity in the associative recurrent CA3 network seems to be spatially more extensive and sparse than in other sensory cortices possibly facilitating representation coding. \n \nKesner (2013) (Dept. Psychology, Univ. Utah, Salt Lake City) reviews contributions from the CA3 region subfields CA3a, b and c in acquiring and encoding spatial information. Mnemonic functions depend on synaptic interactions of CA3 associative networks, operating as an attractor, with inputs from the dentate gyrus and entorhinal cortex (Kesner and Hunsaker, 2010). Fields CA3a and b encode spatial information in short-term memory and also support retrieval by spatial pattern completion. In contrast, the CA3c field may support pattern separation via interactions with the DG. The output subfields, CA3a and b process information sequentially communicating with the CA1 region via the Schaffer collaterals. \n \nRolls (2013) (Centre for Computational Neuroscience, Univ Oxford and Dept. Computer Science, Univ. Warwick) describes quantitatively how the CA3 region operates and how it contributes to episodic memory. The CA3 system, through its recurrent collateral connections, is presented as a single attractor enabling fast, one trial, associations between any spatial location and an object or reward. A recurrent structure permits memory completion during recall from any subset of acquired links. This theory permits associations between time, objects and rewards to provide the temporal order needed for episodic memory. Neurophysiological tests and supports of the theory are described with novel hypotheses on the advantages of a low recurrent connectivity in CA3. \n \nCerasti and Treves (2013) (Cognitive Neuroscience, SISSA, Trieste, College de France, Paris and Kavli Inst., Trondheim) next discuss how self-organizing recurrent connections enable spatial representations to be acquired in the CA3 area. A simplified network model shows that self-organization can lead to the emergence of multiple loosely organized discrete point-like attractors which differ from structures associated with a single, continuous attractor. \n \nThe pivotal role of the CA3 region in humans is discussed by Deuker et al. (2014) (Dept. Epileptology and Center for Neurodegenerative Diseases Univ. Bonn and Donders Inst., Univ. Nijmegen). They describe how the human CA3 region forms associations during encoding and how during retrieval it reconstructs memory representations with pattern separation and completion based on partial cues (Deuker et al., 2013). Functional properties of different hippocampal subfields can be identified with high resolution fMRI and related to behavioral, and structural alterations associated with mild cognitive impairment in early Alzheimer's disease. \n \nSpatial information is encoded by the phase of principal cell firing during theta oscillations. The hyperpolarization activated cation current Ih is a critical regulator of this phase dependent firing. The research article of Borel et al. (2013) (Dept. Physiology, Development and Neuroscience, Univ. Cambridge and Dept. Brain and Cognitive Engineering, Korea Univ. Seoul) asks how Ih controls firing of CA1 and CA3 pyramidal cells. CA1 neurons are suggested to express Ih at higher levels than CA3 pyramidal cells ensuring larger responses to hyperpolarization and thus more prominent resonance peaks. With a strong Ih, excitatory inputs during theta can delay firing, an effect counteracted by phasic inhibitory currents during theta oscillations. Interactions between synaptic inputs and active Ih currents may then account for distinct phase responses of CA1 and CA3 neurons in temporal outputs during theta oscillations. \n \nThe final article from Nava-Mesa et al. (2013) (Lab. Neurofisiologia y Comportamiento, Univ. Castilla-La Mancha, Ciudad Real and Dept. Fisiologia y Farmacologia, Univ. Salamanca) shows how the Aβ peptide affects synapses made by fimbrial afferents with CA3 pyramidal cells. Stimulation of the lateral fimbria evokes AMPA-mediated EPSPs followed by early and late IPSPs mediated by distinct GABA receptors. Aβ depolarizes CA3 pyramidal cells, increases their input resistance and decreases the late GABAB-mediated IPSP current. This post-synaptic effect, is mediated via the G protein-gated inwardly rectifying potassium channel GirK. Dysfunction of septo-hippocampal oscillations involving GirK at fimbria-CA3 synapses may account for memory deficits during early stages of Alzheimer's disease.",
                    "citation": "E. Cherubini, R. Miles (2015). The CA3 region of the hippocampus: how is it? What is it for? How does it do it?. Frontiers in Cellular Neuroscience. Citations: 146, Influential: 6.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This e-book aims to highlight recent advances by bringing together experts on the cellular and molecular mechanisms regulating the wiring properties of the CA3 hippocampal microcircuit in both physiological and pathological conditions."
                    },
                    "url": "https://www.semanticscholar.org/paper/0e9b2c048190b05e8f8cae0ade292e0a21e75929"
                },
                {
                    "title": "Affective Computing and Intelligent Interaction",
                    "abstract": null,
                    "citation": "Michael, K. Kroschel, H. Harris, et al. (2007). Affective Computing and Intelligent Interaction. Unknown Journal. Citations: 133, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Affective Facial Expression and Recognition, a Multi-method Approach to the Assessment of Web Page Designs, and Affective Speech Processing."
                    },
                    "url": "https://www.semanticscholar.org/paper/872844d7578e920cda1368fdbd433a4ecaed1618"
                },
                {
                    "title": "Evaluation of BioSoil Demonstration Project Soil Data Analysis",
                    "abstract": null,
                    "citation": "R. Hiederer, E. Micheli, T. Durrant (2011). Evaluation of BioSoil Demonstration Project Soil Data Analysis. Unknown Journal. Citations: 59, Influential: 2.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/224dcf34f84f0cf2d23cb4142bf1799d27afd89b"
                }
            ],
            "summary": ""
        },
        {
            "query": "Epidemic spreading on activity-driven temporal networks SIR model",
            "papers": [
                {
                    "title": "Bursts of Vertex Activation and Epidemics in Evolving Networks",
                    "abstract": "The dynamic nature of contact patterns creates diverse temporal structures. In particular, empirical studies have shown that contact patterns follow heterogeneous inter-event time intervals, meaning that periods of high activity are followed by long periods of inactivity. To investigate the impact of these heterogeneities in the spread of infection from a theoretical perspective, we propose a stochastic model to generate temporal networks where vertices make instantaneous contacts following heterogeneous inter-event intervals, and may leave and enter the system. We study how these properties affect the prevalence of an infection and estimate , the number of secondary infections of an infectious individual in a completely susceptible population, by modeling simulated infections (SI and SIR) that co-evolve with the network structure. We find that heterogeneous contact patterns cause earlier and larger epidemics in the SIR model in comparison to homogeneous scenarios for a vast range of parameter values, while smaller epidemics may happen in some combinations of parameters. In the case of SI and heterogeneous patterns, the epidemics develop faster in the earlier stages followed by a slowdown in the asymptotic limit. For increasing vertex turnover rates, heterogeneous patterns generally cause higher prevalence in comparison to homogeneous scenarios with the same average inter-event interval. We find that is generally higher for heterogeneous patterns, except for sufficiently large infection duration and transmission probability.",
                    "citation": "Luis E C Rocha, V. Blondel (2013). Bursts of Vertex Activation and Epidemics in Evolving Networks. PLoS Comput. Biol.. Citations: 100, Influential: 5.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A stochastic model to generate temporal networks where vertices make instantaneous contacts following heterogeneous inter-event intervals, and may leave and enter the system is proposed, finding that prevalence is generally higher for heterogeneous patterns, except for sufficiently large infection duration and transmission probability."
                    },
                    "url": "https://www.semanticscholar.org/paper/3aa11453c00146d43c7a64bb3e8ce81efc03624d"
                },
                {
                    "title": "Temporal percolation in activity-driven networks.",
                    "abstract": "We study the temporal percolation properties of temporal networks by taking as a representative example the recently proposed activity-driven-network model [N. Perra et al., Sci. Rep. 2, 469 (2012)]. Building upon an analytical framework based on a mapping to hidden variables networks, we provide expressions for the percolation time Tp marking the onset of a giant connected component in the integrated network. In particular, we consider both the generating function formalism, valid for degree-uncorrelated networks, and the general case of networks with degree correlations. We discuss the different limits of the two approaches, indicating the parameter regions where the correlated threshold collapses onto the uncorrelated case. Our analytical predictions are confirmed by numerical simulations of the model. The temporal percolation concept can be fruitfully applied to study epidemic spreading on temporal networks. We show in particular how the susceptible-infected-removed model on an activity-driven network can be mapped to the percolation problem up to a time given by the spreading rate of the epidemic process. This mapping allows us to obtain additional information on this process, not available for previous approaches.",
                    "citation": "Michele Starnini, R. Pastor-Satorras (2013). Temporal percolation in activity-driven networks.. Physical review. E, Statistical, nonlinear, and soft matter physics. Citations: 49, Influential: 3.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown in particular how the susceptible-infected-removed model on an activity-driven network can be mapped to the percolation problem up to a time given by the spreading rate of the epidemic process."
                    },
                    "url": "https://www.semanticscholar.org/paper/86c35e56746c1477c8c0653bea106da7cd299385"
                },
                {
                    "title": "Contagion dynamics in time-varying metapopulation networks",
                    "abstract": "The metapopulation framework is adopted in a wide array of disciplines to describe systems of well separated yet connected subpopulations. The subgroups or patches are often represented as nodes in a network whose links represent the migration routes among them. The connections have been so far mostly considered as static, but in general evolve in time. Here we address this case by investigating simple contagion processes on time-varying metapopulation networks. We focus on the SIR process and determine analytically the mobility threshold for the onset of an epidemic spreading in the framework of activity-driven network models. We find profound differences from the case of static networks. The threshold is entirely described by the dynamical parameters defining the average number of instantaneously migrating individuals and does not depend on the properties of the static network representation. Remarkably, the diffusion and contagion processes are slower in time-varying graphs than in their aggregated static counterparts, the mobility threshold being even two orders of magnitude larger in the first case. The presented results confirm the importance of considering the time-varying nature of complex networks.",
                    "citation": "Suyu Liu, Andrea Baronchelli, N. Perra (2012). Contagion dynamics in time-varying metapopulation networks. arXiv.org. Citations: 78, Influential: 3.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work focuses on the SIR process and determines analytically the mobility threshold for the onset of an epidemic spreading in the framework of activity-driven network models, and finds profound differences from the case of static networks."
                    },
                    "url": "https://www.semanticscholar.org/paper/98769290b14d1b6cb885d6677ce8fbc5224052b0"
                },
                {
                    "title": "Epidemic spreading and aging in temporal networks with memory",
                    "abstract": "Time-varying network topologies can deeply influence dynamical processes mediated by them. Memory effects in the pattern of interactions among individuals are also known to affect how diffusive and spreading phenomena take place. In this paper we analyze the combined effect of these two ingredients on epidemic dynamics on networks. We study the susceptible-infected-susceptible (SIS) and the susceptible-infected-recovered (SIR) models on the recently introduced activity-driven networks with memory. By means of an activity-based mean-field approach, we derive, in the long-time limit, analytical predictions for the epidemic threshold as a function of the parameters describing the distribution of activities and the strength of the memory effects. Our results show that memory reduces the threshold, which is the same for SIS and SIR dynamics, therefore favoring epidemic spreading. The theoretical approach perfectly agrees with numerical simulations in the long-time asymptotic regime. Strong aging effects are present in the preasymptotic regime and the epidemic threshold is deeply affected by the starting time of the epidemics. We discuss in detail the origin of the model-dependent preasymptotic corrections, whose understanding could potentially allow for epidemic control on correlated temporal networks.",
                    "citation": "Michele Tizzani, Simone Lenti, Enrico Ubaldi, et al. (2018). Epidemic spreading and aging in temporal networks with memory. Physical Review E. Citations: 29, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper derives analytical predictions for the epidemic threshold as a function of the parameters describing the distribution of activities and the strength of the memory effects and shows that memory reduces the threshold, which is the same for SIS and SIR dynamics, therefore favoring epidemic spreading."
                    },
                    "url": "https://www.semanticscholar.org/paper/8dc4dc4d55458e6161ffd9d869237fbd13925922"
                },
                {
                    "title": "Contrasting effects of strong ties on SIR and SIS processes in temporal networks",
                    "abstract": "Most real networks are characterized by connectivity patterns that evolve in time following complex, non-Markovian, dynamics. Here we investigate the impact of this ubiquitous feature by studying the Susceptible-Infected-Recovered (SIR) and Susceptible-Infected-Susceptible (SIS) epidemic models on activity driven networks with and without memory (i.e., Markovian and non-Markovian). We find that memory inhibits the spreading process in SIR models by shifting the epidemic threshold to larger values and reducing the final fraction of recovered nodes. On the contrary, in SIS processes memory reduces the epidemic threshold and, for a wide range of disease parameters, increases the fraction of nodes affected by the disease in the endemic state. The heterogeneity in tie strengths, and the frequent repetition of strong ties it entails, allows in fact less virulent SIS-like diseases to survive in tightly connected local clusters that serve as reservoir for the virus. We validate this picture by studying both processes on two real temporal networks.",
                    "citation": "K. Sun, Andrea Baronchelli, N. Perra (2015). Contrasting effects of strong ties on SIR and SIS processes in temporal networks. Unknown Journal. Citations: 51, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that memory inhibits the spreading process in SIR models by shifting the epidemic threshold to larger values and reducing the final fraction of recovered nodes and, for a wide range of disease parameters, increases the fraction of nodes affected by the disease in the endemic state."
                    },
                    "url": "https://www.semanticscholar.org/paper/b4df33c2c52d143480128114063da6edae2774d3"
                },
                {
                    "title": "Temporal Heterogeneities Increase the Prevalence of Epidemics on Evolving Networks",
                    "abstract": "Empirical studies suggest that contact patterns follow heterogeneous inter-event times, meaning that intervals of high activity are followed by periods of inactivity. Combined with birth and death of individuals, these temporal constraints affect the spread of infections in a non-trivial way and are dependent on the particular contact dynamics. We propose a stochastic model to generate temporal networks where vertices make instantaneous contacts following heterogeneous inter-event times, and leave and enter the system at fixed rates. We study how these temporal properties affect the prevalence of an infection and estimate R0 , the number of secondary infections, by modeling simulated infections (SIR, SI and SIS) co-evolving with the network structure. We find that heterogeneous contact patterns cause earlier and larger epidemics on the SIR model in comparison to homogeneous scenarios. In case of SI and SIS, the epidemics is faster in the early stages (up to 90% of prevalence) followed by a slowdown in the asymptotic limit in case of heterogeneous patterns. In the presence of birth and death, heterogeneous patterns always cause higher prevalence in comparison to homogeneous scenarios with same average inter-event times. Our results suggest that R0 may be underestimated if temporal heterogeneities are not taken into account in the modeling of epidemics. INTRODUCTION Living in society implies that individuals are constantly interacting with each other. Interactions may take different forms, but those involving proximity or direct contact are of special interest because they are potential bridges for propagating infections. Empirical data suggest that contact patterns and consequently the network structure depend on the environment and context of the contacts [1]. The way people find",
                    "citation": "Luis E C Rocha, V. Blondel (2012). Temporal Heterogeneities Increase the Prevalence of Epidemics on Evolving Networks. arXiv.org. Citations: 10, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A stochastic model is proposed to generate temporal networks where vertices make instantaneous contacts following heterogeneous inter-event times, and leave and enter the system at fixed rates, and suggests that R0, the number of secondary infections, may be underestimated if temporal heterogeneities are not taken into account in the modeling of epidemics."
                    },
                    "url": "https://www.semanticscholar.org/paper/e21e3b203e4abd9348c6cdaa44918deb8c59e41c"
                },
                {
                    "title": "Contagion processes on the static and activity driven coupling networks",
                    "abstract": "The evolution of network structure and the spreading of epidemic are common coexistent dynamical processes. In most cases, network structure is treated as either static or time-varying, supposing the whole network is observed in the same time window. In this paper, we consider the epidemics spreading on a network which has both static and time-varying structures. Meanwhile, the time-varying part and the epidemic spreading are supposed to be of the same time scale. We introduce a static and activity-driven coupling (SADC) network model to characterize the coupling between the static (\"strong\") structure and the dynamic (\"weak\") structure. Epidemic thresholds of the SIS and SIR models are studied using the SADC model both analytically and numerically under various coupling strategies, where the strong structure is of homogeneous or heterogeneous degree distribution. Theoretical thresholds obtained from the SADC model can both recover and generalize the classical results in static and time-varying networks. It is demonstrated that a weak structure might make the epidemic threshold low in homogeneous networks but high in heterogeneous cases. Furthermore, we show that the weak structure has a substantive effect on the outbreak of the epidemics. This result might be useful in designing some efficient control strategies for epidemics spreading in networks.",
                    "citation": "Yanjun Lei, Xin Jiang, Quantong Guo, et al. (2015). Contagion processes on the static and activity driven coupling networks. Physical Review E. Citations: 24, Influential: 1.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is demonstrated that a weak structure might make the epidemic threshold low in homogeneous networks but high in heterogeneous cases, and it is shown that the weak structure has a substantive effect on the outbreak of the epidemics."
                    },
                    "url": "https://www.semanticscholar.org/paper/2bd9ee417bfe137588dc8d44cf2292df16c646ae"
                }
            ],
            "summary": ""
        },
        {
            "query": "alpha node activation probability typical values human temporal contact networks activity driven temporal networks parameters",
            "papers": [
                {
                    "title": "Events for: Monday, January -",
                    "abstract": null,
                    "citation": " (2022). Events for: Monday, January -. Unknown Journal. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "An autonomous learning system able to identify action-relevant stimuli without prior knowledge of them, while learning to ignore stimuli that are not behaviorally relevant is introduced, based on ensembles of spiking neurons."
                    },
                    "url": "https://www.semanticscholar.org/paper/b3115477fab93414e1b0be06a9994c69d6a3e319"
                }
            ],
            "summary": ""
        }
    ]
}