{
    "results": [
        {
            "query": "SIR epidemic dynamics temporal networks vs static networks activity-driven models epidemic thresholds outbreak size",
            "papers": [
                {
                    "paper_title": "Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone",
                    "abstract": "Activity-driven networks (ADNs) are a powerful paradigm to study epidemic spreading in temporal networks, where the dynamics of the disease and the evolution of the links share a common time-scale. One of the key assumptions of ADNs is the lack of preferential connections among individuals. This assumption hinders the application of ADNs to several realistic scenarios where some contacts persist in time, rather than intermittently activate. Here, we examine an improved modeling framework that superimposes an ADN to a static backbone network, toward the integration of persistent contacts with time-varying connections. To demonstrate the interplay between the ADN and the static backbone, we investigate the effect of behavioral changes on the disease dynamics. In this framework, each individual may adapt his/her activity as a function of the health status, thereby adjusting the relative weight of time-varying versus static links. To illustrate the approach, we consider two classes of backbone networks, Erdős-Rényi and random regular, and two disease models, SIS and SIR. A general mean-field theory is established for predicting the epidemic threshold, and numerical simulations are conducted to shed light on the role of network parameters on the epidemic spreading and estimate the epidemic size.",
                    "citation": "Matthieu Nadini, A. Rizzo, M. Porfiri (2020). Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone. IEEE Transactions on Network Science and Engineering, 7, 549-561. DOI: 10.1109/TNSE.2018.2885483",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "An improved modeling framework is examined that superimposes an ADN to a static backbone network, toward the integration of persistent contacts with time-varying connections and the effect of behavioral changes on the disease dynamics is investigated."
                    }
                },
                {
                    "paper_title": "A study of epidemic spreading on activity-driven networks",
                    "abstract": "The epidemic spreading was explored on activity-driven networks (ADNs), accounting for the study of dynamics both on and of the ADN. By employing the susceptible-infected-susceptible (SIS) model, two aspects were considered: (1) the infection rate of susceptible agent (depending on the number of its infected neighbors) evolves due to the temporal structure of ADN, rather than being a constant number; (2) the susceptible and infected agents generate unequal links while being activated, namely, the susceptible agent gets few contacts with others in order to protect itself. Results show that, in both cases, the larger epidemic threshold and smaller outbreak size were obtained.",
                    "citation": "Yijiang Zou, Weibing Deng, Wei Li... (2016). A study of epidemic spreading on activity-driven networks. International Journal of Modern Physics C, 27, 1650090. DOI: 10.1142/S012918311650090X",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The epidemic spreading was explored on activity-driven networks (ADNs), accounting for the study of dynamics both on and of the ADN by employing the susceptible-infected-susceptible (SIS) model, showing that the larger epidemic threshold and smaller outbreak size were obtained."
                    }
                },
                {
                    "paper_title": "Impact of temporal connectivity patterns on epidemic process",
                    "abstract": "To provide a comprehensive view for dynamics of and on many real- world temporal networks, we investigate the interplay of temporal connectivity patterns and spreading phenomena, in terms of the susceptible-infected-removed (SIR) model on the modified activity-driven temporal network (ADTN) with memory. In particular, we focus on how the epidemic threshold of the SIR model is affected by the heterogeneity of nodal activities and the memory strength in temporal and static regimes, respectively. While strong ties (memory) between nodes inhibit the spread of epidemic to be localized, the heterogeneity of nodal activities enhances it to be globalized initially. Since the epidemic threshold of the SIR model is very sensitive to the degree distribution of nodes in static networks, we test the SIR model on the modified ADTNs with the possible set of the activity exponents and the memory exponents that generates the same degree distributions in temporal networks. We also discuss the role of spatiotemporal scaling properties of the largest cluster and the maximum degree in the epidemic threshold. It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network. This implies that there is the trade-off between the spreading time of epidemic and its outbreak size. Finally, we suggest the phase diagram of the SIR model on ADTNs and the optimal condition for the spread of epidemic under the circumstances.",
                    "citation": "Hyewon Kim, Meesoon Ha, Hawoong Jeong (2019). Impact of temporal connectivity patterns on epidemic process. The European Physical Journal B, 92. DOI: 10.1140/epjb/e2019-100159-1",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network, which implies that there is the trade-off between the spreading time of epidemic and its outbreak size."
                    }
                },
                {
                    "paper_title": "Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics",
                    "abstract": "Most real networks have been found to evolve dynamically. In addition, heterogeneity of interaction strengths and individual’s memory have been proved to be important to affect network evolution in the area of complex networks. Based on a recent extension of the activity-driven modeling framework, i.e. activity-driven model with attractiveness, where individuals are characterized by their activities and attractiveness, we propose a new temporal network model by considering individuals’ memory. Similar to the previous network model, we also investigate heterogeneous distributions and different correlations between the two variables (activity and attractiveness). By numerical simulations, we illustrate the impact of memory on epidemic spreading processes unfolding on the proposed model. We find that, when individuals’ attractiveness is fixed, memory does not cause dramatic change on the epidemic threshold in the SIR process, but it inhibits the epidemic spreading by reducing the infected ratio. While for the SIS process, in the case of uncorrelated and positive correlations between the two variables, memory facilitates the epidemic outbreaks by shrinking the epidemic threshold. When the two variables are negatively correlated, memory does not take obvious impact on the epidemic threshold. Besides, for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength. It indicates that for the individuals with same activity, more attractive individuals will promote the disease spread. The findings deepen our understanding of the role of individuals’ memory and their attractiveness in the epidemic spreading process.",
                    "citation": "Mei Yang, B. Wang, Yuexing Han (2019). Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics. International Journal of Modern Physics C. DOI: 10.1142/S0129183119500116",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that for the individuals with same activity, more attractive individuals will promote the disease spread, and for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength."
                    }
                },
                {
                    "paper_title": "Simulated Epidemics in an Empirical Spatiotemporal Network of 50,185 Sexual Contacts",
                    "abstract": "Sexual contact patterns, both in their temporal and network structure, can influence the spread of sexually transmitted infections (STI). Most previous literature has focused on effects of network topology; few studies have addressed the role of temporal structure. We simulate disease spread using SI and SIR models on an empirical temporal network of sexual contacts in high-end prostitution. We compare these results with several other approaches, including randomization of the data, classic mean-field approaches, and static network simulations. We observe that epidemic dynamics in this contact structure have well-defined, rather high epidemic thresholds. Temporal effects create a broad distribution of outbreak sizes, even if the per-contact transmission probability is taken to its hypothetical maximum of 100%. In general, we conclude that the temporal correlations of our network accelerate outbreaks, especially in the early phase of the epidemics, while the network topology (apart from the contact-rate distribution) slows them down. We find that the temporal correlations of sexual contacts can significantly change simulated outbreaks in a large empirical sexual network. Thus, temporal structures are needed alongside network topology to fully understand the spread of STIs. On a side note, our simulations further suggest that the specific type of commercial sex we investigate is not a reservoir of major importance for HIV.",
                    "citation": "Luis E C Rocha, F. Liljeros, Petter Holme (2010). Simulated Epidemics in an Empirical Spatiotemporal Network of 50,185 Sexual Contacts. PLoS Computational Biology, 7. DOI: 10.1371/journal.pcbi.1001109",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that the temporal correlations of sexual contacts can significantly change simulated outbreaks in a large empirical sexual network, suggesting that temporal structures are needed alongside network topology to fully understand the spread of STIs."
                    }
                },
                {
                    "paper_title": "Abstract Submitted for the MAR13 Meeting of The American Physical Society Contagion dynamics in time-varying metapopulation networks",
                    "abstract": null,
                    "citation": "N. Perra (2013). Abstract Submitted for the MAR13 Meeting of The American Physical Society Contagion dynamics in time-varying metapopulation networks. . DOI: Unknown",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Network models and transmission of sexually transmitted diseases.",
                    "abstract": "WHEN IT COMES TO DESCRIBING the spread of a sexually transmitted disease (STD), the first and perhaps most important challenge is to conceptualize the pattern of sexual contacts. At least 2 mathematical approaches for modeling sexual behavior have been used and include compartmental analysis and network analysis. Most modelers believe that network structures provide a more realistic description of sexual contacts because heterogeneity in patterns of sexual contact can be explicitly incorporated into network analysis. Recently, Mark Newman developed the mathematical tools to study the spread of diseases on networks,1 and thanks to the work of Schneeberger et al., we now have knowledge about the structure of sexual behavior networks. Having a clear understanding about this structure allows the building of a network of sexual contacts in which the vertices are individuals and edges are the sexual partnerships. This static picture helps us to identify the role of different individuals in spreading disease on the network. More importantly, this framework also allows us to derive important conclusions about the dynamics of disease, including the probability of spread and the size of an outbreak or epidemic should one occur.1–3 By capturing the fundamental underlying mechanisms of disease propagation, network models offer an inexpensive tool to compare different intervention strategies. Mathematical models have progressed dramatically over the past 3 decades.4,5 In the past, lack of reliable data about sexual contacts on a large scale has been an obstacle to having a realistic picture of sexual networks and in the absence of such data, the best assumption was that people could be grouped based on their infection status (eg, susceptible, infected, recovered), their level of sexual activity (eg, core group vs. a less sexually active group), and their demographic profile such as age.6,7 This “coarse-grained” compartmental analysis assumes that every individual has an equal chance of infecting others, which is known as homogeneous mixing. When no accurate data were available, these models provided insight into basic aspects of disease transmission within a population. Although compartmental models can incorporate different sexual activity levels by creating subcompartments, these models fail to capture the inherent heterogeneity of sexual contacts within a population as a result of the limited resolution imposed by homogeneous mixing. Articles appearing in the physics and mathematics literature have recently shown that such heterogeneity has an important impact on how a perturbation (in this case, disease transmission) spreads through a network (in this case, a sexual network). By reporting the analysis of one of the first and certainly the largest database of human sexual contacts to date, Schneeberger et al. have taken an important step in shedding light on the structure of sexual networks. Their analysis helps one to go beyond the “coarse-grained” analysis of compartments and enables one to take into account the heterogeneity that really exists in sexual networks. Also, by comparing different populations and different sexual behaviors, they elegantly demonstrate the impact of differences in individual behavior in different societies on the formation and structure of sexual networks and on disease transmission. The important implication of their analysis is that the best intervention strategy could vary from one social setting to another. Comparison of the National Survey of Sexual Attitudes and Lifestyles in Britain (Natsal) 1990 and 2000 datasets reveals that even for a single community, different interventions could be required at different times. This variability is determined by the transmissibility threshold value, Tc, which is directly related to the parameter , the power law exponent, discussed by Schneeberger et al. Transmissibility T is the average probability that transmission will occur from an infected individual (vertex) to a noninfected one and the transmissibility threshold value, or critical transmissibility Tc, is the transmissibility below which small outbreaks die out and above which small outbreaks could evolve into a full-blown epidemic. Figure 1 illustrates the concept. The horizontal axis represents the entire spectrum of T between 0 and 1. All sexually transmitted pathogens have transmissibility within this range, zero meaning no transmission and 1 meaning every partnership leads to transmission. Thus, any disease can be mapped to a unique value along this axis. The threshold value for the transmissibility in the community A (Fig. 1A) is denoted by Tc . If a disease has a higher Correspondence: Babak Pourbohloul, PHD, Division of Mathematical Modeling, University of British Columbia Centre for Disease Control, 655 West 12th Avenue, Vancouver, British Columbia, V5Z 4R4. E-mail: babak.pourbohloul@bccdc.ca From the Division of Mathematical Modeling, University of British Columbia Centre for Disease Control, Vancouver, British Columbia, Canada Sexually Transmitted Diseases, June 2004, Vol. 31, No. 6, p.388–390 DOI: 10.1097/01.OLQ.0000118425.49522.2C Copyright © 2004, American Sexually Transmitted Diseases Association All rights reserved.",
                    "citation": "B. Pourbohloul, R. Brunham (2004). Network models and transmission of sexually transmitted diseases.. Sexually transmitted diseases, 31 6, \n          388-90\n        . DOI: 10.1097/00007435-200406000-00013",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "By reporting the analysis of one of the first and certainly the largest database of human sexual contacts to date, Schneeberger et al. have taken an important step in shedding light on the structure of sexual networks."
                    }
                }
            ],
            "summary": ""
        }
    ]
}