{
    "results": [
        {
            "query": "Epidemic spreading in activity-driven networks with SIR model",
            "papers": [
                {
                    "paper_title": "Contagion processes on the static and activity driven coupling networks",
                    "abstract": "The evolution of network structure and the spreading of epidemic are common coexistent dynamical processes. In most cases, network structure is treated as either static or time-varying, supposing the whole network is observed in the same time window. In this paper, we consider the epidemics spreading on a network which has both static and time-varying structures. Meanwhile, the time-varying part and the epidemic spreading are supposed to be of the same time scale. We introduce a static and activity-driven coupling (SADC) network model to characterize the coupling between the static (\"strong\") structure and the dynamic (\"weak\") structure. Epidemic thresholds of the SIS and SIR models are studied using the SADC model both analytically and numerically under various coupling strategies, where the strong structure is of homogeneous or heterogeneous degree distribution. Theoretical thresholds obtained from the SADC model can both recover and generalize the classical results in static and time-varying networks. It is demonstrated that a weak structure might make the epidemic threshold low in homogeneous networks but high in heterogeneous cases. Furthermore, we show that the weak structure has a substantive effect on the outbreak of the epidemics. This result might be useful in designing some efficient control strategies for epidemics spreading in networks.",
                    "citation": "Yanjun Lei, Xin Jiang, Quantong Guo... (2015). Contagion processes on the static and activity driven coupling networks. Physical review. E, 93 3, \n          032308\n        . DOI: 10.1103/PhysRevE.93.032308",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is demonstrated that a weak structure might make the epidemic threshold low in homogeneous networks but high in heterogeneous cases, and it is shown that the weak structure has a substantive effect on the outbreak of the epidemics."
                    }
                },
                {
                    "paper_title": "Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics",
                    "abstract": "Most real networks have been found to evolve dynamically. In addition, heterogeneity of interaction strengths and individual’s memory have been proved to be important to affect network evolution in the area of complex networks. Based on a recent extension of the activity-driven modeling framework, i.e. activity-driven model with attractiveness, where individuals are characterized by their activities and attractiveness, we propose a new temporal network model by considering individuals’ memory. Similar to the previous network model, we also investigate heterogeneous distributions and different correlations between the two variables (activity and attractiveness). By numerical simulations, we illustrate the impact of memory on epidemic spreading processes unfolding on the proposed model. We find that, when individuals’ attractiveness is fixed, memory does not cause dramatic change on the epidemic threshold in the SIR process, but it inhibits the epidemic spreading by reducing the infected ratio. While for the SIS process, in the case of uncorrelated and positive correlations between the two variables, memory facilitates the epidemic outbreaks by shrinking the epidemic threshold. When the two variables are negatively correlated, memory does not take obvious impact on the epidemic threshold. Besides, for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength. It indicates that for the individuals with same activity, more attractive individuals will promote the disease spread. The findings deepen our understanding of the role of individuals’ memory and their attractiveness in the epidemic spreading process.",
                    "citation": "Mei Yang, B. Wang, Yuexing Han (2019). Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics. International Journal of Modern Physics C. DOI: 10.1142/S0129183119500116",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that for the individuals with same activity, more attractive individuals will promote the disease spread, and for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength."
                    }
                },
                {
                    "paper_title": "Impact of temporal connectivity patterns on epidemic process",
                    "abstract": "To provide a comprehensive view for dynamics of and on many real- world temporal networks, we investigate the interplay of temporal connectivity patterns and spreading phenomena, in terms of the susceptible-infected-removed (SIR) model on the modified activity-driven temporal network (ADTN) with memory. In particular, we focus on how the epidemic threshold of the SIR model is affected by the heterogeneity of nodal activities and the memory strength in temporal and static regimes, respectively. While strong ties (memory) between nodes inhibit the spread of epidemic to be localized, the heterogeneity of nodal activities enhances it to be globalized initially. Since the epidemic threshold of the SIR model is very sensitive to the degree distribution of nodes in static networks, we test the SIR model on the modified ADTNs with the possible set of the activity exponents and the memory exponents that generates the same degree distributions in temporal networks. We also discuss the role of spatiotemporal scaling properties of the largest cluster and the maximum degree in the epidemic threshold. It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network. This implies that there is the trade-off between the spreading time of epidemic and its outbreak size. Finally, we suggest the phase diagram of the SIR model on ADTNs and the optimal condition for the spread of epidemic under the circumstances.",
                    "citation": "Hyewon Kim, Meesoon Ha, Hawoong Jeong (2019). Impact of temporal connectivity patterns on epidemic process. The European Physical Journal B, 92. DOI: 10.1140/epjb/e2019-100159-1",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network, which implies that there is the trade-off between the spreading time of epidemic and its outbreak size."
                    }
                },
                {
                    "paper_title": "Active and inactive quarantine in epidemic spreading on adaptive activity-driven networks",
                    "abstract": "We consider an epidemic process on adaptive activity-driven temporal networks, with adaptive behavior modeled as a change in activity and attractiveness due to infection. By using a mean-field approach, we derive an analytical estimate of the epidemic threshold for susceptible-infected-susceptible (SIS) and susceptible-infected-recovered (SIR) epidemic models for a general adaptive strategy, which strongly depends on the correlations between activity and attractiveness in the susceptible and infected states. We focus on strong social distancing, implementing two types of quarantine inspired by recent real case studies: an active quarantine, in which the population compensates the loss of links rewiring the ineffective connections towards nonquarantining nodes, and an inactive quarantine, in which the links with quarantined nodes are not rewired. Both strategies feature the same epidemic threshold but they strongly differ in the dynamics of the active phase. We show that the active quarantine is extremely less effective in reducing the impact of the epidemic in the active phase compared to the inactive one and that in the SIR model a late adoption of measures requires inactive quarantine to reach containment.",
                    "citation": "Marco Mancastroppa, R. Burioni, V. Colizza... (2020). Active and inactive quarantine in epidemic spreading on adaptive activity-driven networks. Physical review. E, 102 2-1, \n          020301\n        . DOI: 10.1103/PHYSREVE.102.020301",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown that the active quarantine is extremely less effective in reducing the impact of the epidemic in the active phase compared to the inactive one and that in the SIR model a late adoption of measures requires inactive quarantine to reach containment."
                    }
                },
                {
                    "paper_title": "Epidemic spreading and aging in temporal networks with memory",
                    "abstract": "Time-varying network topologies can deeply influence dynamical processes mediated by them. Memory effects in the pattern of interactions among individuals are also known to affect how diffusive and spreading phenomena take place. In this paper we analyze the combined effect of these two ingredients on epidemic dynamics on networks. We study the susceptible-infected-susceptible (SIS) and the susceptible-infected-recovered (SIR) models on the recently introduced activity-driven networks with memory. By means of an activity-based mean-field approach, we derive, in the long-time limit, analytical predictions for the epidemic threshold as a function of the parameters describing the distribution of activities and the strength of the memory effects. Our results show that memory reduces the threshold, which is the same for SIS and SIR dynamics, therefore favoring epidemic spreading. The theoretical approach perfectly agrees with numerical simulations in the long-time asymptotic regime. Strong aging effects are present in the preasymptotic regime and the epidemic threshold is deeply affected by the starting time of the epidemics. We discuss in detail the origin of the model-dependent preasymptotic corrections, whose understanding could potentially allow for epidemic control on correlated temporal networks.",
                    "citation": "Michele Tizzani, Simone Lenti, Enrico Ubaldi... (2018). Epidemic spreading and aging in temporal networks with memory. Physical Review. E, 98. DOI: 10.1103/PhysRevE.98.062315",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper derives analytical predictions for the epidemic threshold as a function of the parameters describing the distribution of activities and the strength of the memory effects and shows that memory reduces the threshold, which is the same for SIS and SIR dynamics, therefore favoring epidemic spreading."
                    }
                },
                {
                    "paper_title": "Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone",
                    "abstract": "Activity-driven networks (ADNs) are a powerful paradigm to study epidemic spreading in temporal networks, where the dynamics of the disease and the evolution of the links share a common time-scale. One of the key assumptions of ADNs is the lack of preferential connections among individuals. This assumption hinders the application of ADNs to several realistic scenarios where some contacts persist in time, rather than intermittently activate. Here, we examine an improved modeling framework that superimposes an ADN to a static backbone network, toward the integration of persistent contacts with time-varying connections. To demonstrate the interplay between the ADN and the static backbone, we investigate the effect of behavioral changes on the disease dynamics. In this framework, each individual may adapt his/her activity as a function of the health status, thereby adjusting the relative weight of time-varying versus static links. To illustrate the approach, we consider two classes of backbone networks, Erdős-Rényi and random regular, and two disease models, SIS and SIR. A general mean-field theory is established for predicting the epidemic threshold, and numerical simulations are conducted to shed light on the role of network parameters on the epidemic spreading and estimate the epidemic size.",
                    "citation": "Matthieu Nadini, A. Rizzo, M. Porfiri (2020). Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone. IEEE Transactions on Network Science and Engineering, 7, 549-561. DOI: 10.1109/TNSE.2018.2885483",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "An improved modeling framework is examined that superimposes an ADN to a static backbone network, toward the integration of persistent contacts with time-varying connections and the effect of behavioral changes on the disease dynamics is investigated."
                    }
                },
                {
                    "paper_title": "SIR Epidemic Model derived from Spatial Correlation for Worm Propagation in Event-driven Wireless Sensor Network",
                    "abstract": "An event or a physical activity triggers many nodes for sensing the environment in wireless sensor networks for event monitoring applications. These triggered nodes then transmit the sensed data to the control center. To study the virus propagation behavior in event-driven WSNs, sensor coverage which is a quality of service parameter, can be considered in epidemic model design to get more insight. Existing epidemic models have global characteristics when it is considered a realistic behavior of WSNs. In this paper, a comparative analysis is carried out for spatial correlation feature found in sensor nodes based on sensing range. It is extended version of our recent work. We present analysis using Susceptible-Infectious-Recovered (SIR) epidemic model with and without spatial correlation feature. Firstly, we show that the correlated nodes are occurred due to sensing ability for event monitoring applications. These nodes are responsible for transmitting correlated information when an event occurs in the field. A detailed comparative analysis with recent existing SIR epidemic models is presented with results and discussions. A comparison based on basic reproduction number is also discussed. Our Results show the impact of spatial correlation in the behavior of virus spread with time. Comparative study shows the effective use of our model is in designing prevention mechanisms for infection control. It can also be used to study the virus spreading behavior for event-driven scenarios in WSNs .",
                    "citation": "S. K. Chaudhary, R. Shakya, Atul Kumar (2020). SIR Epidemic Model derived from Spatial Correlation for Worm Propagation in Event-driven Wireless Sensor Network. International Journal of Innovative Technology and Exploring Engineering. DOI: 10.35940/ijitee.c7974.019320",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Comparative study shows the effective use of Susceptible-Infectious-Recovered (SIR) epidemic model is in designing prevention mechanisms for infection control and the impact of spatial correlation in the behavior of virus spread with time."
                    }
                }
            ],
            "summary": ""
        },
        {
            "query": "Analytical solution SIR epidemic threshold activity-driven temporal network",
            "papers": [
                {
                    "paper_title": "On a Susceptible-Infected-Susceptible Epidemic Model with Reactive Behavioral Response on Higher-Order Temporal Networks",
                    "abstract": "We characterize the spread of epidemic diseases on higher-order temporal networks to shed light on the impact of large gatherings, where superspreading events occur and pairwise interactions are not sufficient to model the dynamics of infection. We propose a novel analytically-tractable continuous-time formalism for higher-order temporal networks based on the paradigm of activity-driven networks and we study a susceptible–infected–susceptible model spreading on top of it. By using a mean-field approach, we compute the epidemic threshold, characterizing a phase transition between a regime where the system converges to a disease-free equilibrium and one in which all trajectories converge to an endemic equilibrium. Using such a threshold, we quantify the role of higher-order interactions in favoring the spread of epidemic diseases, providing analytical support to restricting large gatherings during an epidemic outbreak. Finally, we incorporate a reactive behavioral response in the network formation process.",
                    "citation": "Lorenzo Zino, Alessandro Rizzo (2024). On a Susceptible-Infected-Susceptible Epidemic Model with Reactive Behavioral Response on Higher-Order Temporal Networks. 2024 IEEE 63rd Conference on Decision and Control (CDC), 3912-3917. DOI: 10.1109/CDC56724.2024.10886121",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Burstiness in activity-driven networks and the epidemic threshold",
                    "abstract": "We study the effect of heterogeneous temporal activations on epidemic spreading in temporal networks. We focus on the susceptible-infected-susceptible model on activity-driven networks with burstiness. By using an activity-based mean-field approach, we derive a closed analytical form for the epidemic threshold for arbitrary activity and inter-event time distributions. We show that, as expected, burstiness lowers the epidemic threshold while its effect on prevalence is twofold. In low-infective systems burstiness raises the average infection probability, while it weakens epidemic spreading for high infectivity. Our results can help clarify the conflicting effects of burstiness reported in the literature. We also discuss the scaling properties at the transition, showing that they are not affected by burstiness.",
                    "citation": "Marco Mancastroppa, A. Vezzani, M. A. Muñoz... (2019). Burstiness in activity-driven networks and the epidemic threshold. Journal of Statistical Mechanics: Theory and Experiment, 2019. DOI: 10.1088/1742-5468/ab16c4",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown that, as expected, burstiness lowers the epidemic threshold while its effect on prevalence is twofold, and in low-infective systems burstiness raises the average infection probability, while it weakens epidemic spreading for high infectivity."
                    }
                },
                {
                    "paper_title": "Epidemic criticality in temporal networks",
                    "abstract": "Analytical studies of network epidemiology almost exclusively focus on the extreme situations where the time scales of network dynamics are well separated (longer or shorter) from that of epidemic propagation. In realistic scenarios, however, these time scales could be similar, which has profound implications for epidemic modeling (e.g., one can no longer reduce the dimensionality of epidemic models). We build a theory for the critical behavior of susceptible-infected-susceptible (SIS) epidemics in the vicinity of the critical threshold on the activity-driven model of temporal networks. We find that the persistence of links in the network leads to increasing recovery rates reducing the threshold. Dynamic correlations (coming from being close to infected nodes increases the likelihood of infection) drive the threshold in the opposite direction. These two counteracting effects make epidemic criticality in temporal networks a remarkably complex phenomenon.",
                    "citation": "Chao-Ran Cai, Yuan-Yuan Nie, P. Holme (2023). Epidemic criticality in temporal networks. Physical Review Research. DOI: 10.1103/PhysRevResearch.6.L022017",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Active and inactive quarantine in epidemic spreading on adaptive activity-driven networks",
                    "abstract": "We consider an epidemic process on adaptive activity-driven temporal networks, with adaptive behavior modeled as a change in activity and attractiveness due to infection. By using a mean-field approach, we derive an analytical estimate of the epidemic threshold for susceptible-infected-susceptible (SIS) and susceptible-infected-recovered (SIR) epidemic models for a general adaptive strategy, which strongly depends on the correlations between activity and attractiveness in the susceptible and infected states. We focus on strong social distancing, implementing two types of quarantine inspired by recent real case studies: an active quarantine, in which the population compensates the loss of links rewiring the ineffective connections towards nonquarantining nodes, and an inactive quarantine, in which the links with quarantined nodes are not rewired. Both strategies feature the same epidemic threshold but they strongly differ in the dynamics of the active phase. We show that the active quarantine is extremely less effective in reducing the impact of the epidemic in the active phase compared to the inactive one and that in the SIR model a late adoption of measures requires inactive quarantine to reach containment.",
                    "citation": "Marco Mancastroppa, R. Burioni, V. Colizza... (2020). Active and inactive quarantine in epidemic spreading on adaptive activity-driven networks. Physical review. E, 102 2-1, \n          020301\n        . DOI: 10.1103/PHYSREVE.102.020301",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown that the active quarantine is extremely less effective in reducing the impact of the epidemic in the active phase compared to the inactive one and that in the SIR model a late adoption of measures requires inactive quarantine to reach containment."
                    }
                },
                {
                    "paper_title": "Epidemic spreading and aging in temporal networks with memory",
                    "abstract": "Time-varying network topologies can deeply influence dynamical processes mediated by them. Memory effects in the pattern of interactions among individuals are also known to affect how diffusive and spreading phenomena take place. In this paper we analyze the combined effect of these two ingredients on epidemic dynamics on networks. We study the susceptible-infected-susceptible (SIS) and the susceptible-infected-recovered (SIR) models on the recently introduced activity-driven networks with memory. By means of an activity-based mean-field approach, we derive, in the long-time limit, analytical predictions for the epidemic threshold as a function of the parameters describing the distribution of activities and the strength of the memory effects. Our results show that memory reduces the threshold, which is the same for SIS and SIR dynamics, therefore favoring epidemic spreading. The theoretical approach perfectly agrees with numerical simulations in the long-time asymptotic regime. Strong aging effects are present in the preasymptotic regime and the epidemic threshold is deeply affected by the starting time of the epidemics. We discuss in detail the origin of the model-dependent preasymptotic corrections, whose understanding could potentially allow for epidemic control on correlated temporal networks.",
                    "citation": "Michele Tizzani, Simone Lenti, Enrico Ubaldi... (2018). Epidemic spreading and aging in temporal networks with memory. Physical Review. E, 98. DOI: 10.1103/PhysRevE.98.062315",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper derives analytical predictions for the epidemic threshold as a function of the parameters describing the distribution of activities and the strength of the memory effects and shows that memory reduces the threshold, which is the same for SIS and SIR dynamics, therefore favoring epidemic spreading."
                    }
                },
                {
                    "paper_title": "Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics",
                    "abstract": "Most real networks have been found to evolve dynamically. In addition, heterogeneity of interaction strengths and individual’s memory have been proved to be important to affect network evolution in the area of complex networks. Based on a recent extension of the activity-driven modeling framework, i.e. activity-driven model with attractiveness, where individuals are characterized by their activities and attractiveness, we propose a new temporal network model by considering individuals’ memory. Similar to the previous network model, we also investigate heterogeneous distributions and different correlations between the two variables (activity and attractiveness). By numerical simulations, we illustrate the impact of memory on epidemic spreading processes unfolding on the proposed model. We find that, when individuals’ attractiveness is fixed, memory does not cause dramatic change on the epidemic threshold in the SIR process, but it inhibits the epidemic spreading by reducing the infected ratio. While for the SIS process, in the case of uncorrelated and positive correlations between the two variables, memory facilitates the epidemic outbreaks by shrinking the epidemic threshold. When the two variables are negatively correlated, memory does not take obvious impact on the epidemic threshold. Besides, for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength. It indicates that for the individuals with same activity, more attractive individuals will promote the disease spread. The findings deepen our understanding of the role of individuals’ memory and their attractiveness in the epidemic spreading process.",
                    "citation": "Mei Yang, B. Wang, Yuexing Han (2019). Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics. International Journal of Modern Physics C. DOI: 10.1142/S0129183119500116",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that for the individuals with same activity, more attractive individuals will promote the disease spread, and for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength."
                    }
                },
                {
                    "paper_title": "Temporal percolation in activity-driven networks.",
                    "abstract": "We study the temporal percolation properties of temporal networks by taking as a representative example the recently proposed activity-driven-network model [N. Perra et al., Sci. Rep. 2, 469 (2012)]. Building upon an analytical framework based on a mapping to hidden variables networks, we provide expressions for the percolation time Tp marking the onset of a giant connected component in the integrated network. In particular, we consider both the generating function formalism, valid for degree-uncorrelated networks, and the general case of networks with degree correlations. We discuss the different limits of the two approaches, indicating the parameter regions where the correlated threshold collapses onto the uncorrelated case. Our analytical predictions are confirmed by numerical simulations of the model. The temporal percolation concept can be fruitfully applied to study epidemic spreading on temporal networks. We show in particular how the susceptible-infected-removed model on an activity-driven network can be mapped to the percolation problem up to a time given by the spreading rate of the epidemic process. This mapping allows us to obtain additional information on this process, not available for previous approaches.",
                    "citation": "Michele Starnini, R. Pastor-Satorras (2013). Temporal percolation in activity-driven networks.. Physical review. E, Statistical, nonlinear, and soft matter physics, 89 3, \n          032807\n        . DOI: 10.1103/PhysRevE.89.032807",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown in particular how the susceptible-infected-removed model on an activity-driven network can be mapped to the percolation problem up to a time given by the spreading rate of the epidemic process."
                    }
                }
            ],
            "summary": ""
        },
        {
            "query": "Comparison SIR model propagation temporal vs static aggregated network",
            "papers": [
                {
                    "paper_title": "TSGCNeXt: Dynamic-Static Multi-Graph Convolution for Efficient Skeleton-Based Action Recognition with Long-term Learning Potential",
                    "abstract": "Skeleton-based action recognition has achieved remarkable results in human action recognition with the development of graph convolutional networks (GCNs). However, the recent works tend to construct complex learning mechanisms with redundant training and exist a bottleneck for long time-series. To solve these problems, we propose the Temporal-Spatio Graph ConvNeXt (TSGCNeXt) to explore efficient learning mechanism of long temporal skeleton sequences. Firstly, a new graph learning mechanism with simple structure, Dynamic-Static Separate Multi-graph Convolution (DS-SMG) is proposed to aggregate features of multiple independent topological graphs and avoid the node information being ignored during dynamic convolution. Next, we construct a graph convolution training acceleration mechanism to optimize the back-propagation computing of dynamic graph learning with 55.08\\% speed-up. Finally, the TSGCNeXt restructure the overall structure of GCN with three Spatio-temporal learning modules,efficiently modeling long temporal features. In comparison with existing previous methods on large-scale datasets NTU RGB+D 60 and 120, TSGCNeXt outperforms on single-stream networks. In addition, with the ema model introduced into the multi-stream fusion, TSGCNeXt achieves SOTA levels. On the cross-subject and cross-set of the NTU 120, accuracies reach 90.22% and 91.74%.",
                    "citation": "Dongjingdin Liu, Pengpeng Chen, Miao Yao... (2023). TSGCNeXt: Dynamic-Static Multi-Graph Convolution for Efficient Skeleton-Based Action Recognition with Long-term Learning Potential. ArXiv, abs/2304.11631. DOI: 10.48550/arXiv.2304.11631",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The Temporal-Spatio Graph ConvneXt (TSGCNeXt) is proposed to explore efficient learning mechanism of long temporal skeleton sequences and achieves SOTA levels on single-stream networks."
                    }
                },
                {
                    "paper_title": "The study of Energy Efficient Techniques for the enhancement of Lifetime of the wireless sensor network",
                    "abstract": null,
                    "citation": " (2020). The study of Energy Efficient Techniques for the enhancement of Lifetime of the wireless sensor network. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The investigation is done to observe that how information gathering will be increased using specially organized wireless sensors for the specific application using the clustered model and its problems."
                    }
                },
                {
                    "paper_title": "The Nineteenth Annual Nebraska Conference for Undergraduate Women in Mathematics AND",
                    "abstract": null,
                    "citation": "Andrea J. Allen (2017). The Nineteenth Annual Nebraska Conference for Undergraduate Women in Mathematics AND. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This research demonstrates the kinetics of the Belousov-Zhabotinskii (BZ) reaction in a closed vessel in the presence of a ferroin indicator and presents a novel two-stage framework for video change-point detection."
                    }
                },
                {
                    "paper_title": "Adaptive scheme to Control Power Aware for PDR in Wireless Sensor Networks",
                    "abstract": "Nowadays Wireless sensor networks playing vital role in all area. Which is used to sense the environmental monitoring, Temperature, Soil erosin etc. Low data delivery efficiency and high energy consumption are the inherent problems in Wireless Sensor Networks. Finding accurate data is more difficult and also it will leads to more expensive to collect all sensor readings. Clustering and prediction techniques, which exploit spatial and temporal correlation among the sensor data, provide opportunities for reducing the energy consumption of continuous sensor data collection and to achieve network energy efficiency and stability. So as we propose Dynamic scheme for energy consumption and data collection in wireless sensor networks by integrating adaptively enabling/disabling prediction scheme, sleep/awake method with dynamic scheme. Our framework is clustering based. A cluster head represents all sensor nodes within the region and collects data values from them. Our framework is general enough to incorporate many advanced features and we show how sleep/awake scheduling can be applied, which takes our framework approach to designing a practical dynamic algorithm for data aggregation, it avoids the need for rampant node-to-node propagation of aggregates, but rather it uses faster and more efficient cluster-to-cluster propagation. To the best of our knowledge, this is the first work adaptively enabling/disabling prediction scheme with dynamic scheme for clustering-based continuous data collection in sensor networks. When a cluster node fails because of energy depletion we need to choose alternative cluster head for that particular region. It will help to achieve less energy consumption. Our proposed models, analysis, and framework are validated via simulation and comparison with Static Cluster method in order to achieve better energy efficiency and PDR.",
                    "citation": "R. Sivaranjini, S. Rajan (2016). Adaptive scheme to Control Power Aware for PDR in Wireless Sensor Networks. Journal of Advances in Chemistry, 12, 4507-4514. DOI: 10.24297/JAC.V12I11.819",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work proposes Dynamic scheme for energy consumption and data collection in wireless sensor networks by integrating adaptively enabling/disabling prediction scheme, sleep/awake method with dynamic scheme for clustering-based continuousData collection in sensor networks."
                    }
                },
                {
                    "paper_title": "Applications of Approximate Learning and Inference for Probabilistic Models",
                    "abstract": "We develop approximate inference and learning methods for facilitating the use of probabilistic modeling techniques motivated by applications in two different areas. First, we consider the ill-posed inverse problem of recovering an image from an underdetermined system of linear measurements corrupted by noise. Second, we consider the problem of inferring user preferences for items from counts, pairwise comparisons and user activity logs, instances of implicit feedback. Plausible models for images and the noise, incurred when recording them, render posterior inference intractable, while the scale of the inference problem makes sampling based approximations ineffective. Therefore, we develop deterministic approximate inference algorithms for two different augmentations of a typical sparse linear model: first, for the rectified-linear Poisson likelihood, and second, for tree-structured super-Gaussian mixture models. The rectified-linear Poisson likelihood is an alternative noise model, applicable in astronomical and biomedical imaging applications, that operate in intensity regimes in which quantum effects lead to observations that are best described by counts of particles arriving at a sensor, as well as in general Poisson regression problems arising in various fields. In this context we show, that the model-specific computations for Expectation Propagation can be robustly solved by a simple dynamic program. Next, we develop a scalable approximate inference algorithm for structured mixture models, that uses a discrete graphical model to represent dependencies between the latent mixture components of a collection of mixture models. Specifically, we use tree-structured mixtures of super-Gaussians to model the persistence across scales of large coefficients of the Wavelet transform of an image for improved reconstruction. In the second part on models of user preference, we consider two settings: the global static and the contextual dynamic setting. In the global static setting, we represent user-item preferences by a latent low-rank matrix. Instead of using numeric ratings we develop methods to infer this latent representation for two types of implicit feedback: aggregate counts of users interacting with a service and the binary outcomes of pairwise comparisons. We model count data using a latent Gaussian bilinear model with Poisson likelihoods. For this model, we show that the Variational Gaussian approximation can be further relaxed to be available in closed-form by adding additional constraints, leading to an efficient inference algorithm. In the second implicit feedback scenario, we infer the latent preference matrix from pairwise preference statements. We combine a low-rank bilinear model with non-parameteric item- feature regression and develop a novel approximate variational Expectation Maximization algorithm that mitigates the computational challenges due to latent couplings induced by the pairwise comparisons. Finally, in the contextual dynamic setting, we model sequences of user activity at the granularity of single interaction events instead of aggregate counts. Routinely gathered in the background at a large scale in many applications, such sequences can reveal temporal and contextual aspects of user behavior through recurrent patterns. To describe such data, we propose a generic collaborative sequence model based on recurrent neural networks, that combines ideas from collaborative filtering and language modeling.",
                    "citation": "Y. Ko (2017). Applications of Approximate Learning and Inference for Probabilistic Models. . DOI: 10.5075/epfl-thesis-7637",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The model-specific computations for Expectation Propagation can be robustly solved by a simple dynamic program and a novel approximate variational Expectation Maximization algorithm is developed that mitigates the computational challenges due to latent couplings induced by the pairwise comparisons."
                    }
                },
                {
                    "paper_title": "Knowledge science, engineering and management : 4th International Conference, KSEM 2010, Belfast, Northern Ireland, UK, September 1-3,2010 : proceedings",
                    "abstract": null,
                    "citation": "Y. Bi, Mary-Anne Williams (2010). Knowledge science, engineering and management : 4th International Conference, KSEM 2010, Belfast, Northern Ireland, UK, September 1-3,2010 : proceedings. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Making Ontology-Based Knowledge and Decision Trees Interact: An Approach to Enrich Knowledge and Increase Expert Confidence in Data-Driven Models is presented."
                    }
                }
            ],
            "summary": ""
        }
    ]
}