{
    "results": [
        {
            "query": "multilayer epidemic networks competing viruses SIS model coexistence dominance",
            "papers": [
                {
                    "paper_title": "Optimal Control of Nonlinear Competitive Epidemic Spreading Processes With Memory in Heterogeneous Networks",
                    "abstract": "Modeling and control of epidemic-like spreading processes, such as contagions, rumors or products in complex networks, holds profound significance for understanding transmission mechanisms, formulating effective prevention and optimizing resource allocation. This paper investigates the optimal control problems for competing processes modeled by fractional-order bi-virus systems with memory in complex networks for the first time. The proposed model performs exceptionally well in capturing the dynamics of virus transmission and immune. First, the key indicators: bi-basic reproduction numbers (BBRNs) are introduced for the metapopulation model with nonlinear infectious functions in heterogenous networks. Then they are utilized to classify the equilibria, including extinction, absolute dominance and coexistence ones. Second, sufficient conditions for the stability of the equilibria are derived. Leveraging this result, an optimal therapeutic protocol is presented to eradicate viruses and minimize the cost function simultaneously. The corresponding optimal control solutions are generated via gradient descent algorithm, which can converge relatively quickly by iteratively adjusting control variables. Particularly, the role of fractional-order $\\alpha$ in system modeling and optimization is deeply probed into. Finally, numerical examples are also included at the end of this paper to further shed light on the effectiveness of our results.",
                    "citation": "Jin You, Yan Li, Xiangyang Cao... (2025). Optimal Control of Nonlinear Competitive Epidemic Spreading Processes With Memory in Heterogeneous Networks. IEEE Transactions on Network Science and Engineering, 12, 96-109. DOI: 10.1109/TNSE.2024.3486279",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The optimal control problems for competing processes modeled by fractional-order bi-virus systems with memory in complex networks with memory in complex networks for the first time are investigated for the first time."
                    }
                },
                {
                    "paper_title": "Convergence of Bi-Virus Epidemic Models With Non-Linear Rates on Networks—A Monotone Dynamical Systems Approach",
                    "abstract": "We study convergence properties of competing epidemic models of the Susceptible-Infected-Susceptible ( $SIS$ ) type. The SIS epidemic model has seen widespread popularity in modelling the spreading dynamics of contagions such as viruses, infectious diseases, or even rumors/opinions over contact networks (graphs). We analyze the case of two such viruses spreading on overlaid graphs, with non-linear rates of infection spread and recovery. We call this the non-linear bi-virus model and, building upon recent results, obtain precise conditions for global convergence of the solutions to a trichotomy of possible outcomes: a virus-free state, a single-virus state, and to a coexistence state. Our techniques are based on the theory of monotone dynamical systems (MDS), in contrast to Lyapunov based techniques that have only seen partial success in determining convergence properties in the setting of competing epidemics. We demonstrate how the existing works have been unsuccessful in characterizing a large subset of the model parameter space for bi-virus epidemics, including all scenarios leading to coexistence of the epidemics. To the best of our knowledge, our results are the first in providing complete convergence analysis for the bi-virus system with non-linear infection and recovery rates on general graphs.",
                    "citation": "Vishwaraj Doshi, Shailaja Mallick, Do Young Eun (2022). Convergence of Bi-Virus Epidemic Models With Non-Linear Rates on Networks—A Monotone Dynamical Systems Approach. IEEE/ACM Transactions on Networking, 31, 1187-1201. DOI: 10.1109/TNET.2022.3213015",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "These results are the first in providing complete convergence analysis for the bi-virus system with non-linear infection and recovery rates on general graphs, and are the best of their knowledge."
                    }
                },
                {
                    "paper_title": "Competitive epidemic spreading over arbitrary multilayer networks.",
                    "abstract": "This study extends the Susceptible-Infected-Susceptible (SIS) epidemic model for single-virus propagation over an arbitrary graph to an Susceptible-Infected by virus 1-Susceptible-Infected by virus 2-Susceptible (SI_{1}SI_{2}S) epidemic model of two exclusive, competitive viruses over a two-layer network with generic structure, where network layers represent the distinct transmission routes of the viruses. We find analytical expressions determining extinction, coexistence, and absolute dominance of the viruses after we introduce the concepts of survival threshold and absolute-dominance threshold. The main outcome of our analysis is the discovery and proof of a region for long-term coexistence of competitive viruses in nontrivial multilayer networks. We show coexistence is impossible if network layers are identical yet possible if network layers are distinct. Not only do we rigorously prove a region of coexistence, but we can quantitate it via interrelation of central nodes across the network layers. Little to no overlapping of the layers' central nodes is the key determinant of coexistence. For example, we show both analytically and numerically that positive correlation of network layers makes it difficult for a virus to survive, while in a network with negatively correlated layers, survival is easier, but total removal of the other virus is more difficult.",
                    "citation": "Faryad Darabi Sahneh, C. Scoglio (2014). Competitive epidemic spreading over arbitrary multilayer networks.. Physical review. E, Statistical, nonlinear, and soft matter physics, 89 6, \n          062817\n        . DOI: 10.1103/PHYSREVE.89.062817",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This study extends the Susceptible-Infected-Susceptible (SIS) epidemic model for single-virus propagation over an arbitrary graph to a model of two exclusive, competitive viruses over a two-layer network with generic structure, where network layers represent the distinct transmission routes of the viruses."
                    }
                },
                {
                    "paper_title": "Competing Epidemics on Graphs - Global Convergence and Coexistence",
                    "abstract": "The dynamics of the spread of contagions such as viruses, infectious diseases or even rumors/opinions over contact networks (graphs) have effectively been captured by the well known Susceptible-Infected-Susceptible (SIS) epidemic model in recent years. When it comes to competition between two such contagions spreading on overlaid graphs, their propagation is captured by so-called bi-virus epidemic models. Analysis of such dynamical systems involve the identification of equilibrium points and its convergence properties, which determine whether either of the viruses dies out, or both survive together. We demonstrate how the existing works are unsuccessful in characterizing a large subset of the model parameter space, including all parameters for which the competitiveness of the bi-virus system is significant enough to attain coexistence of the epidemics. In this paper, we fill in this void and obtain convergence results for the entirety of the model parameter space; giving precise conditions (necessary and sufficient) under which the system globally converges to a trichotomy of possible outcomes: a virus-free state, a single-virus state, and to a coexistence state – the first such result.",
                    "citation": "Vishwaraj Doshi, Shailaja Mallick, Do Young Eun (2021). Competing Epidemics on Graphs - Global Convergence and Coexistence. IEEE INFOCOM 2021 - IEEE Conference on Computer Communications, 1-10. DOI: 10.1109/INFOCOM42981.2021.9488828",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper obtains convergence results for the entirety of the model parameter space, giving precise conditions under which the system globally converges to a trichotomy of possible outcomes: a virus-free state, a single-virus state, and to a coexistence state – the first such result."
                    }
                },
                {
                    "paper_title": "Equilibria analysis of a networked bivirus epidemic model using Poincaré-Hopf and Manifold Theory",
                    "abstract": "This paper considers a deterministic Susceptible-Infected-Susceptible (SIS) networked bivirus epidemic model (termed the bivirus model for short), in which two competing viruses spread through a set of populations (nodes) connected by two graphs, which may be different if the two viruses have different transmission pathways. The networked dynamics can give rise to complex equilibria patterns, and most current results identify conditions on the model parameters for convergence to the healthy equilibrium (where both viruses are extinct) or a boundary equilibrium (where one virus is endemic and the other is extinct). However, there are only limited results on coexistence equilibria (where both viruses are endemic). This paper establishes a set of ``counting'' results which provide lower bounds on the number of coexistence equilibria, and perhaps more importantly, establish properties on the local stability/instability properties of these equilibria. In order to do this, we employ the Poincar\\'e-Hopf Theorem but with significant modifications to overcome several challenges arising from the bivirus system model, such as the fact that the system dynamics do not evolve on a manifold in the typical sense required to apply Poincar\\'e-Hopf Theory. Subsequently, Morse inequalities are used to tighten the counting results, under the reasonable assumption that the bivirus system is a Morse-Smale dynamical system. Numerical examples are provided which demonstrate the presence of multiple attractor equilibria, and multiple coexistence equilibria.",
                    "citation": "B. Anderson, Mengbin Ye (2022). Equilibria analysis of a networked bivirus epidemic model using Poincaré-Hopf and Manifold Theory. SIAM J. Appl. Dyn. Syst., 22, 2856-2889. DOI: 10.1137/22M1529981",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A set of ``counting'' results are established which provide lower bounds on the number of coexistence equilibria, and perhaps more importantly, establish properties on the local stability/instability properties of theseEquilibria."
                    }
                },
                {
                    "paper_title": "The Equilibrium Analysis for Competitive Spreading Over Networks With Mutations",
                    "abstract": "Epidemic models have been used to analyze various spreading phenomena in the population, and usually consider that the spreading object does not change in the spreading process. Yet generally, the virus may evolve due to the influence of environments and medical interventions, or the information may be modified by individuals in networks. In this letter, we investigate the spread of two competing viruses in a network, where one of the viruses can mutate into the other one with a certain probability. Based on the multi-group susceptible-infected-susceptible (SIS) model, a mathematical model is proposed to describe the spread of viruses with mutations. We provide a necessary and sufficient condition for the uniqueness of the zero equilibrium, and the conditions for the existence, uniqueness, and local exponential stability of the coexisting equilibrium. Our results demonstrate that the mutation can affect the spreading ability of the virus and the coexistence of viruses. Moreover, we show the effect of mutation on the proportion of infected individuals by comparing it with the model without mutation.",
                    "citation": "Xue Lin, Qiang Jiao (2024). The Equilibrium Analysis for Competitive Spreading Over Networks With Mutations. IEEE Control Systems Letters, 8, 1709-1714. DOI: 10.1109/LCSYS.2024.3415457",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "May the Best Meme Win!: New Exploration of Competitive Epidemic Spreading over Arbitrary Multi-Layer Networks",
                    "abstract": "This study extends the SIS epidemic model for single virus propagation over an arbitrary graph to an SI1SI2S epidemic model of two exclusive, competitive viruses over a two-layer network with generic structure, where network layers represent the distinct transmission routes of the viruses. We find analytical results determining extinction, mutual exclusion, and coexistence of the viruses by introducing the concepts of survival threshold and winning threshold. Furthermore, we show the possibility of coexistence in SIS-type competitive spreading over multilayer networks. Not only do we rigorously prove a region of coexistence, we quantitate it via interrelation of central nodes across the network layers. Little to no overlapping of layers central nodes is the key determinant of coexistence. Specifically, we show coexistence is impossible if network layers are identical yet possible if the network layers have distinct dominant eigenvectors and node degree vectors. For example, we show both analytically and numerically that positive correlation of network layers makes it difficult for a virus to survive while in a network with negatively correlated layers survival is easier but total removal of the other virus is more difficult. We believe our methodology has great potentials for application to broader classes of multi-pathogen spreading over multi-layer and interconnected networks.",
                    "citation": "F. Sahneh, C. Scoglio (2013). May the Best Meme Win!: New Exploration of Competitive Epidemic Spreading over Arbitrary Multi-Layer Networks. ArXiv, abs/1308.4880. DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This study extends the SIS epidemic model for single virus propagation over an arbitrary graph to an SI1SI2S epidemic model of two exclusive, competitive viruses over a two-layer network with generic structure, where network layers represent the distinct transmission routes of the viruses."
                    }
                }
            ],
            "summary": ""
        }
    ]
}