{
    "results": [
        {
            "query": "coexistence competitive SIS model multiplex multilayer",
            "papers": [
                {
                    "paper_title": "Competitive exclusion and coexistence phenomena of a two-strain SIS model on complex networks from global perspectives",
                    "abstract": "Genetic heterogeneity plays an important role in exploring the interplays of microorganisms. Competitive exclusion principle is the main principle that governs causative agentries of diseases competition. Identifying coexistence mechanisms is a core issue for studying the interactions of multi-strains. In this paper, we are concerned with the dynamics of a two-strain SIS epidemic model with general incidence rate on complex networks. We derive the basic reproduction numbers and the invasion reproduction numbers associated with each strain, which determine the competitive, exclusion and coexistence of the two strains. We strictly prove that the competitive exclusion principle holds in a global sense and the endemic equilibrium coexists uniquely and globally. Numerical examples visibly illustrate the evolution of the two strains.",
                    "citation": "Xiaoyan Wang, Junyuan Yang, Xiao-feng Luo (2022). Competitive exclusion and coexistence phenomena of a two-strain SIS model on complex networks from global perspectives. Journal of Applied Mathematics & Computing, 68, 4415 - 4433. DOI: 10.1007/s12190-022-01712-3",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "A Discrete-Time Networked Competitive Bivirus SIS Model",
                    "abstract": "The paper deals with the analysis of a discrete-time networked competitive bivirus susceptible-infected-susceptible (SIS) model. More specifically, we suppose that virus 1 and virus 2 are circulating in the population and are in competition with each other. We show that the model is strongly monotone, and that, under certain assumptions, it does not admit any periodic orbit. We identify a sufficient condition for exponential convergence to the disease-free equilibrium (DFE). Assuming only virus 1 (resp. virus 2) is alive, we establish a condition for global asymptotic convergence to the single-virus endemic equilibrium of virus 1 (resp. virus 2) - our proof does not rely on the construction of a Lyapunov function. Assuming both virus 1 and virus 2 are alive, we establish a condition which ensures local exponential convergence to the single-virus equilibrium of virus 1 (resp. virus 2). Finally, we provide a sufficient (resp. necessary) condition for the existence of a coexistence equilibrium.",
                    "citation": "S. Gracy, Ji Liu, T. Başar... (2023). A Discrete-Time Networked Competitive Bivirus SIS Model. 2024 European Control Conference (ECC), 3398-3403. DOI: 10.23919/ECC64448.2024.10591154",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The model is strongly monotone, and that, under certain assumptions, it does not admit any periodic orbit, and a sufficient condition for exponential convergence to the disease-free equilibrium (DFE) is identified."
                    }
                },
                {
                    "paper_title": "Coexistence and competitive exclusion in an SIS model with standard incidence and diffusion",
                    "abstract": "This paper investigates a two strain SIS model with diffusion, spatially heterogeneous coefficients of the reaction part and distinct diffusion rates of the separate epidemiological classes. First, it is shown that the model has bounded classical solutions. Next, it is established that the model with spatially homogeneous coefficients leads to competitive exclusion and no coexistence is possible in this case. Furthermore, it is proved that if the invasion number of strain $j$ is larger than one, then the equilibrium of strain $i$ is unstable; if, on the other hand, the invasion number of strain $j$ is smaller than one, then the equilibrium of strain $i$ is neutrally stable. In the case when all diffusion rates are equal, global results on competitive exclusion and coexistence of the strains are established. Finally, evolution of dispersal scenario is considered and it is shown that the equilibrium of the strain with the larger diffusion rate is unstable. Simulations suggest that in this case the equilibrium of the strain with the smaller diffusion rate is stable.",
                    "citation": "Yixiang Wu, N. Tuncer, M. Martcheva (2016). Coexistence and competitive exclusion in an SIS model with standard incidence and diffusion. Discrete and Continuous Dynamical Systems-series B, 22, 1167-1187. DOI: 10.3934/DCDSB.2017057",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Towards Understanding the Endemic Behavior of a Competitive Tri-Virus SIS Networked Model",
                    "abstract": "This paper studies the endemic behavior of a multi-competitive networked susceptible-infected-susceptible (SIS) model. Specifically, the paper deals with three competing virus systems (i.e., tri-virus systems). First, we show that a tri-virus system, unlike a bi-virus system, is not a monotone dynamical system. Using the Parametric Transversality Theorem, we show that, generically, a tri-virus system has a finite number of equilibria and that the Jacobian matrices associated with each equilibrium are nonsingular. The endemic equilibria of this system can be classified as follows: a) single-virus endemic equilibria (also referred to as the boundary equilibria), where precisely one of the three viruses is alive; b) 2-coexistence equilibria, where exactly two of the three viruses are alive; and c) 3-coexistence equilibria, where all three viruses survive in the network. We provide a necessary and sufficient condition that guarantees local exponential convergence to a boundary equilibrium. Further, we secure conditions for the nonexistence of 3-coexistence equilibria (resp. for various forms of 2-coexistence equilibria). We also identify sufficient conditions for the existence of a 2-coexistence (resp. 3-coexistence) equilibrium. We identify conditions on the model parameters that give rise to a continuum of coexistence equilibria. More specifically, we establish i) a scenario that admits the existence and local exponential attractivity of a line of coexistence equilibria; and ii) scenarios that admit the existence of, and, in the case of one such scenario, global convergence to, a plane of 3-coexistence equilibria.",
                    "citation": "S. Gracy, Mengbin Ye, B. Anderson... (2023). Towards Understanding the Endemic Behavior of a Competitive Tri-Virus SIS Networked Model. ArXiv, abs/2303.16457. DOI: 10.1137/23M1563074",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Competitive Networked Bivirus SIS Spread Over Hypergraphs",
                    "abstract": "The paper deals with the spread of two competing viruses over a network of population nodes, accounting for pair-wise interactions and higher-order interactions (HOI) within and between the population nodes. We study the competitive networked bivirus susceptible-infected-susceptible (SIS) model on a hypergraph introduced in Cui et al. [1]. We show that the system has, in a generic sense, a finite number of equilibria, and the Jacobian associated with each equilibrium point is nonsingular; the key tool is the Parametric Transver-sality Theorem of differential topology. Since the system is also monotone, it turns out that the typical behavior of the system is convergence to some equilibrium point. Thereafter, we exhibit a tri-stable domain with three locally exponentially stable equilibria. For different parameter regimes, we establish conditions for the existence of a coexistence equilibrium (both viruses infect separate fractions of each population node).",
                    "citation": "S. Gracy, Brian D. Anderson, Mengbin Ye... (2023). Competitive Networked Bivirus SIS Spread Over Hypergraphs. 2024 American Control Conference (ACC), 4409-4415. DOI: 10.23919/ACC60939.2024.10644646",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Competitive dual-strain SIS epidemiological models with awareness programs in heterogeneous networks: two modeling approaches",
                    "abstract": null,
                    "citation": "Mengfeng Sun, Xinchu Fu (2023). Competitive dual-strain SIS epidemiological models with awareness programs in heterogeneous networks: two modeling approaches. Journal of Mathematical Biology, 87, 1-39. DOI: 10.1007/s00285-023-01945-1",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The numerical results suggest that the spread of a two-strain epidemic can be controlled by taking the measures of enhancing awareness transmission, reducing memory fading of aware individuals and ensuring high-level influx and rapid growth of awareness programs appropriately."
                    }
                },
                {
                    "paper_title": "Competitive Coexistence in a Two-Strain Epidemic Model with a Periodic Infection Rate",
                    "abstract": "In this article, we study the global dynamical behavior of a two-strain SIS model with a periodic infection rate. The positivity and boundedness of solutions are established, and the competitive exclusion conditions are given for the model. The conditions for the global stability of the disease-free equilibrium and persistence of the model are obtained. The conditions of coexistence in this model are also found. Finally, the conditions of uniqueness of the solution are proved.",
                    "citation": "Chentong Li, Yingying Zhang, Yicang Zhou (2020). Competitive Coexistence in a Two-Strain Epidemic Model with a Periodic Infection Rate. Discrete Dynamics in Nature and Society, 2020, 1-10. DOI: 10.1155/2020/7541861",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The positivity and boundedness of solutions are established, and the competitive exclusion conditions are given for the model and the conditions of uniqueness of the solution are proved."
                    }
                }
            ],
            "summary": "Based on the literature provided regarding competitive coexistence and exclusion in multi-strain/multi-virus SIS epidemic models on complex networks, including multiplex and multilayer frameworks, the following synthesis and key findings emerge:\n\n---\n\n### 1. **Competitive Exclusion vs. Coexistence in Multi-Strain SIS Models**\n\nThe classical competitive exclusion principle states that in a shared environment, multiple competing strains/viruses generally cannot coexist stably; the strain with the higher reproduction/invasion potential dominates and excludes others. Several papers confirm this principle under various modeling frameworks:\n\n- **Wang et al. (2022)** rigorously prove that for a two-strain SIS model on complex networks with general incidence functions, the competitive exclusion principle holds globally, i.e., only one strain survives in the long run except in specific coexistence equilibria that are unique and globally stable (Wang et al. 2022, *J Appl Math Comput*). The derivation and analysis rely on basic and invasion reproduction numbers.\n\n- **Wu et al. (2016)** study diffusion and spatial heterogeneity in a two-strain SIS model and find that with spatially homogeneous coefficients, coexistence is impossible, retaining competitive exclusion. However, interestingly, when diffusion rates differ, the strain with a slower diffusion rate can stabilize while the faster diffuser's equilibrium becomes unstable, suggesting a spatial dispersal mechanism modulating competitive outcomes (Wu et al. 2016, *DCDSB*).\n\n- **Li et al. (2020)** extend to periodic infection rates and identify coexistence conditions, showing that temporal heterogeneity (periodic forcing) can induce coexistence in two-strain SIS models, beyond classical exclusion scenarios (Li et al. 2020, *Discrete Dyn Nat Soc*).\n\n- **Sun and Fu (2023)** explore two-strain SIS models incorporating awareness programs on heterogeneous networks, implying control measures and network heterogeneity as factors influencing competition and coexistence dynamics, though the abstract was not provided for details.\n\n---\n\n### 2. **Effects of Network Structure and Higher-Order Interactions (Multilayer/Multiplex)**\n\n- **Gracy et al. (2023 ECC; 2023 ACC)** provide analysis of competitive bivirus SIS models over networks and hypergraphs (which capture higher-order interactions beyond pairwise). These studies show that:\n\n  - The system is strongly monotone and generically admits finitely many equilibria with nonsingular Jacobians, facilitating stability analyses.\n\n  - The models admit coexistence equilibria under specified parameter regimes, meaning that network structure, especially multilayer and higher-order interactions, facilitate stable coexistence states not predicted by classical pairwise models.\n\n  - They also identify tristability regions where multiple stable equilibria coexist, including coexistence of viruses infecting distinct fractions of nodes (Gracy et al. 2023 ECC; Gracy et al. 2023 ACC).\n\n- **Gracy et al. (2023 tri-virus model)** extend this to tri-virus competitive SIS models, showing that unlike bi-virus systems, tri-virus SIS systems lack monotonicity, resulting in richer behavior including existence of 2- and 3-coexistence equilibria, lines and planes of coexistence equilibria, and complex stability landscapes. This highlights that an increasing number of competing strains on networks and multilayer structures can lead to stable coexistence phenomena beyond classical exclusion (Gracy et al. 2023, *ArXiv*).\n\n---\n\n### 3. **Key Mathematical Tools and Metrics**\n\n- **Basic reproduction numbers (\\( R_0 \\)) and invasion reproduction numbers** are central to characterizing persistence, exclusive dominance, or coexistence states (Wang et al. 2022; Wu et al. 2016).\n\n- **Monotone dynamical system theory** and **Parametric Transversality Theorem** enable rigorous classification of equilibria and guarantee finiteness and nondegeneracy in the solution structure, aiding global dynamics characterization (Gracy et al. 2023 papers).\n\n- **Diffusion terms and spatial heterogeneity** introduce additional complexity and may stabilize coexistence in spatially continuous settings (Wu et al. 2016).\n\n---\n\n### 4. **Summary of Findings Relevant to Multiplex/Multilayer Competitive SIS Models**\n\n- **Competitive exclusion holds generally in well-mixed or homogeneous network SIS two-strain models**, but spatial heterogeneity, diffusion, temporal periodicity, and awareness programs can enable coexistence.\n\n- **Network structure, particularly higher-order interactions and multilayer/hypergraph models, accommodates stable coexistence and multistability**, by allowing viruses to infect different node fractions or leverage varying interaction patterns.\n\n- **Adding more virus strains (e.g., tri-virus models) significantly increases dynamical complexity**, including non-monotonicity and continuum of coexistence equilibria.\n\n- **Coexistence conditions depend critically on reproduction numbers, invasion thresholds, diffusion coefficients, and coupling structures in multilayer networks**, showing the interplay of epidemiological parameters and network topology.\n\n---\n\n### References\n\n1. Wang X., Yang J., Luo X.-F. (2022). Competitive exclusion and coexistence phenomena of a two-strain SIS model on complex networks from global perspectives. *Journal of Applied Mathematics & Computing*, 68, 4415-4433. DOI: 10.1007/s12190-022-01712-3\n\n2. Gracy S., Liu J., Başar T. (2023). A Discrete-Time Networked Competitive Bivirus SIS Model. *2024 European Control Conference*, 3398-3403. DOI: 10.23919/ECC64448.2024.10591154\n\n3. Wu Y., Tuncer N., Martcheva M. (2016). Coexistence and competitive exclusion in an SIS model with standard incidence and diffusion. *Discrete and Continuous Dynamical Systems-Series B*, 22, 1167-1187. DOI: 10.3934/DCDSB.2017057\n\n4. Gracy S., Ye M., Anderson B. (2023). Towards Understanding the Endemic Behavior of a Competitive Tri-Virus SIS Networked Model. *ArXiv*, abs/2303.16457. DOI: 10.1137/23M1563074\n\n5. Gracy S., Anderson B. D., Ye M. (2023). Competitive Networked Bivirus SIS Spread Over Hypergraphs. *2024 American Control Conference*, 4409-4415. DOI: 10.23919/ACC60939.2024.10644646\n\n6. Sun M., Fu X. (2023). Competitive dual-strain SIS epidemiological models with awareness programs in heterogeneous networks: two modeling approaches. *Journal of Mathematical Biology*, 87, 1-39. DOI: 10.1007/s00285-023-01945-1\n\n7. Li C., Zhang Y., Zhou Y. (2020). Competitive Coexistence in a Two-Strain Epidemic Model with a Periodic Infection Rate. *Discrete Dynamics in Nature and Society*, 2020. DOI: 10.1155/2020/7541861\n\n---\n\n### Concluding Remarks\n\nThe competitive coexistence of strains or viruses in SIS epidemic models on multiplex or multilayer networks is a nuanced phenomenon. While classical theories predict competitive exclusion, advanced modeling incorporating network topology, diffusion, higher-order interactions, and temporal-spatial heterogeneities demonstrate that stable coexistence equilibria and multistability are not only possible but structurally and mathematically robust under broad conditions. These insights have important implications for understanding multi-strain epidemics and controlling infectious diseases in complex interconnected populations.\n\n---\n\nIf you have any specific questions about any aspect of these models or require detailed explanations of mechanisms or mathematical conditions, please let me know!"
        },
        {
            "query": "network topology effects on epidemic competition multiplex",
            "papers": [
                {
                    "paper_title": "Community Size Effects on Epidemic Spreading in Multiplex Social Networks",
                    "abstract": "The dynamical process of epidemic spreading has drawn much attention of the complex network community. In the network paradigm, diseases spread from one person to another through the social ties amongst the population. There are a variety of factors that govern the processes of disease spreading on the networks. A common but not negligible factor is people’s reaction to the outbreak of epidemics. Such reaction can be related information dissemination or self-protection. In this work, we explore the interactions between disease spreading and population response in terms of information diffusion and individuals’ alertness. We model the system by mapping multiplex networks into two-layer networks and incorporating individuals’ risk awareness, on the assumption that their response to the disease spreading depends on the size of the community they belong to. By comparing the final incidence of diseases in multiplex networks, we find that there is considerable mitigation of diseases spreading for full phase of spreading speed when individuals’ protection responses are introduced. Interestingly, the degree of community overlap between the two layers is found to be critical factor that affects the final incidence. We also analyze the consequences of the epidemic incidence in communities with different sizes and the impacts of community overlap between two layers. Specifically, as the diseases information makes individuals alert and take measures to prevent the diseases, the effective protection is more striking in small community. These phenomena can be explained by the multiplexity of the networked system and the competition between two spreading processes.",
                    "citation": "Ting Liu, Ping Li, Yan Chen... (2016). Community Size Effects on Epidemic Spreading in Multiplex Social Networks. PLoS ONE, 11. DOI: 10.1371/journal.pone.0152021",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work model the system by mapping multiplex networks into two-layer networks and incorporating individuals’ risk awareness, on the assumption that their response to the disease spreading depends on the size of the community they belong to, and finds that there is considerable mitigation of diseases spreading for full phase of spreading speed when individual’ protection responses are introduced."
                    }
                },
                {
                    "paper_title": "The Effects of Diffusion of Information on Epidemic Spread - A Multilayer Approach",
                    "abstract": "In this work, the aim is to study the spread of a contagious disease and information on a multilayer social system. The main idea is to find a criterion under which the adoption of the spreading information blocks or suppresses the epidemic spread. A two-layer network is the base of the model. The first layer describes the direct contact interactions, while the second layer is the information propagation layer. Both layers consist of the same nodes. The society consists of five different categories of individuals: susceptibles, infective, recovered, vaccinated and precautioned. Initially, only one infected individual starts transmitting the infection. Direct contact interactions spread the infection to the susceptibles. The information spreads through the second layer. The SIR model is employed for the infection spread, while the Bass equation models the adoption of information. The control parameters of the competition between the spread of information and spread of disease are the topology and the density of connectivity. The topology of the information layer is a scale-free network with increasing density of edges. In the contact layer, regular and scale-free networks with the same average degree per node are used interchangeably. The observation is that increasing complexity of the contact network reduces the role of individual awareness. If the contact layer consists of networks with limited range connections, or the edges sparser than the information network, spread of information plays a significant role in controlling the epidemics.",
                    "citation": "S. Gündüç (2021). The Effects of Diffusion of Information on Epidemic Spread - A Multilayer Approach. ArXiv, abs/2103.07713. DOI: 10.5506/APhysPolB.50.179",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The main idea is to find a criterion under which the adoption of the spreading information blocks or suppresses the epidemic spread, to study the spread of a contagious disease and information on a multilayer social system."
                    }
                },
                {
                    "paper_title": "A New Coupled Awareness-Epidemic Spreading Model with Neighbor Behavior on Multiplex Networks",
                    "abstract": "In this paper, we propose a nonlinear coupled model to study the two interacting processes of awareness diffusion and epidemic spreading on the same individual who is affected by different neighbor behavior status on multiplex networks. We achieve this topology scenario by two kinds of factors, one is the perception factor that can change interplay between different layers of networks and the other is the neighbors’ behavior status that can change the infection rate in each layer. According to the microscopic Markov chain approach (MMCA), we analyze the dynamical evolution of the system and derive the theoretical epidemic threshold on uncorrelated heterogeneous networks, and then, we validate the analysis by numerical simulation and discuss the final size of awareness diffusion and epidemic spreading on a scale-free network. With the outbreak of COVID-19, the spread of epidemic in China prompted drastic measures for transmission containment. We examine the effects of these interventions based on modeling of the awareness-epidemic and the COVID-19 epidemic case. The results further demonstrate that the epidemic spreading can be affected by the effective transmission rate of the awareness and neighbors’ behavior status.",
                    "citation": "Chao Zuo, Anjing Wang, Fenping Zhu... (2021). A New Coupled Awareness-Epidemic Spreading Model with Neighbor Behavior on Multiplex Networks. Complex., 2021, 6680135:1-6680135:14. DOI: 10.1155/2021/6680135",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A nonlinear coupled model to study the two interacting processes of awareness diffusion and epidemic spreading on the same individual who is affected by different neighbor behavior status on multiplex networks demonstrates that the epidemic spreading can be affected by the effective transmission rate of the awareness and neighbors’ behavior status."
                    }
                },
                {
                    "paper_title": "Nontrivial epidemic dynamics induced by information-driven awareness-activity-resource coevolution.",
                    "abstract": "During epidemic outbreaks, information dissemination plays a pivotal role in shaping individual perceptions, which in turn influence contact behavior and resource acquisition, collectively determining infection risk. To capture this intricate interplay, we propose a comprehensive coevolutionary dynamics model that integrates information, awareness, activity, resources, and epidemic within a multiplex network framework. Through the development of a theoretical analysis coupled with extensive numerical verifications, we uncover the nonmonotonic effects of information dissemination on epidemic dynamics. Paradoxically, excessive information flow can intensify resource competition among individuals, leading to inefficient allocation and ultimately exacerbating the epidemic. Our findings highlight the importance of optimized resource allocation, showing that moderately prioritizing aware individuals with resources can effectively reduce infection rates, especially as information dissemination increases. Additionally, we explore the optimal balance between information dissemination and resource allocation, emphasizing its strong dependence on resource availability, while activity frequency experts a comparatively minor impact. This study advances the modeling of epidemic dynamics, providing valuable insights and practical strategies for effective epidemic management and control.",
                    "citation": "Jie Chen, Yantao Zhang, Maobin Hu... (2025). Nontrivial epidemic dynamics induced by information-driven awareness-activity-resource coevolution.. Physical review. E, 111 4-1, \n          044301\n        . DOI: 10.1103/physreve.111.044301",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This study proposes a comprehensive coevolutionary dynamics model that integrates information, awareness, activity, resources, and epidemic within a multiplex network framework, and explores the optimal balance between information dissemination and resource allocation."
                    }
                },
                {
                    "paper_title": "Opinion competition dynamics on multiplex networks",
                    "abstract": "Multilayer and multiplex networks represent a good proxy for the description of social phenomena where social structure is important and can have different origins. Here, we propose a model of opinion competition where individuals are organized according to two different structures in two layers. Agents exchange opinions according to the Abrams–Strogatz model in each layer separately and opinions can be copied across layers by the same individual. In each layer a different opinion is dominant, so each layer has a different absorbing state. Consensus in one opinion is not the only possible stable solution because of the interaction between the two layers. A new mean field solution has been found where both opinions coexist. In a finite system there is a long transient time for the dynamical coexistence of both opinions. However, the system ends in a consensus state due to finite size effects. We analyze sparse topologies in the two layers and the existence of positive correlations between them, which enables the coexistence of inter-layer groups of agents sharing the same opinion.",
                    "citation": "R. Amato, N. Kouvaris, M. S. Miguel... (2017). Opinion competition dynamics on multiplex networks. New Journal of Physics, 19. DOI: 10.1088/1367-2630/aa936a",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A model of opinion competition where individuals are organized according to two different structures in two layers and the existence of positive correlations between them enables the coexistence of inter-layer groups of agents sharing the same opinion is proposed."
                    }
                },
                {
                    "paper_title": "Opinion competition dynamics on multiplex networks",
                    "abstract": null,
                    "citation": "RAmato, N. EKouvaris, andADíaz-Guilera (2017). Opinion competition dynamics on multiplex networks. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A model of opinion competition where individuals are organized according to two different structures in two layers and the existence of positive correlations between them enables the coexistence of inter-layer groups of agents sharing the same opinion is proposed."
                    }
                },
                {
                    "paper_title": "Competing spreading processes on multiplex networks: awareness and epidemics",
                    "abstract": "Epidemiclike spreading processes on top of multilayered interconnected complex networks reveal a rich phase diagram of intertwined competition effects. A recent study by the authors [C. Granell et al., Phys. Rev. Lett. 111, 128701 (2013).] presented an analysis of the interrelation between two processes accounting for the spreading of an epidemic, and the spreading of information awareness to prevent infection, on top of multiplex networks. The results in the case in which awareness implies total immunization to the disease revealed the existence of a metacritical point at which the critical onset of the epidemics starts, depending on completion of the awareness process. Here we present a full analysis of these critical properties in the more general scenario where the awareness spreading does not imply total immunization, and where infection does not imply immediate awareness of it. We find the critical relation between the two competing processes for a wide spectrum of parameters representing the interaction between them. We also analyze the consequences of a massive broadcast of awareness (mass media) on the final outcome of the epidemic incidence. Importantly enough, the mass media make the metacritical point disappear. The results reveal that the main finding, i.e., existence of a metacritical point, is rooted in the competition principle and holds for a large set of scenarios.",
                    "citation": "C. Granell, S. Gómez, A. Arenas (2014). Competing spreading processes on multiplex networks: awareness and epidemics. Physical review. E, Statistical, nonlinear, and soft matter physics, 90 1, \n          012808\n        . DOI: 10.1103/PhysRevE.90.012808",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The main finding is the existence of a metacritical point, rooted in the competition principle and holds for a large set of scenarios where the awareness spreading does not imply total immunization, and where infectiondoes not imply immediate awareness of it."
                    }
                }
            ],
            "summary": "Based on a comprehensive review and reflection on the provided literature regarding network topology effects on epidemic competition in multiplex networks, the following scientific synthesis is presented:\n\n---\n\n### Summary of Key Findings on Network Topology Effects on Epidemic Competition in Multiplex Networks\n\n#### 1. Multiplex Network Structure and Epidemic Spreading\nMost studies model epidemic spreading and information or awareness diffusion as coupled or competing processes on **multiplex networks**, where nodes represent individuals, and different layers represent distinct types of interactions (e.g., physical contacts vs. information channels).\n\n- **Topology of Layers**: The epidemic layer typically models direct physical contacts (often scale-free or regular networks), while the information layer is often scale-free with varying connectivity density ([Gündüç, 2021](#ref2), [Granell et al., 2014](#ref7)).\n- **Community Structure and Overlap**: Community size and the degree of **community overlap** between layers significantly affect the epidemic outcomes. Smaller communities show more effective protection due to alertness facilitated by information diffusion, while higher overlap helps synchronize responses leading to mitigation ([Liu et al., 2016](#ref1)).\n\n#### 2. Competition and Coupling Between Disease and Awareness Processes\n- The interplay between **epidemic spreading** (SIR-type models) and **information or awareness diffusion** (modeled by Bass or SI-like models) leads to complex dynamics.\n- Awareness diffusion generally **mitigates epidemic spread**, but the effectiveness depends strongly on the underlying topology:\n  - When the contact network is more complex (e.g., scale-free with hubs), individual awareness has reduced impact.\n  - Sparse connections or limited-range contacts allow information to suppress epidemics more effectively ([Gündüç, 2021](#ref2)).\n- Awareness spreading not always implies complete immunization; partial awareness introduces a **metacritical point** governing epidemic onset ([Granell et al., 2014](#ref7)).\n\n#### 3. Influence of Neighbor Behavior and Perception Factors\n- Incorporating neighbor behavior and individual perception factors modulates infection rates dynamically across layers:\n  - Infection probability is influenced by neighbors’ awareness status, producing nonlinear coupled dynamics on multiplex networks ([Zuo et al., 2021](#ref3)).\n- This layer of complexity is particularly pertinent for real-world epidemics such as COVID-19, where neighbor behavior and risk perception significantly affected transmission.\n\n#### 4. Resource Allocation and Information-Driven Coevolution\n- Epidemic dynamics are further complicated by coevolution processes including resource acquisition, activity patterns, and awareness.\n- Excessive information dissemination can paradoxically worsen epidemics due to over-competition for limited resources, leading to inefficient resource allocation.\n- Optimal strategies prioritize resource allocation to aware individuals to control infection effectively ([Chen et al., 2025](#ref4)).\n\n#### 5. Network Correlations and Opinion/Behavior Competition\n- Opinion competition models on multiplex networks, which share similar topological considerations, indicate that:\n  - Positive inter-layer correlations and sparse topologies favor coexistence of competing states (opinions or behaviors).\n  - The competition leads to long transient states with coexistence before eventual consensus, which mirrors real epidemic vs. awareness competition dynamics ([Amato et al., 2017](#ref5)).\n\n---\n\n### Scientific Conclusions\n\n**1. Network topology, especially the multiplex nature and inter-layer correlations, critically shapes epidemic competition dynamics.**  \n- Overlapping communities amplify the effect of awareness, permitting localized epidemic control.  \n- Sparse and limited-range contact topologies increase effectiveness of awareness diffusion.\n\n**2. The competition between epidemic spread and awareness processes exhibits metacritical behavior.**  \n- A threshold (metacritical point) is controlled both by epidemic parameters and network topology; altering the network layers or introducing mass media can modify or eliminate this threshold.\n\n**3. Individual-level behavioral factors mediated by neighbor states and perception modulate infection risk dynamically, enabling more nuanced modeling and predictions.**\n\n**4. Nontrivial dynamical outcomes emerge due to resource competition driven by awareness activity, emphasizing the need for balanced dissemination and support mechanisms.**\n\n**5. These insights collectively inform epidemic control strategies: improving information propagation via suitable network channels, managing community overlaps, and targeting resource allocation appear critical to mitigate epidemics on multiplex social systems.**\n\n---\n\n### References\n\n<a name=\"ref1\">[1]</a> Ting Liu, Ping Li, Yan Chen et al. (2016). Community Size Effects on Epidemic Spreading in Multiplex Social Networks. *PLoS ONE*, 11. DOI: 10.1371/journal.pone.0152021\n\n<a name=\"ref2\">[2]</a> S. Gündüç (2021). The Effects of Diffusion of Information on Epidemic Spread - A Multilayer Approach. *ArXiv*, abs/2103.07713. DOI: 10.5506/APhysPolB.50.179\n\n<a name=\"ref3\">[3]</a> Chao Zuo, Anjing Wang, Fenping Zhu et al. (2021). A New Coupled Awareness-Epidemic Spreading Model with Neighbor Behavior on Multiplex Networks. *Complex.*, 2021, Article ID 6680135. DOI: 10.1155/2021/6680135\n\n<a name=\"ref4\">[4]</a> Jie Chen, Yantao Zhang, Maobin Hu et al. (2025). Nontrivial epidemic dynamics induced by information-driven awareness-activity-resource coevolution. *Phys. Rev. E*, 111(4), 044301. DOI: 10.1103/physreve.111.044301\n\n<a name=\"ref5\">[5]</a> R. Amato, N. Kouvaris, M. S. Miguel et al. (2017). Opinion competition dynamics on multiplex networks. *New Journal of Physics*, 19. DOI: 10.1088/1367-2630/aa936a\n\n<a name=\"ref7\">[7]</a> C. Granell, S. Gómez, A. Arenas (2014). Competing spreading processes on multiplex networks: awareness and epidemics. *Phys. Rev. E*, 90(1), 012808. DOI: 10.1103/PhysRevE.90.012808\n\n---\n\nIf you have a specific question on any aspects of network topology effects on epidemic competition multiplex models or require a focused summary on particular mechanisms, please ask."
        }
    ]
}