{
    "results": [
        {
            "query": "SEIR epidemic modeling heterogeneous networks scale-free degree heterogeneity impact epidemiology",
            "papers": [
                {
                    "title": "Dynamics analysis of epidemic spreading with individual heterogeneous infection thresholds",
                    "abstract": "In the real world, individuals may become infected with an epidemic after multiple exposures to the corresponding virus. This occurs because each individual possesses certain physical defenses and immune capabilities at the time of exposure to the virus. Repeated exposure to the virus can lead to a decline in immune competence, consequently resulting in epidemic infection. The susceptibility of individuals to an epidemic is heterogeneous. We model this characteristic as the individual heterogeneous infection threshold. Then, we propose an individual logarithmic-like infection threshold function on a single-layer complex network to reflect the heterogeneity of individual susceptibility on infecting the virus and the associated epidemic. Next, we introduce a partition theory based on the edge and logarithmic-like infection threshold function to qualitatively analyze the mechanisms of virus infection and epidemic spreading. Finally, simulation results on Erdő–Rényi (ER) and scale-free (SF) networks indicate that increasing both the epidemic infection initial threshold and outbreak threshold, as well as decreasing the virus and epidemic infection probability, can all effectively suppress epidemic spreading and epidemic infection outbreak. With an increase in the epidemic infection outbreak threshold, the increasing pattern of the final epidemic infection scale transitions from a second-order continuous phase transition to a first-order discontinuous phase transition. Additionally, degree distribution heterogeneity also significantly impacts the outbreak and spread of diseases. These findings provide valuable guidance for the formulation of immunization strategies.",
                    "citation": "Feng Li (2024). Dynamics analysis of epidemic spreading with individual heterogeneous infection thresholds. Frontiers of Physics. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Simulation results indicate that increasing both the epidemic infection initial threshold and outbreak threshold, as well as decreasing the virus and epidemic infection probability, can all effectively suppress epidemic spreading and epidemic infection outbreak."
                    },
                    "url": "https://www.semanticscholar.org/paper/839bfdeb7d9781f8d50d1305f1c6f2e59faf5dc2"
                },
                {
                    "title": "Directional switches in network-organized swarming systems with delay.",
                    "abstract": "Coordinated directional switches can emerge between members of moving biological groups. Previous studies have shown that the self-propelled particles model can well reproduce directional switching behaviors, but it neglects the impact of social interactions. Thus, we focus on the influence of social interactions on the ordered directional switching motion of swarming systems, in which homogeneous Erdös-Rényi networks, heterogeneous scale-free networks, networks with community structures, and real-world animal social networks have been considered. The theoretical estimation of mean switching time is obtained, and the results show that the interplay between social and delayed interactions plays an important role in regulating directional switching behavior. To be specific, for homogeneous Erdös-Rényi networks, the increase in mean degree may suppress the directional switching behaviors if the delay is sufficiently small. However, when the delay is large, the large mean degree may promote the directional switching behavior. For heterogeneous scale-free networks, the increase of degree heterogeneity can reduce the mean switching time if the delay is sufficiently small, while the increasing degree heterogeneity may suppress the ordered directional switches if the delay is large. For networks with community structures, higher communities can promote directional switches for small delays, while for large delays, it may inhibit directional switching behavior. For dolphin social networks, delay can promote the directional switching behavior. Our results bring to light the role of social and delayed interactions in the ordered directional switching motion.",
                    "citation": "Rui Xiao, Wang Li, Donghua Zhao, et al. (2023). Directional switches in network-organized swarming systems with delay.. Chaos. Citations: 3, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The theoretical estimation of mean switching time is obtained, and the results show that the interplay between social and delayed interactions plays an important role in regulating directional switching behavior."
                    },
                    "url": "https://www.semanticscholar.org/paper/a4906745ecdc312b784eb80c4ecf32fa575d2b4d"
                },
                {
                    "title": "Degree dependent transmission rates in epidemic processes",
                    "abstract": "The outcome of SIR epidemics with heterogeneous infective lifetimes, or heterogeneous susceptibilities, can be mapped onto a directed percolation process on the underlying contact network. In this paper we study SIR models where heterogeneity is a result of the degree dependence of disease transmission rates. We develop numerical methods to determine the epidemic threshold, the epidemic probability and epidemic size close to the threshold for configuration model contact networks with arbitrary degree distribution and an arbitrary matrix of transmission rates (dependent on transmitting and receiving node degree). For the special case of separable transmission rates we obtain analytical expressions for these quantities. We propose a categorization of spreading processes based on the ratio of the probability of an epidemic and the expected size of an epidemic, and demonstrate that this ratio has a complex dependence on the degree distribution and the degree-dependent transmission rates. For scale-free contact networks and transmission rates that are power functions of transmitting and receiving node degrees, the epidemic threshold may be finite even when the degree distribution powerlaw exponent is below γ < 3. We give an expression, in terms of the degree distribution and transmission rate exponents, for the limit at which the epidemic threshold vanishes. We find that the expected epidemic size and the probability of an epidemic may grow nonlinearly above the epidemic threshold, with exponents that depend not only on the degree distribution powerlaw exponent, but on the parameters of the transmission rate degree dependence functions, in contrast to ordinary directed percolation and previously studied variations of the SIR model.",
                    "citation": "G. Baxter, G. Tim'ar (2021). Degree dependent transmission rates in epidemic processes. Journal of Statistical Mechanics: Theory and Experiment. Citations: 6, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/11403a74d32ce743294ffcd263452a62e3abddcd"
                },
                {
                    "title": "Fe b 20 21 Degree dependent transmission probabilities in epidemic processes",
                    "abstract": null,
                    "citation": "G. Baxter, G. Tim'ar (2021). Fe b 20 21 Degree dependent transmission probabilities in epidemic processes. Unknown Journal. Citations: 2, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/4745be4403fe286977401a842842980b045fa5d2"
                },
                {
                    "title": "The network epidemiology of an Ebola epidemic",
                    "abstract": "Connecting the different scales of epidemic dynamics, from individuals to communities to nations, remains one of the main challenges of disease modeling. Here, we revisit one of the largest public health efforts deployed against a localized epidemic: the 2014-2016 Ebola Virus Disease (EVD) epidemic in Sierra Leone. We leverage the data collected by the surveillance and contact tracing protocols of the Sierra Leone Ministry of Health and Sanitation, the US Centers for Disease Control and Prevention, and other responding partners to validate a network epidemiology framework connecting the population (incidence), community (local forecasts), and individual (secondary infections) scales of disease transmission. In doing so, we gain a better understanding of what brought the EVD epidemic to an end: Reduction of introduction in new clusters (primary cases), and not reduction in local transmission patterns (secondary infections). We also find that the first 90 days of the epidemic contained enough information to produce probabilistic forecasts of EVD cases; forecasts which we show are confirmed independently by both disease surveillance and contact tracing. Altogether, using data available two months before the start of the international support to the local response, network epidemiology could have inferred heterogeneity in local transmissions, the risk for superspreading events, and probabilistic forecasts of eventual cases per community. We expect that our framework will help connect large data collection efforts with individual behavior, and help reduce uncertainty during health emergencies and emerging epidemics. Infectious diseases are constant yet often unpredictable threats. The 2014-2016 EVD epidemic in West Africa alone took over ten thousand lives and led to aid distributions nearing $10 billion from 70 countries1. There were two major contributing factors: (i) local health systems were ill-prepared, with Ebola-affected countries falling at least 90% short of WHO recommendations for numbers of doctors and nurses per capita2; and (ii) the declaration of the Public Health Emergency of International Concern came late: over 4 months after the first international transmission event3. This last systemic failure likely reflects the fact that EVD outbreaks, like most emerging outbreaks, are highly unpredictable and variable. Before 2014, recent Ebola outbreaks occurred in the Democratic Republic of Congo in 2014 and 2012, South Sudan in 2004, Gabon in 2001, and notably in Uganda in 2012 and 2007, but these never exceeded 500 geographically contained cases4. In stark contrast, there were nearly 30,000 cases over 10 countries during the West African epidemic with widespread transmission in Guinea, Liberia and Sierra Leone, and other cases in Italy, Mali, Nigeria, Senegal, Spain, the United Kingdom, and the United States. The spread and impact of EVD spread is determined not only by the biology of the virus but also in large part by societal and behavioral factors5, 6. Consequently, in the country that reported the most number of cases and deaths, Sierra Leone, the intervention aimed to alleviate disease burden on a strained healthcare system focused on supportive care7 by investing significantly in behavioral interventions ranging from community engagement8 to traditional contact tracing9. As we will see, ar X iv :2 11 1. 08 68 6v 1 [ qbi o. PE ] 1 6 N ov 2 02 1 the latter revealed the variability of Ebola transmissions, suggesting that less than 5% of Ebola cases caused more than one secondary infection over the course of the epidemic, yet some individuals infected dozens of others. We can now leverage the data collected in these efforts to develop the next generation of epidemic forecasting tools through a first study of the unique ethical and anonymized Sierra Leone Ebola Database (SLED), which consolidates data from the Government of Sierra Leone and a range of responding partners10, 11. Here, we present case and contact tracing data from SLED. We first show that distributions of secondary infections (or transmissions) per case did not change significantly over time and that reduction in the spread of EVD was likely due to a reduction in its introduction in new communities. To validate these data, we then show that network epidemiology models informed by contact-tracing data can provide probabilistic forecasts of epidemics at the village level, capturing the heterogeneity of disease spread as well as its randomness. This network approach contrasts with the traditional deterministic forecasts from conventional compartmental models whose only uncertainty stems from parameter confidence rather than from the intrinsic randomness of epidemics. Importantly, we also show how to infer valuable individual-level contact statistics from population-level incidence data. Our network epidemiology framework helps us better understand the dynamics of EVD in Sierra Leone. It also opens the way to multi-scale inference of epidemic dynamics, connecting population incidence, probabilistic forecasts in communities, and individual-level heterogeneity. One key obstacle that precluded previous validation of models accounting for individual heterogeneity is the rarity of multi-scale data. Most epidemic data are coarse-grained over large populations (e.g. nations, states, etc.), while models often require individual level data (e.g. distribution of secondary infections or contact patterns) to provide forecasts at the level of communities (e.g., villages or towns). In that respect, the large contact tracing and data collection efforts accomplished during the EVD epidemic in Sierra Leone are unique in their scale and quality. During the West African EVD epidemic, contact tracing efforts were sustained to varying degree but spanned the entire epidemic13, see Fig. 1. These efforts followed the guidelines of the World Health Organization on how to establish and conduct contact tracing during filovirus disease outbreaks9. Therein, contact tracing is defined as the identification and follow-up of persons who may have come into contact with an infected individual. Identification is done by investigating high-risk categories of contacts, which include but are not limited to individuals who: (i) touched an infected patient’s body fluids (blood, vomit, saliva, urine, faeces), (ii) had direct physical contact with the body of a patient (alive or dead), (iii) touched or cleaned the linens or clothes of a patient, (iv) were laboratory workers who had direct contact with specimens collected from suspected Ebola patients without appropriate infection prevention and control measures, or (v) were patients who received care in a hospital where EVD patients were treated before the initiation of strict isolation and infection prevention and control measures. For disease modeling and forecasting, several key insights can be extracted from contact tracing data 14: Identifying the critical types of contacts, settings and mechanisms that promote transmission, inferring the frequency of superspreading events, and so on. The distribution of secondary infections identified through contact tracing around a given index case also reflects the heterogeneity of disease spread15, 16. In particular, the average number of secondary infections directly reflects the basic reproduction number R0 of the epidemic, which is often the sole focus of disease models ignoring the richness and heterogeneity of the underlying distribution. For the EVD epidemic in Sierra Leone, the distribution of secondary infections collected through contact tracing is shown for three key periods of the epidemic in Fig. 1. First, we note the absence of data regarding cases that did not cause any secondary infections. This is a direct shortcoming of the data collection which did not distinguish between cases where contact tracing efforts did not identify secondary infections and cases where there were no contact tracing efforts whatsoever. Second, the observed distributions show significant heterogeneity, stressing the need to account for more than simply their average (e.g., R0). In individuals at the source of at least one transmission event, we find an average of roughly 1.6 secondary infections in all three periods (1.624, 1.622, and 1.660 respectively). Yet, out of cases that do transmit the disease, 85% lead to a single secondary infection while at least 1 in a thousand cases leads to 10 infections or more. It is therefore dangerous to assume that the EVD epidemic was driven by average individuals. The majority of cases create fewer secondary infections than the average, while a minority create an order of magnitude more infections than average16, 17. Third, and perhaps most strikingly, the distribution of secondary infections do not statistically-significantly change across the three observed periods. These periods — May through September 2014, October to mid-November 2014, and onward — were chosen to contain similar numbers of contact tracing data but also roughly correspond to the onset of the epidemic peak, the epidemic peak itself, and the decay of the epidemic. One could reasonably assume that the large public health efforts which helped limit the spread of EVD would here be reflected as a decrease in the frequency of higher numbers of secondary infections. However, while public health efforts did reduce mortality 75 to 40%7, 18, they did not appear to influence the distribution of secondary infections as observed through contact tracing. This is a surprising result considering the scale of epidemic control efforts. We thus aim to validate this distribution of secondary infections. Are these contact tracing data reliable enough to inform epidemic models and forecasts? The contact tracing data is of course not perfect, with probable biases around the fact that",
                    "citation": "Laurent H'ebert-Dufresne, Jean-Gabriel Young, Jamie Bedson, et al. (2021). The network epidemiology of an Ebola epidemic. Unknown Journal. Citations: 3, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that distributions of secondary infections per case did not change significantly over time and that reduction in the spread of EVD was likely due to a reduction in its introduction in new communities, and that network epidemiology models informed by contact-tracing data can provide probabilistic forecasts of epidemics at the village level."
                    },
                    "url": "https://www.semanticscholar.org/paper/0b21e65fb788ebec213a7e4202265ec7f7a1b09d"
                },
                {
                    "title": "Emergence of nonlinear crossover under epidemic dynamics in heterogeneous networks.",
                    "abstract": "Potential diffusion processes of real-world systems are relevant to the underlying network structure and dynamical mechanisms. The vast majority of the existing work on spreading dynamics, in response to a large-scale network, is built on the condition of the infinite initial state, i.e., the extremely small seed size. The impact of an increasing seed size on the persistent diffusion has been less investigated. Based on classical epidemic models, this paper offers a framework for studying such impact through observing a crossover phenomenon in a two-diffusion-process dynamical system. The two diffusion processes are triggered by nodes with a high and low centrality, respectively. Specifically, given a finite initial state in networks with scale-free degree distributions, we demonstrate analytically and numerically that the diffusion process triggered by low centrality nodes pervades faster than that triggered by high centrality nodes from a certain point. The presence of the crossover phenomenon reveals that the dynamical process under the finite initial state is far more than the vertical scaling of the spreading curve under an infinite initial state. Further discussion emphasizes the persistent infection of individuals in epidemic dynamics as the essential reason rooted in the crossover, while the finite initial state is the catalyst directly leading to the emergence of this phenomenon. Our results provide valuable implications for studying the diversity of hidden dynamics on heterogeneous networks.",
                    "citation": "Zhen Su, Chao Gao, Jiming Liu, et al. (2020). Emergence of nonlinear crossover under epidemic dynamics in heterogeneous networks.. Physical Review E. Citations: 12, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Given a finite initial state in networks with scale-free degree distributions, it is demonstrated analytically and numerically that the diffusion process triggered by low centrality nodes pervades faster than that triggered by highcentrality nodes from a certain point."
                    },
                    "url": "https://www.semanticscholar.org/paper/762d3b2521897117d739011de801966ffa32f0c1"
                },
                {
                    "title": "Nonlinear Dynamic Analysis of New Product Diffusion considering Consumer Heterogeneity",
                    "abstract": "When a new product enters the market, individual consumers’ decision-making behavior and purchase time are uncertain. Based on the dynamics of epidemic transmission theory and agent modeling technology, this study proposes a new coupling model through the combination of the improved SEIR epidemic model and the heterogeneous agent model. This model considers consumer heterogeneity resulting from three aspects in consumers’ sensitivity, network topology, and considerations of information flow received. It aims to analyze how consumer heterogeneity affects the scale and speed of new product diffusion. The proposed model showed that consumers’ characteristics and behavior combination at the microlevel lead to the diversity of nonlinear diffusion curves at the macrolevel for new products. Moreover, a pilot study is conducted to simulate this model and examine how to estimate the model’s parameters using aggregated data about film products. The pilot study results suggested that different consumer characteristics and behavior combinations affect the scale and speed of new product diffusion to varying degrees. In different scenarios, there were significant differences in the influence of the degree of consumer heterogeneity on diffusion, accompanied by the occurrence of threshold. The results of the empirical analysis in this study are in line with reality.",
                    "citation": "Zhongjun Tang, Huike Zhu (2020). Nonlinear Dynamic Analysis of New Product Diffusion considering Consumer Heterogeneity. Complex. Citations: 6, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A new coupling model through the combination of the improved SEIR epidemic model and the heterogeneous agent model is proposed, which considers consumer heterogeneity resulting from three aspects in consumers’ sensitivity, network topology, and considerations of information flow received to analyze how consumer heterogeneity affects the scale and speed of new product diffusion."
                    },
                    "url": "https://www.semanticscholar.org/paper/04f6381699d7c7309e59615419e5d0d9112a8fb7"
                }
            ],
            "summary": ""
        }
    ]
}