{
    "results": [
        {
            "query": "SIRS model information spreading small-world networks oscillations forgetting",
            "papers": [
                {
                    "title": "Identifying influential nodes in spreading process in complex networks by integrating node dynamic propagation features and local structure",
                    "abstract": "Identifying the most influential nodes in the spreading process in complex networks is crucial in many applications, such as accelerating the diffusion of information and suppressing the spread of viruses or rumors. Existing methods for identifying influential spreaders have their limitations: classical network centrality methods rely solely on local or global topology to predict node influence; traditional machine learning and deep learning methods are not suitable for graph-structured data; and existing graph neural network-based methods neglect the dynamic characteristics of the propagation process itself. However, researches have pointed out that a node’s spreading influence does not only depend on its structural location, but is also significantly influenced by the dynamics of the spreading process itself. In this paper, we propose a Propagation Dynamics Graph Neural Network (PDGNN) that integrates the dynamic features of the propagation process and the structural features of nodes to identify influential nodes. Specifically speaking, based on the Susceptible-Infected-Recovered (SIR) propagation model, the dynamic infection features and potential infection capacity of nodes are extracted from the epidemic spreading process. Then a high-dimensional feature vector consisting of the embedding and the degree of the local transmission tree, and the dynamic sensitivity centrality of each node is constructed and used as the input to the graph neural network. To deal with the problem of imbalanced numbers between critical nodes and non-critical nodes in training the model and optimizing the output, an optimized loss function is designed, which combines Focal Loss with Mean Squared Error. Experimental results on two synthetic networks and seven real-world networks show that PDGNN outperforms classical centrality methods, traditional machine learning and deep learning-based methods, and existing graph neural network-based methods in identifying influential nodes in the spreading process in complex networks. The performance of PDGNN is robust when the infection rate and the size of the training set change. Under a wide range of infection rates, the proposed PDGNN can accurately identify influential spreaders. Even when the training set is 30% of the total dataset, the imprecision of PDGNN is small in all nine studied networks.",
                    "citation": "HOU Shiyu, Liu Ying, TANG Ming (2025). Identifying influential nodes in spreading process in complex networks by integrating node dynamic propagation features and local structure. Acta Physica Sinica. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Experimental results show that PDGNN outperforms classical centrality methods, traditional machine learning and deep learning-based methods, and existing graph neural network-based methods in identifying influential nodes in the spreading process in complex networks."
                    },
                    "url": "https://www.semanticscholar.org/paper/dcf6599d4c261bc4e471adfdad4841c8b00ba5b0"
                },
                {
                    "title": "SIR-D-Based Information Processing for Multiplatform Complex Social Networks",
                    "abstract": "Restricting the dissemination of negative information on social networks is crucial for maintaining a healthy online environment. Most research emphasizes establishing information dissemination models and designing information processing methods within a single network platform, which is insufficient to address the accelerated information spread resulting from users’ cross-platform dissemination behavior. This article presents a multiplatform information fusion processing method based on the susceptible infected recovered disregarded (SIR-D) model, which reduces the impact of negative information dissemination. First, we introduce an enhanced comprehensive propagation model, termed the SIR-D model, which incorporates a “Disregarded” state to represent users who have received but chose to disregard the recommended content. Additionally, the user state fusion process in the coupled network structure, consisting of ER random network, BA scale-free network and small world network, is described. Moreover, an information processing method is proposed that implements three different measures based on the level of information harm: taking no measures, weakening the effectiveness and blocking the source. Finally, the effectiveness of the information processing method, which incorporates the user state fusion process, is demonstrated through a simulation within complex social networks. The results indicate that the proposed method significantly improves processing efficiency and effectively reduces dangerous information dissemination compared to the nonfusion method.",
                    "citation": "Cheng Ji, Dong Lv, Yiwen Xiong, et al. (2025). SIR-D-Based Information Processing for Multiplatform Complex Social Networks. IEEE Transactions on Computational Social Systems. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/211e023245b4143de12c0d404376ec525c7cf588"
                },
                {
                    "title": "IPSR Model: Misinformation Intervention through Prebunking in Social Systems",
                    "abstract": "The rapid dissemination of misinformation through online social networks poses a growing threat to public understanding and societal stability. Prebunking, a proactive strategy based on inoculation theory, has recently emerged as an effective intervention to build cognitive resilience against misinformation before exposure. In this work, we investigate the impact of prebunking on misinformation dynamics using a compartmental modeling framework. We first analyze the classical Ignorant-Spreader-Stifler (ISR) model, its parameters are determined using empirical rumor data from Twitter. We then propose an extended model, the Ignorant-Prebunked-Spreader-Stifler (IPSR) model, which incorporates prebunking as a preventive state and includes a forgetting mechanism to account for the decay of cognitive immunity over time. Using mean-field approximations, we derive steady-state solutions and examine the effect of prebunking on the spreading of misinformation. We further investigate the robustness of the IPSR model by varying network size and average degree. In addition, we analyze the model's behavior on Watts-Strogatz and Barabasi-Albert networks to assess the role of small-world and scale-free structures in shaping intervention outcomes. Our results show that the inclusion of prebunking significantly reduces the scale of misinformation outbreaks across different network structures. These findings highlight the efficacy of prebunking as a scalable intervention strategy and underscore the utility of compartmental models in understanding and mitigating information-based contagion in complex networks.",
                    "citation": "Robert Rai, Rajesh Sharma, Chandrakala Meena (2025). IPSR Model: Misinformation Intervention through Prebunking in Social Systems. Unknown Journal. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results show that the inclusion of prebunking significantly reduces the scale of misinformation outbreaks across different network structures, highlighting the efficacy of prebunking as a scalable intervention strategy and underscore the utility of compartmental models in understanding and mitigating information-based contagion in complex networks."
                    },
                    "url": "https://www.semanticscholar.org/paper/9332c470e72b57a088b8d77c6114aa002661ec25"
                },
                {
                    "title": "ICDC: Ranking Influential Nodes in Complex Networks Based on Isolating and Clustering Coefficient Centrality Measures",
                    "abstract": "Over the past decade, there has been extensive research conducted on complex networks, primarily driven by their crucial role in understanding the various real-world networks such as social networks, communication networks, transportation networks, and biological networks. Ranking influential nodes is one of the fundamental research problems in the areas of rumor spreading, disease research, viral marketing, and drug development. Influential nodes in any network are used to disseminate the information as fast as possible. Centrality measures are designed to quantify the node’s significance and rank the influential nodes in complex networks. However, these measures typically focus on either the local or global topological structure within and outside network communities. In particular, many measures limit their ability to capture the node’s overall impact on small-scale networks. To address these challenges, we develop a novel centrality measure called Isolating Clustering Distance Centrality (ICDC) by integrating the isolating and clustering coefficient centrality measures. The proposed metric gives a more thorough assessment of the node’s importance by integrating the local isolation and global topological influence in large-scale complex networks. We employ the SIR and ICM epidemic models to study the efficiency of ICDC against traditional centrality measures across real-world complex networks. Our experimental findings consistently highlight the superior efficacy of ICDC in terms of fast spreading and computational efficiency when compared to existing centrality measures.",
                    "citation": "Mondikathi Chiranjeevi, V. S. Dhuli, M. Enduri, et al. (2023). ICDC: Ranking Influential Nodes in Complex Networks Based on Isolating and Clustering Coefficient Centrality Measures. IEEE Access. Citations: 10, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel centrality measure called Isolating Clustering Distance Centrality (ICDC), integrating the isolating and clustering coefficient centrality measures, which gives a more thorough assessment of the node’s importance by integrating the local isolation and global topological influence in large-scale complex networks."
                    },
                    "url": "https://www.semanticscholar.org/paper/ca0dd0c171ac8a57ed0bb312d705dbe6b0b810e8"
                },
                {
                    "title": "Spatiotemporal dynamics of periodic waves in SIR model with driving factors",
                    "abstract": "The world faces Covid-19 waves, and the overall pattern of confirmed cases shows periodic oscillations. In this paper, we investigate the spatiotemporal spread of Covid-19 in the network-organized SIR model with an extrinsic incubation period of the driving factors. Firstly, Our analysis shows the occurrences of Hopf bifurcation and periodic outbreaks consistent with the actual spread of Covid-19. And we investigate periodic waves on spatial scales using Turing instability, and the spread of infected individuals increases the localized hot spots. We study the effect of the incubation period, and more incubation periods generate Turing instability resulting in periodic outbreaks. There is an occurrence of bursting states at peaks of periodic waves due to small diffusion of infected and susceptible, which means stable and unstable areas try to convert each other due to high competition among nodes. Also, We note the disappearance of these bursts when infected and susceptible individuals’ movements are easier; thus, the dominance of infected individuals prevails everywhere. Effective policy interventions and seasonality can cause periodic perturbations in the model, and therefore we study the impact of these perturbations on the spread of Covid-19. Periodic perturbations on the driving factors, infected individuals show co-existing spatial patterns. Chaotic outbreak becomes periodic outbreaks through alternating periodic or period-2 outbreaks as we regulate the amplitude and frequency of infected individuals. In short, regulations can erase period-2 and chaotic spread through policy interventions.",
                    "citation": "Q. Zheng, J. W. Shen, V. Pandey, et al. (2023). Spatiotemporal dynamics of periodic waves in SIR model with driving factors. New Journal of Physics. Citations: 9, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper investigates the spatiotemporal spread of Covid-19 in the network-organized SIR model with an extrinsic incubation period of the driving factors, and investigates periodic waves on spatial scales using Turing instability."
                    },
                    "url": "https://www.semanticscholar.org/paper/1acc64aae9da10e5048c96cb58d2c95110dd3c2d"
                },
                {
                    "title": "Bond Percolation in Small-World Graphs with Power-Law Distribution",
                    "abstract": "\\emph{Full-bond percolation} with parameter $p$ is the process in which, given a graph, for every edge independently, we delete the edge with probability $1-p$. Bond percolation is motivated by problems in mathematical physics and it is studied in parallel computing and network science to understand the resilience of distributed systems to random link failure and the spread of information in networks through unreliable links. Full-bond percolation is also equivalent to the \\emph{Reed-Frost process}, a network version of \\emph{SIR} epidemic spreading, in which the graph represents contacts among people and $p$ corresponds to the probability that a contact between an infected person and a susceptible one causes a transmission of the infection. We consider \\emph{one-dimensional power-law small-world graphs} with parameter $\\alpha$ obtained as the union of a cycle with additional long-range random edges: each pair of nodes $(u,v)$ at distance $L$ on the cycle is connected by a long-range edge $(u,v)$, with probability proportional to $1/L^\\alpha$. Our analysis determines three phases for the percolation subgraph $G_p$ of the small-world graph, depending on the value of $\\alpha$. 1) If $\\alpha<1$, there is a $p<1$ such that, with high probability, there are $\\Omega(n)$ nodes that are reachable in $G_p$ from one another in $O(\\log n)$ hops; 2) If $1<\\alpha<2$, there is a $p<1$ such that, with high probability, there are $\\Omega(n)$ nodes that are reachable in $G_p$ from one another in $\\log^{O(1)}(n)$ hops; 3) If $\\alpha>2$, for every $p<1$, with high probability all connected components of $G_p$ have size $O(\\log n)$. The setting of full-bond percolation in finite graphs studied in this paper, which is the one that corresponds to the network SIR model of epidemic spreading, had not been analyzed before.",
                    "citation": "L. Becchetti, A. Clementi, F. Pasquale, et al. (2022). Bond Percolation in Small-World Graphs with Power-Law Distribution. Symposium on Algorithmic Foundations of Dynamic Networks. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The setting of full-bond percolation in finite graphs studied in this paper is the one that corresponds to the network SIR model of epidemic spreading, which had not been analyzed before."
                    },
                    "url": "https://www.semanticscholar.org/paper/dec115c9c400ace0c22f29e70bf88cb7cce65542"
                },
                {
                    "title": "Analyzing Community-aware Centrality Measures Using The Linear Threshold Model",
                    "abstract": "Targeting influential nodes in complex networks allows fastening or hindering rumors, epidemics, and electric blackouts. Since communities are prevalent in real-world networks, community-aware centrality measures exploit this information to target influential nodes. Researches show that they compare favorably with classical measures that are agnostic about the community structure. Although the diffusion process is of prime importance, previous studies consider mainly the famous Susceptible-Infected-Recovered (SIR) epidemic propagation model. This work investigates the consistency of previous analyses using the popular Linear Threshold (LT) propagation model, which characterizes many spreading processes in our real life. We perform a comparative analysis of seven influential community-aware centrality measures on thirteen real-world networks. Overall, results show that Community-based Mediator, Comm Centrality, and Modularity Vitality outperform the other measures. Moreover, Community-based Mediator is more effective on a tight budget (i.e., a small fraction of initially activated nodes), while Comm Centrality and Modularity Vitality perform better with a medium to a high fraction of initially activated nodes.",
                    "citation": "Stephany Rajeh, A. Yassin, Ali Jaber, et al. (2022). Analyzing Community-aware Centrality Measures Using The Linear Threshold Model. International Workshop on Complex Networks & Their Applications. Citations: 4, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work investigates the consistency of previous analyses using the popular Linear Threshold propagation model, which characterizes many spreading processes in the authors' real life and shows that Community-based Mediator, Comm Centrality, and Modularity Vitality outperform the other measures."
                    },
                    "url": "https://www.semanticscholar.org/paper/905700427e55c4bb19b8b5cfe199d34c0b1c738a"
                }
            ],
            "summary": ""
        }
    ]
}