{
    "results": [
        {
            "query": "SEIR model epidemic dynamics on degree-heterogeneous networks vs homogeneous networks",
            "papers": [
                {
                    "title": "SIR dynamics in random networks with heterogeneous connectivity",
                    "abstract": "Random networks with specified degree distributions have been proposed as realistic models of population structure, yet the problem of dynamically modeling SIR-type epidemics in random networks remains complex. I resolve this dilemma by showing how the SIR dynamics can be modeled with a system of three nonlinear ODE’s. The method makes use of the probability generating function (PGF) formalism for representing the degree distribution of a random network and makes use of network-centric quantities such as the number of edges in a well-defined category rather than node-centric quantities such as the number of infecteds or susceptibles. The PGF provides a simple means of translating between network and node-centric variables and determining the epidemic incidence at any time. The theory also provides a simple means of tracking the evolution of the degree distribution among susceptibles or infecteds. The equations are used to demonstrate the dramatic effects that the degree distribution plays on the final size of an epidemic as well as the speed with which it spreads through the population. Power law degree distributions are observed to generate an almost immediate expansion phase yet have a smaller final size compared to homogeneous degree distributions such as the Poisson. The equations are compared to stochastic simulations, which show good agreement with the theory. Finally, the dynamic equations provide an alternative way of determining the epidemic threshold where large-scale epidemics are expected to occur, and below which epidemic behavior is limited to finite-sized outbreaks.",
                    "citation": "E. Volz (2007). SIR dynamics in random networks with heterogeneous connectivity. Journal of Mathematical Biology. Citations: 350, Influential: 43.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The dynamic equations provide an alternative way of determining the epidemic threshold where large-scale epidemics are expected to occur, and below which epidemic behavior is limited to finite-sized outbreaks."
                    },
                    "url": "https://www.semanticscholar.org/paper/12c43cb438f6770089664773378410b1a24f91a9"
                },
                {
                    "title": "Effects of Heterogeneous and Clustered Contact Patterns on Infectious Disease Dynamics",
                    "abstract": "The spread of infectious diseases fundamentally depends on the pattern of contacts between individuals. Although studies of contact networks have shown that heterogeneity in the number of contacts and the duration of contacts can have far-reaching epidemiological consequences, models often assume that contacts are chosen at random and thereby ignore the sociological, temporal and/or spatial clustering of contacts. Here we investigate the simultaneous effects of heterogeneous and clustered contact patterns on epidemic dynamics. To model population structure, we generalize the configuration model which has a tunable degree distribution (number of contacts per node) and level of clustering (number of three cliques). To model epidemic dynamics for this class of random graph, we derive a tractable, low-dimensional system of ordinary differential equations that accounts for the effects of network structure on the course of the epidemic. We find that the interaction between clustering and the degree distribution is complex. Clustering always slows an epidemic, but simultaneously increasing clustering and the variance of the degree distribution can increase final epidemic size. We also show that bond percolation-based approximations can be highly biased if one incorrectly assumes that infectious periods are homogeneous, and the magnitude of this bias increases with the amount of clustering in the network. We apply this approach to model the high clustering of contacts within households, using contact parameters estimated from survey data of social interactions, and we identify conditions under which network models that do not account for household structure will be biased.",
                    "citation": "Erik M. Volz, Joel C. Miller, Alison P Galvani, et al. (2011). Effects of Heterogeneous and Clustered Contact Patterns on Infectious Disease Dynamics. PLoS Comput. Biol.. Citations: 74, Influential: 4.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown that bond percolation-based approximations can be highly biased if one incorrectly assumes that infectious periods are homogeneous, and the magnitude of this bias increases with the amount of clustering in the network."
                    },
                    "url": "https://www.semanticscholar.org/paper/740b30ece1ab0461a50dd987fe86a46721f99e18"
                },
                {
                    "title": "Impact of imperfect vaccination and defense against contagion on vaccination behavior in complex networks",
                    "abstract": "We explore a mathematical framework of the vaccination game taking into account spatial structure, say, and degree distribution amid individuals. The framework presumes SIR/V dynamics in a season, which is followed by a strategy update process that estimates whether an individual will take a protecting measure, considering imperfect vaccination or defense against contagion. The numerical result based on multi-agent simulations (MAS) validates our theory, suggesting that a more heterogeneous spatial structure is vulnerable to an epidemic. This conclusion is consistent with the qualitative knowledge that a pandemic arises more easily in a scale-free network than in homogeneous networks because of the negative contribution of hub agents acting as super spreaders. Highlights – A new theoretical model is established for the vaccination game with a SIR/V model and either imperfect vaccination or intermediate measures. – The model considers degree distribution amid individuals, which significantly influences disease spreading. – The model is validated by simulation results. – The results prove that a more heterogeneous network is disadvantageous to prevent disease spreading.",
                    "citation": "Kazuki Kuga, J. Tanimoto (2018). Impact of imperfect vaccination and defense against contagion on vaccination behavior in complex networks. Journal of Statistical Mechanics: Theory and Experiment. Citations: 46, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A new theoretical model is established for the vaccination game with a SIR/V model and either imperfect vaccination or intermediate measures, which proves that a more heterogeneous network is disadvantageous to prevent disease spreading."
                    },
                    "url": "https://www.semanticscholar.org/paper/717d4e337ff18e09b5ece5b1304fcb0b572101b9"
                },
                {
                    "title": "Age-specific contacts and travel patterns in the spatial spread of 2009 H1N1 influenza pandemic",
                    "abstract": "BackgroundConfirmed H1N1 cases during late spring and summer 2009 in various countries showed a substantial age shift between importations and local transmission cases, with adults mainly responsible for seeding unaffected regions and children most frequently driving community outbreaks.MethodsWe introduce a multi-host stochastic metapopulation model with two age classes to analytically investigate the role of a heterogeneously mixing population and its associated non-homogeneous travel behaviors on the risk of a major epidemic. We inform the model with demographic data, contact data and travel statistics of Europe and Mexico, and calibrate it to the 2009 H1N1 pandemic early outbreak. We allow for variations of the model parameters to explore the conditions of invasion under different scenarios.ResultsWe derive the expression for the potential of global invasion of the epidemic that depends on the transmissibility of the pathogen, the transportation network and mobility features, the demographic profile and the mixing pattern. Higher assortativity in the contact pattern greatly increases the probability of spatial containment of the epidemic, this effect being contrasted by an increase in the social activity of adults vs. children. Heterogeneous features of the mobility network characterizing its topology and traffic flows strongly favor the invasion of the pathogen at the spatial level, as also a larger fraction of children traveling. Variations in the demographic profile and mixing habits across countries lead to heterogeneous outbreak situations. Model results are compatible with the H1N1 spatial transmission dynamics observed.ConclusionsThis work illustrates the importance of considering age-dependent mixing profiles and mobility features coupled together to study the conditions for the spatial invasion of an emerging influenza pandemic. Its results allow the immediate assessment of the risk of a major epidemic for a specific scenario upon availability of data, and the evaluation of the potential effectiveness of public health interventions targeting specific age groups, their interactions and mobility behaviors. The approach provides a general modeling framework that can be used for other types of partitions of the host population and applied to different settings.",
                    "citation": "A. Apolloni, C. Poletto, V. Colizza (2013). Age-specific contacts and travel patterns in the spatial spread of 2009 H1N1 influenza pandemic. BMC Infectious Diseases. Citations: 84, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A multi-host stochastic metapopulation model with two age classes is introduced to analytically investigate the role of a heterogeneously mixing population and its associated non-homogeneous travel behaviors on the risk of a major epidemic."
                    },
                    "url": "https://www.semanticscholar.org/paper/d3be66618989023f40053f26140188c9ba7959ee"
                },
                {
                    "title": "Spatial heterogeneity and infection patterns on epidemic transmission disclosed by a combined contact-dependent dynamics and compartmental model",
                    "abstract": "Epidemics, such as COVID-19, have caused significant harm to human society worldwide. A better understanding of epidemic transmission dynamics can contribute to more efficient prevention and control measures. Compartmental models, which assume homogeneous mixing of the population, have been widely used in the study of epidemic transmission dynamics, while agent-based models rely on a network definition for individuals. In this study, we developed a real-scale contact-dependent dynamic (CDD) model and combined it with the traditional susceptible-exposed-infectious-recovered (SEIR) compartment model. By considering individual random movement and disease spread, our simulations using the CDD-SEIR model reveal that the distribution of agent types in the community exhibits spatial heterogeneity. The estimated basic reproduction number R0 depends on group mobility, increasing logarithmically in strongly heterogeneous cases and saturating in weakly heterogeneous conditions. Notably, R0 is approximately independent of virus virulence when group mobility is low. We also show that transmission through small amounts of long-term contact is possible due to short-term contact patterns. The dependence of R0 on environment and individual movement patterns implies that reduced contact time and vaccination policies can significantly reduce the virus transmission capacity in situations where the virus is highly transmissible (i.e., R0 is relatively large). This work provides new insights into how individual movement patterns affect virus spreading and how to protect people more efficiently.",
                    "citation": "Youyuan Zhu, Ruizhe Shen, Hao Dong, et al. (2023). Spatial heterogeneity and infection patterns on epidemic transmission disclosed by a combined contact-dependent dynamics and compartmental model. PLoS ONE. Citations: 6, Influential: 1.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work developed a real-scale contact-dependent dynamic (CDD) model and combined it with the traditional susceptible-exposed-infectious-recovered (SEIR) compartment model and provides new insights into how individual movement patterns affect virus spreading and how to protect people more efficiently."
                    },
                    "url": "https://www.semanticscholar.org/paper/982a1db731ba9bb6c0b07e7808136272c5160705"
                },
                {
                    "title": "Dynamics of a susceptible-infected-recovered model on complex networks with interregional migration.",
                    "abstract": "We present a susceptible-infected-recovered model based on a dynamic flow network that describes the epidemic process on complex metapopulation networks. This model views population regions as interconnected nodes and describes the evolution of each region using a system of differential equations. The next-generation matrix method is used to derive the global basic reproduction number for three cases: a general network with homogeneous infection rates in all regions, a fully connected network, and a star network with heterogeneous infection and recovery rates. For the homogeneous case, we show that this global basic reproduction number is independent of the migration rates between regions. However, the rate of convergence of each region to an equilibrium state exhibits a much larger variance in random (Erdős-Rényi) networks compared to small-scale (Barabási-Albert) networks. For the general heterogeneous case, we report interesting results, namely that the global basic reproduction number decays exponentially with respect to the smallest nonzero Laplacian eigenvalue (algebraic connectivity). Furthermore, we demonstrate both analytically and numerically that as the network's algebraic connectivity increases, either by increasing the average node degree of each region or the global migration rate, the global basic reproduction number decreases and converges to the ratio of the average local infection rate to the average local recovery rate, meaning that the lower bound of the global basic reproduction rate does not equal the mean of local basic reproduction rates.",
                    "citation": "Ruiwu Niu, Yin-Chi Chan, E. W. Wong, et al. (2024). Dynamics of a susceptible-infected-recovered model on complex networks with interregional migration.. Physical Review E. Citations: 2, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/df1dc64ef5568fa2fc625980bd5c50ff40e94862"
                },
                {
                    "title": "Impact of diffusion on synchronization pattern of epidemics in non-identical meta-population networks.",
                    "abstract": "In epidemic networks, it has been demonstrated that implementing any intervention strategy on nodes with specific characteristics (such as a high degree or node betweenness) substantially diminishes the outbreak size. We extend this finding with a disease-spreading meta-population model using testkits to explore the influence of migration on infection dynamics within the distinct communities of the network. Notably, we observe that nodes equipped with testkits and no testkits tend to segregate into two separate clusters when migration is low, but above a critical migration rate, they coalesce into one single cluster. Based on this clustering phenomenon, we develop a reduced model and validate the emergent clustering behavior through comprehensive simulations. We observe this property in both homogeneous and heterogeneous networks.",
                    "citation": "Anika Roy, Ujjwal Shekhar, Aditi Bose, et al. (2024). Impact of diffusion on synchronization pattern of epidemics in non-identical meta-population networks.. Chaos. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A reduced model is developed and the emergent clustering behavior is validated through comprehensive simulations that observes that nodes equipped with testkits and no testkits tend to segregate into two separate clusters when migration is low, but above a critical migration rate, they coalesce into one single cluster."
                    },
                    "url": "https://www.semanticscholar.org/paper/9f8f6dec38671d793f836ff0dad7315de287db28"
                }
            ],
            "summary": ""
        },
        {
            "query": "common network structures used in SEIR epidemic simulations",
            "papers": [
                {
                    "title": "An infectious disease model on empirical networks of human contact: bridging the gap between dynamic network data and contact matrices",
                    "abstract": "BackgroundThe integration of empirical data in computational frameworks designed to model the spread of infectious diseases poses a number of challenges that are becoming more pressing with the increasing availability of high-resolution information on human mobility and contacts. This deluge of data has the potential to revolutionize the computational efforts aimed at simulating scenarios, designing containment strategies, and evaluating outcomes. However, the integration of highly detailed data sources yields models that are less transparent and general in their applicability. Hence, given a specific disease model, it is crucial to assess which representations of the raw data work best to inform the model, striking a balance between simplicity and detail.MethodsWe consider high-resolution data on the face-to-face interactions of individuals in a pediatric hospital ward, obtained by using wearable proximity sensors. We simulate the spread of a disease in this community by using an SEIR model on top of different mathematical representations of the empirical contact patterns. At the most detailed level, we take into account all contacts between individuals and their exact timing and order. Then, we build a hierarchy of coarse-grained representations of the contact patterns that preserve only partially the temporal and structural information available in the data. We compare the dynamics of the SEIR model across these representations.ResultsWe show that a contact matrix that only contains average contact durations between role classes fails to reproduce the size of the epidemic obtained using the high-resolution contact data and also fails to identify the most at-risk classes. We introduce a contact matrix of probability distributions that takes into account the heterogeneity of contact durations between (and within) classes of individuals, and we show that, in the case study presented, this representation yields a good approximation of the epidemic spreading properties obtained by using the high-resolution data.ConclusionsOur results mark a first step towards the definition of synopses of high-resolution dynamic contact networks, providing a compact representation of contact patterns that can correctly inform computational models designed to discover risk groups and evaluate containment policies. We show in a typical case of a structured population that this novel kind of representation can preserve in simulation quantitative features of the epidemics that are crucial for their study and management.",
                    "citation": "A. Machens, F. Gesualdo, C. Rizzo, et al. (2013). An infectious disease model on empirical networks of human contact: bridging the gap between dynamic network data and contact matrices. BMC Infectious Diseases. Citations: 125, Influential: 6.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A compact representation of contact patterns that can correctly inform computational models designed to discover risk groups and evaluate containment policies is presented, providing a first step towards the definition of synopses of high-resolution dynamic contact networks."
                    },
                    "url": "https://www.semanticscholar.org/paper/e1e24c28a116cc3b076341bdee535578816e744c"
                },
                {
                    "title": "Detecting critical slowing down in high-dimensional epidemiological systems",
                    "abstract": "Despite medical advances, the emergence and re-emergence of infectious diseases continue to pose a public health threat. Low-dimensional epidemiological models predict that epidemic transitions are preceded by the phenomenon of critical slowing down (CSD). This has raised the possibility of anticipating disease (re-)emergence using CSD-based early-warning signals (EWS), which are statistical moments estimated from time series data. For EWS to be useful at detecting future (re-)emergence, CSD needs to be a generic (model-independent) feature of epidemiological dynamics irrespective of system complexity. Currently, it is unclear whether the predictions of CSD—derived from simple, low-dimensional systems—pertain to real systems, which are high-dimensional. To assess the generality of CSD, we carried out a simulation study of a hierarchy of models, with increasing structural complexity and dimensionality, for a measles-like infectious disease. Our five models included: i) a nonseasonal homogeneous Susceptible-Exposed-Infectious-Recovered (SEIR) model, ii) a homogeneous SEIR model with seasonality in transmission, iii) an age-structured SEIR model, iv) a multiplex network-based model (Mplex) and v) an agent-based simulator (FRED). All models were parameterised to have a herd-immunity immunization threshold of around 90% coverage, and underwent a linear decrease in vaccine uptake, from 92% to 70% over 15 years. We found evidence of CSD prior to disease re-emergence in all models. We also evaluated the performance of seven EWS: the autocorrelation, coefficient of variation, index of dispersion, kurtosis, mean, skewness, variance. Performance was scored using the Area Under the ROC Curve (AUC) statistic. The best performing EWS were the mean and variance, with AUC > 0.75 one year before the estimated transition time. These two, along with the autocorrelation and index of dispersion, are promising candidate EWS for detecting disease emergence.",
                    "citation": "T. Brett, M. Ajelli, Quan-Hui Liu, et al. (2020). Detecting critical slowing down in high-dimensional epidemiological systems. PLoS Comput. Biol.. Citations: 44, Influential: 5.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A simulation study of a hierarchy of models for a measles-like infectious disease found evidence of CSD prior to disease re-emergence in all models, and found the autocorrelation and index of dispersion are promising candidate EWS for detecting disease emergence."
                    },
                    "url": "https://www.semanticscholar.org/paper/9ec7cb7dfedea1251252378421327e3140ff83ce"
                },
                {
                    "title": "Sampling of Temporal Networks: Methods and Biases",
                    "abstract": "Temporal networks have been increasingly used to model a diversity of systems that evolve in time; for example, human contact structures over which dynamic processes such as epidemics take place. A fundamental aspect of real-life networks is that they are sampled within temporal and spatial frames. Furthermore, one might wish to subsample networks to reduce their size for better visualization or to perform computationally intensive simulations. The sampling method may affect the network structure and thus caution is necessary to generalize results based on samples. In this paper, we study four sampling strategies applied to a variety of real-life temporal networks. We quantify the biases generated by each sampling strategy on a number of relevant statistics such as link activity, temporal paths and epidemic spread. We find that some biases are common in a variety of networks and statistics, but one strategy, uniform sampling of nodes, shows improved performance in most scenarios. Given the particularities of temporal network data and the variety of network structures, we recommend that the choice of sampling methods be problem oriented to minimize the potential biases for the specific research questions on hand. Our results help researchers to better design network data collection protocols and to understand the limitations of sampled temporal network data.",
                    "citation": "Luis E C Rocha, N. Masuda, Petter Holme (2017). Sampling of Temporal Networks: Methods and Biases. Physical Review E. Citations: 34, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The biases generated by each sampling strategy are quantified on a number of relevant statistics such as link activity, temporal paths and epidemic spread and one strategy, uniform sampling of nodes, shows improved performance in most scenarios."
                    },
                    "url": "https://www.semanticscholar.org/paper/19f3e18bf1da36aae8dd9140d82f1f29f5b54118"
                },
                {
                    "title": "25th Annual Computational Neuroscience Meeting: CNS-2016",
                    "abstract": "Table of contentsA1 Functional advantages of cell-type heterogeneity in neural circuitsTatyana O. SharpeeA2 Mesoscopic modeling of propagating waves in visual cortexAlain DestexheA3 Dynamics and biomarkers of mental disordersMitsuo KawatoF1 Precise recruitment of spiking output at theta frequencies requires dendritic h-channels in multi-compartment models of oriens-lacunosum/moleculare hippocampal interneuronsVladislav Sekulić, Frances K. SkinnerF2 Kernel methods in reconstruction of current sources from extracellular potentials for single cells and the whole brainsDaniel K. Wójcik, Chaitanya Chintaluri, Dorottya Cserpán, Zoltán SomogyváriF3 The synchronized periods depend on intracellular transcriptional repression mechanisms in circadian clocks.Jae Kyoung Kim, Zachary P. Kilpatrick, Matthew R. Bennett, Kresimir JosićO1 Assessing irregularity and coordination of spiking-bursting rhythms in central pattern generatorsIrene Elices, David Arroyo, Rafael Levi, Francisco B. Rodriguez, Pablo VaronaO2 Regulation of top-down processing by cortically-projecting parvalbumin positive neurons in basal forebrainEunjin Hwang, Bowon Kim, Hio-Been Han, Tae Kim, James T. McKenna, Ritchie E. Brown, Robert W. McCarley, Jee Hyun ChoiO3 Modeling auditory stream segregation, build-up and bistabilityJames Rankin, Pamela Osborn Popp, John RinzelO4 Strong competition between tonotopic neural ensembles explains pitch-related dynamics of auditory cortex evoked fieldsAlejandro Tabas, André Rupp, Emili Balaguer-BallesterO5 A simple model of retinal response to multi-electrode stimulationMatias I. Maturana, David B. Grayden, Shaun L. Cloherty, Tatiana Kameneva, Michael R. Ibbotson, Hamish MeffinO6 Noise correlations in V4 area correlate with behavioral performance in visual discrimination taskVeronika Koren, Timm Lochmann, Valentin Dragoi, Klaus ObermayerO7 Input-location dependent gain modulation in cerebellar nucleus neuronsMaria Psarrou, Maria Schilstra, Neil Davey, Benjamin Torben-Nielsen, Volker SteuberO8 Analytic solution of cable energy function for cortical axons and dendritesHuiwen Ju, Jiao Yu, Michael L. Hines, Liang Chen, Yuguo YuO9 C. elegans interactome: interactive visualization of Caenorhabditis elegans worm neuronal networkJimin Kim, Will Leahy, Eli ShlizermanO10 Is the model any good? Objective criteria for computational neuroscience model selectionJustas Birgiolas, Richard C. Gerkin, Sharon M. CrookO11 Cooperation and competition of gamma oscillation mechanismsAtthaphon Viriyopase, Raoul-Martin Memmesheimer, Stan GielenO12 A discrete structure of the brain wavesYuri Dabaghian, Justin DeVito, Luca PerottiO13 Direction-specific silencing of the Drosophila gaze stabilization systemAnmo J. Kim, Lisa M. Fenk, Cheng Lyu, Gaby MaimonO14 What does the fruit fly think about values? A model of olfactory associative learningChang Zhao, Yves Widmer, Simon Sprecher,Walter SennO15 Effects of ionic diffusion on power spectra of local field potentials (LFP)Geir Halnes, Tuomo Mäki-Marttunen, Daniel Keller, Klas H. Pettersen,Ole A. Andreassen, Gaute T. EinevollO16 Large-scale cortical models towards understanding relationship between brain structure abnormalities and cognitive deficitsYasunori YamadaO17 Spatial coarse-graining the brain: origin of minicolumnsMoira L. Steyn-Ross, D. Alistair Steyn-RossO18 Modeling large-scale cortical networks with laminar structureJorge F. Mejias, John D. Murray, Henry Kennedy, Xiao-Jing WangO19 Information filtering by partial synchronous spikes in a neural populationAlexandra Kruscha, Jan Grewe, Jan Benda, Benjamin LindnerO20 Decoding context-dependent olfactory valence in Drosophila\n Laurent Badel, Kazumi Ohta, Yoshiko Tsuchimoto, Hokto KazamaP1 Neural network as a scale-free network: the role of a hubB. KahngP2 Hemodynamic responses to emotions and decisions using near-infrared spectroscopy optical imagingNicoladie D. TamP3 Phase space analysis of hemodynamic responses to intentional movement directions using functional near-infrared spectroscopy (fNIRS) optical imaging techniqueNicoladie D.Tam, Luca Pollonini, George ZouridakisP4 Modeling jamming avoidance of weakly electric fishJaehyun Soh, DaeEun KimP5 Synergy and redundancy of retinal ganglion cells in predictionMinsu Yoo, S. E. PalmerP6 A neural field model with a third dimension representing cortical depthViviana Culmone, Ingo BojakP7 Network analysis of a probabilistic connectivity model of the Xenopus tadpole spinal cordAndrea Ferrario, Robert Merrison-Hort, Roman BorisyukP8 The recognition dynamics in the brainChang Sub KimP9 Multivariate spike train analysis using a positive definite kernelTaro TezukaP10 Synchronization of burst periods may govern slow brain dynamics during general anesthesiaPangyu JooP11 The ionic basis of heterogeneity affects stochastic synchronyYoung-Ah Rho, Shawn D. Burton, G. Bard Ermentrout, Jaeseung Jeong, Nathaniel N. UrbanP12 Circular statistics of noise in spike trains with a periodic componentPetr MarsalekP14 Representations of directions in EEG-BCI using Gaussian readoutsHoon-Hee Kim, Seok-hyun Moon, Do-won Lee, Sung-beom Lee, Ji-yong Lee, Jaeseung JeongP15 Action selection and reinforcement learning in basal ganglia during reaching movementsYaroslav I. Molkov, Khaldoun Hamade, Wondimu Teka, William H. Barnett, Taegyo Kim, Sergey Markin, Ilya A. RybakP17 Axon guidance: modeling axonal growth in T-Junction assayCsaba Forro, Harald Dermutz, László Demkó, János VörösP19 Transient cell assembly networks encode persistent spatial memoriesYuri Dabaghian, Andrey BabichevP20 Theory of population coupling and applications to describe high order correlations in large populations of interacting neuronsHaiping HuangP21 Design of biologically-realistic simulations for motor controlSergio Verduzco-FloresP22 Towards understanding the functional impact of the behavioural variability of neuronsFilipa Dos Santos, Peter AndrasP23 Different oscillatory dynamics underlying gamma entrainment deficits in schizophreniaChristoph Metzner, Achim Schweikard, Bartosz ZurowskiP24 Memory recall and spike frequency adaptationJames P. Roach, Leonard M. Sander, Michal R. ZochowskiP25 Stability of neural networks and memory consolidation preferentially occur near criticalityQuinton M. Skilling, Nicolette Ognjanovski, Sara J. Aton, Michal ZochowskiP26 Stochastic Oscillation in Self-Organized Critical States of Small Systems: Sensitive Resting State in Neural SystemsSheng-Jun Wang, Guang Ouyang, Jing Guang, Mingsha Zhang, K. Y. Michael Wong, Changsong ZhouP27 Neurofield: a C++ library for fast simulation of 2D neural field modelsPeter A. Robinson, Paula Sanz-Leon, Peter M. Drysdale, Felix Fung, Romesh G. Abeysuriya, Chris J. Rennie, Xuelong ZhaoP28 Action-based grounding: Beyond encoding/decoding in neural codeYoonsuck Choe, Huei-Fang YangP29 Neural computation in a dynamical system with multiple time scalesYuanyuan Mi, Xiaohan Lin, Si WuP30 Maximum entropy models for 3D layouts of orientation selectivityJoscha Liedtke, Manuel Schottdorf, Fred WolfP31 A behavioral assay for probing computations underlying curiosity in rodentsYoriko Yamamura, Jeffery R. WickensP32 Using statistical sampling to balance error function contributions to optimization of conductance-based modelsTimothy Rumbell, Julia Ramsey, Amy Reyes, Danel Draguljić, Patrick R. Hof, Jennifer Luebke, Christina M. WeaverP33 Exploration and implementation of a self-growing and self-organizing neuron network building algorithmHu He, Xu Yang, Hailin Ma, Zhiheng Xu, Yuzhe WangP34 Disrupted resting state brain network in obese subjects: a data-driven graph theory analysisKwangyeol Baek, Laurel S. Morris, Prantik Kundu, Valerie VoonP35 Dynamics of cooperative excitatory and inhibitory plasticityEverton J. Agnes, Tim P. VogelsP36 Frequency-dependent oscillatory signal gating in feed-forward networks of integrate-and-fire neuronsWilliam F. Podlaski, Tim P. VogelsP37 Phenomenological neural model for adaptation of neurons in area ITMartin Giese, Pradeep Kuravi, Rufin VogelsP38 ICGenealogy: towards a common topology of neuronal ion channel function and genealogy in model and experimentAlexander Seeholzer, William Podlaski, Rajnish Ranjan, Tim VogelsP39 Temporal input discrimination from the interaction between dynamic synapses and neural subthreshold oscillationsJoaquin J. Torres, Fabiano Baroni, Roberto Latorre, Pablo VaronaP40 Different roles for transient and sustained activity during active visual processingBart Gips, Eric Lowet, Mark J. Roberts, Peter de Weerd, Ole Jensen, Jan van der EerdenP41 Scale-free functional networks of 2D Ising model are highly robust against structural defects: neuroscience implicationsAbdorreza Goodarzinick, Mohammad D. Niry, Alireza ValizadehP42 High frequency neuron can facilitate propagation of signal in neural networksAref Pariz, Shervin S. Parsi, Alireza ValizadehP43 Investigating the effect of Alzheimer’s disease related amyloidopathy on gamma oscillations in the CA1 region of the hippocampusJulia M. Warburton, Lucia Marucci, Francesco Tamagnini, Jon Brown, Krasimira Tsaneva-AtanasovaP44 Long-tailed distributions of inhibitory and excitatory weights in a balanced network with eSTDP and iSTDPFlorence I. Kleberg, Jochen TrieschP45 Simulation of EMG recording from hand muscle due to TMS of motor cortexBahar Moezzi, Nicolangelo Iannella, Natalie Schaworonkow, Lukas Plogmacher, Mitchell R. Goldsworthy, Brenton Hordacre, Mark D. McDonnell, Michael C. Ridding, Jochen TrieschP46 Structure and dynamics of axon network formed in primary cell cultureMartin Zapotocky, Daniel Smit, Coralie Fouquet, Alain TrembleauP47 Efficient signal processing and sampling in random networks that generate variabilitySakyasingha Dasgupta, Isao Nishikawa, Kazuyuki Aihara, Taro ToyoizumiP48 Modeling the effect of riluzole on bursting in respiratory neural networksDaniel T. Robb, Nick Mellen, Natalia ToporikovaP49 Mapping relaxation training using effective connectivity analysisRongxiang Tang",
                    "citation": "T. Sharpee, A. Destexhe, M. Kawato, et al. (2016). 25th Annual Computational Neuroscience Meeting: CNS-2016. BMC Neuroscience. Citations: 81, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Table of contents Functional advantages of cell-type heterogeneity in neural circuits, Dynamics and biomarkers of mental disorders, and Objective criteria for computational neuroscience model selection are presented."
                    },
                    "url": "https://www.semanticscholar.org/paper/23a30ca55aef3e307c9e761b22a34080ebf6985f"
                },
                {
                    "title": "Exploring active ingredients and function mechanisms of Ephedra-bitter almond for prevention and treatment of Corona virus disease 2019 (COVID-19) based on network pharmacology",
                    "abstract": "Background COVID-19 has caused a global pandemic, and there is no wonder drug for epidemic control at present. However, many clinical practices have shown that traditional Chinese medicine has played an important role in treating the outbreak. Among them, ephedra-bitter almond is a common couplet medicine in anti-COVID-19 prescriptions. This study aims to conduct an exploration of key components and mechanisms of ephedra-bitter almond anti-COVID-19 based on network pharmacology. Material and methods We collected and screened potential active components of ephedra-bitter almond based on the TCMSP Database, and we predicted targets of the components. Meanwhile, we collected relevant targets of COVID-19 through the GeneCards and CTD databases. Then, the potential targets of ephedra-bitter almond against COVID-19 were screened out. The key components, targets, biological processes, and pathways of ephedra-bitter almond anti-COVID-19 were predicted by constructing the relationship network of herb-component-target (H-C-T), protein-protein interaction (PPI), and functional enrichment. Finally, the key components and targets were docked by AutoDock Vina to explore their binding mode. Results Ephedra-bitter almond played an overall regulatory role in anti-COVID-19 via the patterns of multi-component-target-pathway. In addition, some key components of ephedra-bitter almond, such as β-sitosterol, estrone, and stigmasterol, had high binding activity to 3CL and ACE2 by molecular docking simulation, which provided new molecular structures for new drug development of COVID-19. Conclusion Ephedra-bitter almonds were used to prevent and treat COVID-19 through directly inhibiting the virus, regulating immune responses, and promoting body repair. However, this work is a prospective study based on data mining, and the findings need to be interpreted with caution.",
                    "citation": "K. Gao, Yan-Ping Song, Anna Song (2020). Exploring active ingredients and function mechanisms of Ephedra-bitter almond for prevention and treatment of Corona virus disease 2019 (COVID-19) based on network pharmacology. BioData Mining. Citations: 37, Influential: 1.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Ephedra-bitter almonds were used to prevent and treat COVID-19 through directly inhibiting the virus, regulating immune responses, and promoting body repair, and the findings need to be interpreted with caution."
                    },
                    "url": "https://www.semanticscholar.org/paper/4618681fab1188420edf158c434e032300780135"
                },
                {
                    "title": "Limits of Friendship Networks in Predicting Epidemic Risk",
                    "abstract": "The spread of an infection on a real-world social network is determined by the interplay of two processes: the dynamics of the network, whose structure changes over time according to the encounters between individuals, and the dynamics on the network, whose nodes can infect each other after an encounter. Physical encounter is the most common vehicle for the spread of infectious diseases, but detailed information about encounters is often unavailable because expensive, unpractical to collect or privacy sensitive. We asks whether the friendship ties between the individuals in a social network successfully predict who is at risk. Using a dataset from a popular online review service, we build a time-varying network that is a proxy of physical encounter between users and a static network based on reported friendship. Through computer simulations, we compare infection processes on the resulting networks and show that, whereas distance on the friendship network is correlated to epidemic risk, friendship provides a poor identification of the individuals at risk if the infection is driven by physical encounter. Such limit is not due to the randomness of the infection, but to the structural differences of the two networks. In contrast to the macroscopic similarity between processes spreading on different networks, the differences in local connectivity determined by the two definitions of edges result in striking differences between the dynamics at a microscopic level. Despite the limits highlighted, we show that periodical and relatively infrequent monitoring of the real infection on the encounter network allows to correct the predicted infection on the friendship network and to achieve satisfactory prediction accuracy. In addition, the friendship network contains valuable information to effectively contain epidemic outbreaks when a limited budget is available for immunization.",
                    "citation": "Lorenzo Coviello, M. Franceschetti, Iyad Rahwan (2015). Limits of Friendship Networks in Predicting Epidemic Risk. arXiv.org. Citations: 3, Influential: 1.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work builds a time-varying network that is a proxy of physical encounter between users and a static network based on reported friendship and shows that, whereas distance on the friendship network is correlated to epidemic risk, friendship provides a poor identification of the individuals at risk if the infection is driven by physical encounter."
                    },
                    "url": "https://www.semanticscholar.org/paper/ca3a64c898d6d172ae9bb82880aa6e807601b374"
                },
                {
                    "title": "A Multigroup SEIR Epidemic Model with Vaccination on Heterogeneous Network",
                    "abstract": null,
                    "citation": "P. Boonkrong (2016). A Multigroup SEIR Epidemic Model with Vaccination on Heterogeneous Network. Unknown Journal. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A multigroup SEIR epidemic model with vaccination is firstly introduced and its basic reproduction number is derived for epidemiological prediction and an algorithm to generate complex network representing heterogeneous structure of individuals is heuristically proposed."
                    },
                    "url": "https://www.semanticscholar.org/paper/08b0c468c7409dcea287ee35c62e6a69583de937"
                }
            ],
            "summary": ""
        },
        {
            "query": "SEIR model parameter values transmission rate incubation recovery rate initial conditions network epidemiology",
            "papers": [
                {
                    "title": "Epidemic thresholds in dynamic contact networks",
                    "abstract": null,
                    "citation": "E. Volz, L. Meyers (2009). Epidemic thresholds in dynamic contact networks. Journal of the Royal Society Interface. Citations: 197, Influential: 4.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown that social mixing fundamentally changes the epidemiological landscape and, consequently, that static network approximations of dynamic networks can be inadequate."
                    },
                    "url": "https://www.semanticscholar.org/paper/2fff938b26bbc6a981c7c0645126a4dc9e12fd78"
                },
                {
                    "title": "Toward the Impact of Non-pharmaceutical Interventions and Vaccination on the COVID-19 Pandemic With Time-Dependent SEIR Model",
                    "abstract": "The outbreak of COVID-19, caused by the SARS-CoV-2 coronavirus, has been declared a pandemic by the World Health Organization (WHO) in March, 2020 and rapidly spread to over 210 countries and territories around the world. By December 24, there are over 77M cumulative confirmed cases with more than 1.72M deaths worldwide. To mathematically describe the dynamic of the COVID-19 pandemic, we propose a time-dependent SEIR model considering the incubation period. Furthermore, we take immunity, reinfection, and vaccination into account and propose the SEVIS model. Unlike the classic SIR based models with constant parameters, our dynamic models not only predicts the number of cases, but also monitors the trajectories of changing parameters, such as transmission rate, recovery rate, and the basic reproduction number. Tracking these parameters, we observe the significant decrease in the transmission rate in the U.S. after the authority announced a series of orders aiming to prevent the spread of the virus, such as closing non-essential businesses and lockdown restrictions. Months later, as restrictions being gradually lifted, we notice a new surge of infection emerges as the transmission rates show increasing trends in some states. Using our epidemiology models, people can track, timely monitor, and predict the COVID-19 pandemic with precision. To illustrate and validate our model, we use the national level data (the U.S.) and the state level data (New York and North Dakota), and the resulting relative prediction errors for the infected group and recovered group are mostly lower than 0.5%. We also simulate the long-term development of the pandemic based on our proposed models to explore when the crisis will end under certain conditions.",
                    "citation": "Yuexin Li, Linqiang Ge, Yang Zhou, et al. (2021). Toward the Impact of Non-pharmaceutical Interventions and Vaccination on the COVID-19 Pandemic With Time-Dependent SEIR Model. Frontiers in Artificial Intelligence. Citations: 20, Influential: 1.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The dynamic of the COVID-19 pandemic is mathematically described and a time-dependent SEIR model considering the incubation period is proposed and the SEVIS model, which takes immunity, reinfection, and vaccination into account and proposes the SE VIS model is proposed."
                    },
                    "url": "https://www.semanticscholar.org/paper/971f7e5ebb641c40d58e128c8d3d1a086231d3f8"
                },
                {
                    "title": "Bayesian forecasting of monkeypox epidemics in Central and East Africa using SEIR model and cumulative case data",
                    "abstract": null,
                    "citation": "Musa Rabiu, Michael Shatalov, Kekana Malesela (2025). Bayesian forecasting of monkeypox epidemics in Central and East Africa using SEIR model and cumulative case data. The European Physical Journal Plus. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A Bayesian Susceptible–Exposed–Infectious–Infectious–Recovered (SEIR) modeling framework is applied to investigate and forecast mpox transmission dynamics in South Sudan, the Democratic Republic of Congo, Rwanda, and Kenya to provide country-specific insights essential for tailoring interventions."
                    },
                    "url": "https://www.semanticscholar.org/paper/6b64cc6c57f412c34024c5c16f422ef985d2cede"
                },
                {
                    "title": "Modeling the Transmission Dynamics of Airborne Infectious Diseases Using a Hybrid SEIR and Wells–Riley Framework for Risk Assessment and Control Strategy Evaluation",
                    "abstract": "\n Understanding the transmission dynamics of infectious diseases is crucial for developing effective mitigation strategies. This study employs the airborne disease model combined with the SEIR epidemic model to analyze disease spread in enclosed environments while accounting for key epidemiological and environmental factors. The model incorporates parameters such as infection rate (\n β\n ), incubation rate (\n α\n ), recovery rate (\n γ\n ), air exchange rates (ACH), quanta generation rate (\n q\n ), room volume (\n V\n ), and pulmonary ventilation rate (\n p\n ), alongside varying population sizes (\n N\n ). By simulating different scenarios over a 50‐day period, we assess the impact of initial infection conditions, recovery rates, and effective contact rates on epidemic progression. Our findings highlight the significant influence of ventilation and contact rates on disease spread, demonstrating that higher air exchange rates can mitigate transmission risks. The results provide critical insights into optimizing infection control strategies, particularly in indoor settings, by emphasizing the importance of air change rate, early interventions, and limiting contact rates.\n",
                    "citation": "Abu Raihan Ibna Ali, Nurul Ahad Akil, Tafsirul Hassan (2025). Modeling the Transmission Dynamics of Airborne Infectious Diseases Using a Hybrid SEIR and Wells–Riley Framework for Risk Assessment and Control Strategy Evaluation. Indoor Air: International Journal of Indoor Environment and Health. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The findings highlight the significant influence of ventilation and contact rates on disease spread, demonstrating that higher air exchange rates can mitigate transmission risk, and provide critical insights into optimizing infection control strategies, particularly in indoor settings."
                    },
                    "url": "https://www.semanticscholar.org/paper/4af8805fe25eafdfb8ec2bbebf7d4938345da39a"
                },
                {
                    "title": "An Edge-Based Model of SEIR Epidemics on Static Random Networks",
                    "abstract": null,
                    "citation": "Cherrylyn P Alota, C. P. Pilar-Arceo, A. de los Reyes V (2020). An Edge-Based Model of SEIR Epidemics on Static Random Networks. Bulletin of Mathematical Biology. Citations: 5, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results in this paper can be used as an alternative way of explaining the spread of disease and it provides implications on the control strategies applied to mitigate the disease transmission."
                    },
                    "url": "https://www.semanticscholar.org/paper/13623e6977e9b6a0641b3059dc19251b94b51653"
                },
                {
                    "title": "RLIM: a recursive and latent infection model for the prediction of US COVID-19 infections and turning points",
                    "abstract": "Initially found in Hubei, Wuhan, and identified as a novel virus of the coronavirus family by the WHO, COVID-19 has spread worldwide at exponential speed, causing millions of deaths and public fear. Currently, the USA, India, Brazil, and other parts of the world are experiencing a secondary wave of COVID-19. However, the medical, mathematical, and pharmaceutical aspects of its transmission, incubation, and recovery processes are still unclear. The classical susceptible–infected–recovered model has limitations in describing the dynamic behavior of COVID-19. Hence, it is necessary to introduce a recursive, latent model to predict the number of future COVID-19 infection cases in the USA. In this article, a dynamic recursive and latent infection model (RLIM) based on the classical SEIR model is proposed to predict the number of COVID-19 infections. Given COVID-19 infection and recovery data for a certain period, the RLIM is able to fit current values and produce an optimal set of parameters with a minimum error rate according to actual reported numbers. With these optimal parameters assigned, the RLIM model then becomes able to produce predictions of infection numbers within a certain period. To locate the turning point of COVID-19 transmission, an initial value for the secondary infection rate is given to the RLIM algorithm for calculation. RLIM will then calculate the secondary infection rates of a continuous time series with an iterative search strategy to speed up the convergence of the prediction outcomes and minimize the maximum square errors. Compared with other forecast algorithms, RLIM is able to adapt the COVID-19 infection curve faster and more accurately and, more importantly, provides a way to identify the turning point in virus transmission by searching for the equilibrium between recoveries and new infections. Simulations of four US states show that with the secondary infection rate ω\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\omega $$\\end{document} initially set to 0.5 within the selected latent period of 14 days, RLIM is able to minimize this value at 0.07 and reach an equilibrium condition. A successful forecast is generated using New York state’s COVID-19 transmission, in which a turning point is predicted to emerge on January 31, 2021.",
                    "citation": "Xiang Yu, Lihua Lu, Jianyi Shen, et al. (2021). RLIM: a recursive and latent infection model for the prediction of US COVID-19 infections and turning points. Nonlinear dynamics. Citations: 5, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A dynamic recursive and latent infection model (RLIM) based on the classical SEIR model is proposed to predict the number of COVID-19 infections in the USA and provides a way to identify the turning point in virus transmission by searching for the equilibrium between recoveries and new infections."
                    },
                    "url": "https://www.semanticscholar.org/paper/31cfcfc96337cc0886b5d5486975903dfd83b2cd"
                },
                {
                    "title": "The Twenty-First Annual Nebraska Conference for Undergraduate Women in Mathematics",
                    "abstract": null,
                    "citation": "Julia Bohman (2019). The Twenty-First Annual Nebraska Conference for Undergraduate Women in Mathematics. Unknown Journal. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The present study was conducted to investigate the impact vaccinations and hygiene had on the 2009 H1N1 epidemic in the Denver metropolitan area and found that vaccinations contributed to less total infected individuals during the 2009-2010 season."
                    },
                    "url": "https://www.semanticscholar.org/paper/921ab92c355f480a5d6b5963e04e6cf2917a151d"
                }
            ],
            "summary": ""
        },
        {
            "query": "Analytical epidemic thresholds SEIR models on heterogeneous networks vs homogeneous networks",
            "papers": [
                {
                    "title": "Metapopulation epidemic models with heterogeneous mixing and travel behaviour",
                    "abstract": "BackgroundDetermining the pandemic potential of an emerging infectious disease and how it depends on the various epidemic and population aspects is critical for the preparation of an adequate response aimed at its control. The complex interplay between population movements in space and non-homogeneous mixing patterns have so far hindered the fundamental understanding of the conditions for spatial invasion through a general theoretical framework. To address this issue, we present an analytical modelling approach taking into account such interplay under general conditions of mobility and interactions, in the simplifying assumption of two population classes.MethodsWe describe a spatially structured population with non-homogeneous mixing and travel behaviour through a multi-host stochastic epidemic metapopulation model. Different population partitions, mixing patterns and mobility structures are considered, along with a specific application for the study of the role of age partition in the early spread of the 2009 H1N1 pandemic influenza.ResultsWe provide a complete mathematical formulation of the model and derive a semi-analytical expression of the threshold condition for global invasion of an emerging infectious disease in the metapopulation system. A rich solution space is found that depends on the social partition of the population, the pattern of contacts across groups and their relative social activity, the travel attitude of each class, and the topological and traffic features of the mobility network. Reducing the activity of the less social group and reducing the cross-group mixing are predicted to be the most efficient strategies for controlling the pandemic potential in the case the less active group constitutes the majority of travellers. If instead traveling is dominated by the more social class, our model predicts the existence of an optimal across-groups mixing that maximises the pandemic potential of the disease, whereas the impact of variations in the activity of each group is less important.ConclusionsThe proposed modelling approach introduces a theoretical framework for the study of infectious diseases spread in a population with two layers of heterogeneity relevant for the local transmission and the spatial propagation of the disease. It can be used for pandemic preparedness studies to identify adequate interventions and quantitatively estimate the corresponding required effort, as well as in an emerging epidemic situation to assess the pandemic potential of the pathogen from population and early outbreak data.",
                    "citation": "A. Apolloni, C. Poletto, J. Ramasco, et al. (2014). Metapopulation epidemic models with heterogeneous mixing and travel behaviour. Theoretical Biology and Medical Modelling. Citations: 93, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The proposed modelling approach introduces a theoretical framework for the study of infectious diseases spread in a population with two layers of heterogeneity relevant for the local transmission and the spatial propagation of the disease."
                    },
                    "url": "https://www.semanticscholar.org/paper/6aa00c34fb81ada490558dbb99c73b5320185fa0"
                },
                {
                    "title": "Age-specific contacts and travel patterns in the spatial spread of 2009 H1N1 influenza pandemic",
                    "abstract": "BackgroundConfirmed H1N1 cases during late spring and summer 2009 in various countries showed a substantial age shift between importations and local transmission cases, with adults mainly responsible for seeding unaffected regions and children most frequently driving community outbreaks.MethodsWe introduce a multi-host stochastic metapopulation model with two age classes to analytically investigate the role of a heterogeneously mixing population and its associated non-homogeneous travel behaviors on the risk of a major epidemic. We inform the model with demographic data, contact data and travel statistics of Europe and Mexico, and calibrate it to the 2009 H1N1 pandemic early outbreak. We allow for variations of the model parameters to explore the conditions of invasion under different scenarios.ResultsWe derive the expression for the potential of global invasion of the epidemic that depends on the transmissibility of the pathogen, the transportation network and mobility features, the demographic profile and the mixing pattern. Higher assortativity in the contact pattern greatly increases the probability of spatial containment of the epidemic, this effect being contrasted by an increase in the social activity of adults vs. children. Heterogeneous features of the mobility network characterizing its topology and traffic flows strongly favor the invasion of the pathogen at the spatial level, as also a larger fraction of children traveling. Variations in the demographic profile and mixing habits across countries lead to heterogeneous outbreak situations. Model results are compatible with the H1N1 spatial transmission dynamics observed.ConclusionsThis work illustrates the importance of considering age-dependent mixing profiles and mobility features coupled together to study the conditions for the spatial invasion of an emerging influenza pandemic. Its results allow the immediate assessment of the risk of a major epidemic for a specific scenario upon availability of data, and the evaluation of the potential effectiveness of public health interventions targeting specific age groups, their interactions and mobility behaviors. The approach provides a general modeling framework that can be used for other types of partitions of the host population and applied to different settings.",
                    "citation": "A. Apolloni, C. Poletto, V. Colizza (2013). Age-specific contacts and travel patterns in the spatial spread of 2009 H1N1 influenza pandemic. BMC Infectious Diseases. Citations: 84, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A multi-host stochastic metapopulation model with two age classes is introduced to analytically investigate the role of a heterogeneously mixing population and its associated non-homogeneous travel behaviors on the risk of a major epidemic."
                    },
                    "url": "https://www.semanticscholar.org/paper/d3be66618989023f40053f26140188c9ba7959ee"
                },
                {
                    "title": "Contagion processes on the static and activity driven coupling networks",
                    "abstract": "The evolution of network structure and the spreading of epidemic are common coexistent dynamical processes. In most cases, network structure is treated as either static or time-varying, supposing the whole network is observed in the same time window. In this paper, we consider the epidemics spreading on a network which has both static and time-varying structures. Meanwhile, the time-varying part and the epidemic spreading are supposed to be of the same time scale. We introduce a static and activity-driven coupling (SADC) network model to characterize the coupling between the static (\"strong\") structure and the dynamic (\"weak\") structure. Epidemic thresholds of the SIS and SIR models are studied using the SADC model both analytically and numerically under various coupling strategies, where the strong structure is of homogeneous or heterogeneous degree distribution. Theoretical thresholds obtained from the SADC model can both recover and generalize the classical results in static and time-varying networks. It is demonstrated that a weak structure might make the epidemic threshold low in homogeneous networks but high in heterogeneous cases. Furthermore, we show that the weak structure has a substantive effect on the outbreak of the epidemics. This result might be useful in designing some efficient control strategies for epidemics spreading in networks.",
                    "citation": "Yanjun Lei, Xin Jiang, Quantong Guo, et al. (2015). Contagion processes on the static and activity driven coupling networks. Physical Review E. Citations: 24, Influential: 1.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is demonstrated that a weak structure might make the epidemic threshold low in homogeneous networks but high in heterogeneous cases, and it is shown that the weak structure has a substantive effect on the outbreak of the epidemics."
                    },
                    "url": "https://www.semanticscholar.org/paper/2bd9ee417bfe137588dc8d44cf2292df16c646ae"
                },
                {
                    "title": "The Impact of Deniers on Epidemics: A Temporal Network Model",
                    "abstract": "We propose a novel network epidemic model to elucidate the impact of deniers on the spread of epidemic diseases. Specifically, we study the spread of a recurrent epidemic disease, whose progression is captured by a susceptible–infected–susceptible model, in a population partitioned into two groups: cautious individuals and deniers. Cautious individuals may adopt self-protective behaviors, possibly incentivized by information campaigns implemented by public authorities; on the contrary, deniers reject their adoption. Through a mean-field approach, we analytically derive the epidemic threshold for large-scale homogeneous networks, shedding light onto the role of deniers in shaping the course of an epidemic outbreak. Specifically, our analytical insight suggests that even a small minority of deniers may jeopardize the effort of public health authorities when the population is highly polarized. Numerical results extend our analytical findings to heterogeneous networks.",
                    "citation": "Lorenzo Zino, A. Rizzo, M. Porfiri (2023). The Impact of Deniers on Epidemics: A Temporal Network Model. IEEE Control Systems Letters. Citations: 8, Influential: 1.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/dc1306e6051b0be8256236e83af0d9be8586b5fd"
                },
                {
                    "title": "Modeling Epidemics on Multiplex Networks: Epidemic Threshold and Basic Reproduction Number",
                    "abstract": "Accurate epidemic forecasting requires models that account for the layered and heterogeneous nature of real social interactions. The basic reproduction number $\\mathcal R_0$ calculated from models that assume homogeneous mixing or single-layer contact structures have limited applicability to complex social systems. Here, we propose an expression of $\\mathcal R_0$ in the context of multiplex networks, enabling the analysis of disease transmission across multiple social layers. We adapt the Degree-Based Mean-Field (DBMF) SIR model for single-layered complex networks to the multiplex setting, where each layer has its own degree distribution and infection rate. Using the Next Generation Matrix method, we derive an analytical expression for the basic reproduction number $\\mathcal R_0$. Numerical integration of the multiplex DBMF equations shows that $\\mathcal R_0 = 1$ marks the epidemic threshold and governs the functional dependence of key outbreak indicators. In addition to the exact result for the $\\mathcal R_0$, we provide an approximation denoted as $\\tau$, which is easier to compute and more straightforward to interpret in terms of the parameters of the system, and shares most of the expected properties of the basic reproduction number. Stochastic agent-based simulations confirm these results, demonstrating a direct correspondence between $\\tau$ and the average number of secondary infections in the early epidemic phase, in line with the interpretation of $\\mathcal R_0$. This research provides a robust generalization of $\\mathcal R_0$ for layered contact structures, offering a more realistic basis for epidemic forecasting and the design of intervention strategies.",
                    "citation": "E. Rozan, M. I. Simoy, Sebastian Bouzat, et al. (2025). Modeling Epidemics on Multiplex Networks: Epidemic Threshold and Basic Reproduction Number. Unknown Journal. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This research provides a robust generalization of the basic reproduction number of $\\mathcal R_0$ for layered contact structures, offering a more realistic basis for epidemic forecasting and the design of intervention strategies."
                    },
                    "url": "https://www.semanticscholar.org/paper/8f0d4237baac356d7cf6ab0fc52bbfdd6ffbda75"
                },
                {
                    "title": "Impact of contact rate on epidemic spreading in complex networks",
                    "abstract": "Contact reduction is an effective strategy to mitigate the spreading of epidemic. However, the existing reaction–diffusion equations for infectious disease are unable to characterize this effect. Thus, we here propose an extended susceptible-infected-recovered model by incorporating contact rate into the standard SIR model, and concentrate on investigating its impact on epidemic transmission. We analytically derive the epidemic thresholds on homogeneous and heterogeneous networks, respectively. The effects of contact rate on spreading speed, scale and outbreak threshold are explored on ER and SF networks. Simulations results show that epidemic dissemination is significantly mitigated when contact rate is reduced. Importantly, epidemic spreads faster on heterogeneous networks while broader on homogeneous networks, and the outbreak thresholds of the former are smaller.",
                    "citation": "Huayan Pei, Guanghui Yan, Yaning Huang (2023). Impact of contact rate on epidemic spreading in complex networks. European Physical Journal B : Condensed Matter Physics. Citations: 7, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Simulations results show that epidemic dissemination is significantly mitigated when contact rate is reduced, and epidemic spreads faster on heterogeneous networks while broader on homogeneous networks, and the outbreak thresholds of the former are smaller."
                    },
                    "url": "https://www.semanticscholar.org/paper/7b1af17c48f70365bc9806945301849278c2ec9b"
                },
                {
                    "title": "Mapping Financial Stability: Applying SEIR Model and Complex Network Theory to Mitigate Risk Contagion",
                    "abstract": ": This study applies complex network theory to financial systems, using a SEIR model to analyze risk spread and the effect of rescue strategies. Key findings include identifying epidemic thresholds that indicate contagion risk and demonstrating that policy interventions can lower this risk. Both homogeneous and heterogeneous networks are examined, showing consistent thresholds. Analysis reveals that stronger rescue efforts lead to lower contagion risk. The model is tested against real data from Chinese and American stock markets, confirming the theory and highlighting how various parameters affect risk distribution. The research supports the development of early warning systems and regulatory improvements for financial stability.",
                    "citation": "Tianyang Liu (2024). Mapping Financial Stability: Applying SEIR Model and Complex Network Theory to Mitigate Risk Contagion. Proceedings of the 3rd International Conference on Big Data Economy and Digital Management, BDEDM 2024, January 12–14, 2024, Ningbo, China. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/6745ed7f0ccf00b0be8646e8b30103179fc0fee9"
                }
            ],
            "summary": ""
        },
        {
            "query": "SIRS model oscillations small-world network social contagion",
            "papers": [
                {
                    "title": "Heterogeneity and Network Structure in the Dynamics of Diffusion: Comparing Agent-Based and Differential Equation Models",
                    "abstract": "When is it better to use agent-based (AB) models, and when should differential equation (DE) models be used? Whereas DE models assume homogeneity and perfect mixing within compartments, AB models can capture heterogeneity across individuals and in the network of interactions among them. AB models relax aggregation assumptions, but entail computational and cognitive costs that may limit sensitivity analysis and model scope. Because resources are limited, the costs and benefits of such disaggregation should guide the choice of models for policy analysis. Using contagious disease as an example, we contrast the dynamics of a stochastic AB model with those of the analogous deterministic compartment DE model. We examine the impact of individual heterogeneity and different network topologies, including fully connected, random, Watts-Strogatz small world, scale-free, and lattice networks. Obviously, deterministic models yield a single trajectory for each parameter set, while stochastic models yield a distribution of outcomes. More interestingly, the DE and mean AB dynamics differ for several metrics relevant to public health, including diffusion speed, peak load on health services infrastructure, and total disease burden. The response of the models to policies can also differ even when their base case behavior is similar. In some conditions, however, these differences in means are small compared to variability caused by stochastic events, parameter uncertainty, and model boundary. We discuss implications for the choice among model types, focusing on policy design. The results apply beyond epidemiology: from innovation adoption to financial panics, many important social phenomena involve analogous processes of diffusion and social contagion.",
                    "citation": "H. Rahmandad, J. Sterman (2004). Heterogeneity and Network Structure in the Dynamics of Diffusion: Comparing Agent-Based and Differential Equation Models. Management Sciences. Citations: 785, Influential: 32.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The dynamics of a stochastic AB model with those of the analogous deterministic compartment DE model are contrasted, and the impact of individual heterogeneity and different network topologies, including fully connected, random, Watts-Strogatz small world, scale-free, and lattice networks are examined."
                    },
                    "url": "https://www.semanticscholar.org/paper/a0fe177a49b9c465065373cf76b949d13e6fccc2"
                },
                {
                    "title": "Financial Networks",
                    "abstract": null,
                    "citation": "Douglas Gale, Shachar Kariv, X. Freixas (2007). Financial Networks. Unknown Journal. Citations: 113, Influential: 5.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/ae3117a81adb47fd08b915ab60efa7c3b6d3b0f2"
                },
                {
                    "title": "Influence of Local Information on Social Simulations in Small-World Network Models",
                    "abstract": null,
                    "citation": "Chung-Yuan Huang, Chuen-Tsai Sun, Hsun-Cheng Lin (2005). Influence of Local Information on Social Simulations in Small-World Network Models. Journal of Artificial Societies and Social Simulation. Citations: 43, Influential: 4.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Results from experimental simulations show that the percentage of strong individuals should be considered significant local information, but vertex degree influences and the distribution patterns of weak individuals should not, and encourage a future emphasis on setting and the proportions of specific values of local information related to infection strength or resistance."
                    },
                    "url": "https://www.semanticscholar.org/paper/f3b6e274634bb6d1ed92ca3276e073244ad57dd1"
                },
                {
                    "title": "Controlling epidemic spread by social distancing: Do it well or not at all",
                    "abstract": "BackgroundExisting epidemiological models have largely tended to neglect the impact of individual behaviour on the dynamics of diseases. However, awareness of the presence of illness can cause people to change their behaviour by, for example, staying at home and avoiding social contacts. Such changes can be used to control epidemics but they exact an economic cost. Our aim is to study the costs and benefits of using individual-based social distancing undertaken by healthy individuals as a form of control.MethodsOur model is a standard SIR model superimposed on a spatial network, without and with addition of small-world interactions. Disease spread is controlled by allowing susceptible individuals to temporarily reduce their social contacts in response to the presence of infection within their local neighbourhood. We ascribe an economic cost to the loss of social contacts, and weigh this against the economic benefit gained by reducing the impact of the epidemic. We study the sensitivity of the results to two key parameters, the individuals’ attitude to risk and the size of the awareness neighbourhood.ResultsDepending on the characteristics of the epidemic and on the relative economic importance of making contacts versus avoiding infection, the optimal control is one of two extremes: either to adopt a highly cautious control, thereby suppressing the epidemic quickly by drastically reducing contacts as soon as disease is detected; or else to forego control and allow the epidemic to run its course. The worst outcome arises when control is attempted, but not cautiously enough to cause the epidemic to be suppressed. The next main result comes from comparing the size of the neighbourhood of which individuals are aware to that of the neighbourhood within which transmission can occur. The control works best when these sizes match and is particularly ineffective when the awareness neighbourhood is smaller than the infection neighbourhood. The results are robust with respect to inclusion of long-range, small-world links which destroy the spatial structure, regardless of whether individuals can or cannot control them. However, addition of many non-local links eventually makes control ineffective.ConclusionsThese results have implications for the design of control strategies using social distancing: a control that is too weak or based upon inaccurate knowledge, may give a worse outcome than doing nothing.",
                    "citation": "S. Maharaj, A. Kleczkowski (2012). Controlling epidemic spread by social distancing: Do it well or not at all. BMC Public Health. Citations: 194, Influential: 4.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The costs and benefits of using individual-based social distancing undertaken by healthy individuals as a form of control and the sensitivity of the results to two key parameters, the individuals’ attitude to risk and the size of the awareness neighbourhood are studied."
                    },
                    "url": "https://www.semanticscholar.org/paper/4b92357afea168410a305eca0e593b7955f08598"
                },
                {
                    "title": "Complex contagion and the weakness of long ties in social networks: revisited",
                    "abstract": null,
                    "citation": "Golnaz Ghasemiesfeh, Roozbeh Ebrahimi, Jie Gao (2013). Complex contagion and the weakness of long ties in social networks: revisited. ACM Conference on Economics and Computation. Citations: 88, Influential: 3.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Three small world models are studied and rigorous analysis on the diffusion speed of a k-complex contagion, in which a node becomes active only when at least k of its neighbors are active, showing that compared to simple contagions, weak ties are not as effective in spreading complex contagions due to the lack of simultaneous active contacts."
                    },
                    "url": "https://www.semanticscholar.org/paper/12c0b98f1bd294e6b9338730f665d7406b60e59f"
                },
                {
                    "title": "Information Propagation in Clustered Multilayer Networks",
                    "abstract": "In today's world, individuals interact with each other in more complicated patterns than ever. Some individuals engage through online social networks (e.g., Facebook, Twitter), while some communicate only through conventional ways (e.g., face-to-face). Therefore, understanding the dynamics of information propagation among humans calls for a multi-layer network model where an online social network is conjoined with a physical network. In this work, we initiate a study of information diffusion in a clustered multi-layer network model, where all constituent layers are random networks with high clustering. We assume that information propagates according to the SIR model and with different information transmissibility across the networks. We give results for the conditions, probability, and size of information epidemics, i.e., cases where information starts from a single individual and reaches a positive fraction of the population. We show that increasing the level of clustering in either one of the layers increases the epidemic threshold and decreases the final epidemic size in the whole system. An interesting finding is that information with low transmissibility spreads more effectively with a small but densely connected social network, whereas highly transmissible information spreads better with the help of a large but loosely connected social network.",
                    "citation": "Yong Zhuang, Osman Yağan (2015). Information Propagation in Clustered Multilayer Networks. IEEE Transactions on Network Science and Engineering. Citations: 64, Influential: 3.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown that increasing the level of clustering in either one of the layers increases the epidemic threshold and decreases the final epidemic size in the whole system, whereas highly transmissible information spreads better with the help of a large but loosely connected social network."
                    },
                    "url": "https://www.semanticscholar.org/paper/df942cc43a83bf0fd8073edd79dea7becbd1c9e9"
                },
                {
                    "title": "Diffusion/Contagion Processes on Social Networks",
                    "abstract": "This study models how new ideas, practices, or diseases spread within and between communities, the diffusion of innovations or contagion. Several factors affect diffusion such as the characteristics of the initial adopters, the seeds; the structure of the network over which diffusion occurs; and the shape of the threshold distribution, which is the proportion of prior adopting peers needed for the focal individual to adopt. In this study, seven seeding conditions are modeled: (1) three opinion leadership indicators, (2) two bridging measures, (3) marginally positioned seeds, and (4) randomly selected seeds for comparison. Three network structures are modeled: (1) random, (2) small-world, and (3) scale-free. Four threshold distributions are modeled: (1) normal; (2) uniform; (3) beta 7,14; and (4) beta 1,2; all of which have a mean threshold of 33%, with different variances. The results show that seeding with nodes high on in-degree centrality and/or inverse constraint has faster and more widespread diffusion. Random networks had faster and higher prevalence of diffusion than scale-free ones, but not different from small-world ones. Compared with the normal threshold distribution, the uniform one had faster diffusion and the beta 7,14 distribution had slower diffusion. Most significantly, the threshold distribution standard deviation was associated with rate and prevalence such that higher threshold standard deviations accelerated diffusion and increased prevalence. These results underscore factors that health educators and public health advocates should consider when developing interventions or trying to understand the potential for behavior change.",
                    "citation": "T. Valente, George G. Vega Yon (2020). Diffusion/Contagion Processes on Social Networks. Health Education & Behavior. Citations: 48, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results show that seeding with nodes high on in-degree centrality and/or inverse constraint has faster and more widespread diffusion and that the threshold distribution standard deviation was associated with rate and prevalence such that higher threshold standard deviations accelerated diffusion and increased prevalence."
                    },
                    "url": "https://www.semanticscholar.org/paper/a9fbd600834e951dbda2bdf9d4039101e8dfca84"
                }
            ],
            "summary": ""
        },
        {
            "query": "SIRS model limit cycles persistent oscillations small-world networks",
            "papers": [
                {
                    "title": "Emergent Collective Behavior in Multi-Agent Systems: An Evolutionary Perspective",
                    "abstract": null,
                    "citation": "D. Pais (2012). Emergent Collective Behavior in Multi-Agent Systems: An Evolutionary Perspective. Unknown Journal. Citations: 13, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A network-based evolutionary model is designed to understand the evolution of leadership in biological collectives, with a focus on the role of network topology on the emergent dynamics."
                    },
                    "url": "https://www.semanticscholar.org/paper/f4dcb2b99a76e9a10d08383fdd946f866debf649"
                },
                {
                    "title": "Oscillatory Behaviors of an Epidemiological Model on Small-World Networks",
                    "abstract": null,
                    "citation": "Seung-Do Ki (2007). Oscillatory Behaviors of an Epidemiological Model on Small-World Networks. Unknown Journal. Citations: 1, Influential: 1.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/95c4e00ccfebeacdfbd3929fc4ed11b5f7641482"
                },
                {
                    "title": "Inverse stochastic resonance in adaptive small-world neural networks.",
                    "abstract": "Inverse stochastic resonance (ISR) is a counterintuitive phenomenon where noise reduces the oscillation frequency of an oscillator to a minimum occurring at an intermediate noise intensity, and sometimes even to the complete absence of oscillations. In neuroscience, ISR was first experimentally verified with cerebellar Purkinje neurons [Buchin et al., PLOS Comput. Biol. 12, e1005000 (2016)]. These experiments showed that ISR enables a locally optimal information transfer between the input and output spike train of neurons. Subsequent studies have further demonstrated the efficiency of information processing and transfer in neural networks with small-world network topology. We have conducted a numerical investigation into the impact of adaptivity on ISR in a small-world network of noisy FitzHugh-Nagumo (FHN) neurons, operating in a bi-metastable regime consisting of a metastable fixed point and a metastable limit cycle. Our results show that the degree of ISR is highly dependent on the value of the FHN model's timescale separation parameter ε. The network structure undergoes dynamic adaptation via mechanisms of either spike-time-dependent plasticity (STDP) with potentiation-/depression-domination parameter P or homeostatic structural plasticity (HSP) with rewiring frequency F. We demonstrate that both STDP and HSP amplify the effect of ISR when ε lies within the bi-stability region of FHN neurons. Specifically, at larger values of ε within the bi-stability regime, higher rewiring frequencies F are observed to enhance ISR at intermediate (weak) synaptic noise intensities, while values of P consistent with depression-domination (potentiation-domination) consistently enhance (deteriorate) ISR. Moreover, although STDP and HSP control parameters may jointly enhance ISR, P has a greater impact on improving ISR compared to F. Our findings inform future ISR enhancement strategies in noisy artificial neural circuits, aiming to optimize local information transfer between input and output spike trains in neuromorphic systems and prompt venues for experiments in neural networks.",
                    "citation": "Marius E. Yamakou, Jinjie Zhu, E. A. Martens (2024). Inverse stochastic resonance in adaptive small-world neural networks.. Chaos. Citations: 7, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A numerical investigation into the impact of adaptivity on ISR in a small-world network of noisy FitzHugh-Nagumo (FHN) neurons, operating in a bi-metastable regime consisting of a metastable fixed point and a metastable limit cycle shows that both STDP and HSP amplify the effect of ISR when ε lies within the bi-stability region of FHN neurons."
                    },
                    "url": "https://www.semanticscholar.org/paper/d7c658287ef239a4055ba2bf2436639fd02518af"
                },
                {
                    "title": "Fragility and robustness of self-sustained oscillations in an epidemiological model on small-world networks.",
                    "abstract": "We investigate the susceptible-infected-recovered-susceptible epidemic model, typical of mathematical epidemiology, with the diversity of the durations of infection and recovery of the individuals on small-world networks. Infection spreads from infected to healthy nodes, whose infection and recovery periods denoted by τI and τR, respectively, are either fixed or uniformly distributed around a specified mean. Whenever τI and τR are narrowly distributed around their mean values, the epidemic prevalence in the stationary state is found to reach its maximal level in the typical small-world region. This non-monotonic behavior of the final epidemic prevalence is thought to be similar to the efficient navigation in small worlds with cost minimization. Besides, pronounced oscillatory behavior of the fraction of infected nodes emerges when the number of shortcuts on the underlying network become sufficiently large. Remarkably, we find that the synchronized oscillation of infection incidences is quite fragile to the variability of the two characteristic time scales τI and τR. Specifically, even in the limit of a random network (where the amplest oscillations are expected to arise for fixed τI and τR), increasing the variability of the duration of the infectious period and/or that of the refractory period will push the system to change from a self-sustained oscillation to a fixed point with negligible fluctuations in the steady state. Interestingly, negative correlation between τI and τR can give rise to the robustness of the self-sustained oscillatory phenomenon. Our findings thus highlight the pivotal role of, apart from the external seasonal driving force and demographic stochasticity, the intrinsic characteristic of the system itself in understanding the cycle of outbreaks of recurrent epidemics.",
                    "citation": "Guo-Mei Tang, Zhi-Xi Wu (2019). Fragility and robustness of self-sustained oscillations in an epidemiological model on small-world networks.. Chaos. Citations: 4, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The susceptible-infected-recovered-susceptible epidemic model is investigated with the diversity of the durations of infection and recovery of the individuals on small-world networks to highlight the pivotal role of the intrinsic characteristic of the system itself in understanding the cycle of outbreaks of recurrent epidemics."
                    },
                    "url": "https://www.semanticscholar.org/paper/2c50ad6fc78d0a3a9e89f3e3836ad4eb94040361"
                },
                {
                    "title": "Small-world effects in a modified epidemiological model with mutation and permanent immune mechanism",
                    "abstract": "Pandemic with mutation and permanent immune spreading in a small-world network described is studied by a modified SIR model, with consideration of mutation-immune mechanism. First, a novel mutation-immune model is proposed to modify the classical SIR model to simulate the transmission of mutable viruses that can be permanently immunized in small-world networks. Then, the influences of the size, coordination number and disorder parameter of the small-world network on the spread of the epidemic are analyzed in detail. Finally, the influences of mutation cycle and infection rate on epidemic transmission in small-world network are investigated further. The results show that the structure of the small-world network and the virus mutation cycle have an important impact on the spread of the epidemic. For viruses that can be permanently immunized, virus mutation is equivalent to making the immune cycle of human beings from infinite to finite. The dynamical behavior of the modified SIR epidemic model changes from an irregular, low-amplitude evolution at small disorder parameter to a spontaneous state of wide amplitude oscillations at large disorder parameter. Moreover, similar transition can also be found in increasing mutation cycle parameter. The maximum valid variation mutation decreases with the increase of disorder parameter and coordination number, but increase with respect to system size. In addition above, as the infection rate increases, the fraction of the infected increases and then decreases. As the mutation cycle increases, the time-average fraction of the infected and the infection rate corresponding to the maximum time-average fraction of the infected also decrease. As one conclusion, the results could give a deep understanding Pandemic with mutation and permanent immune spreading, from viewpoint of small-world network.",
                    "citation": "Shengli Cao, Peihua Feng, Wei Wang, et al. (2021). Small-world effects in a modified epidemiological model with mutation and permanent immune mechanism. Nonlinear dynamics. Citations: 4, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results show that the structure of the small-world network and the virus mutation cycle have an important impact on the spread of the epidemic, equivalent to making the immune cycle of human beings from infinite to finite."
                    },
                    "url": "https://www.semanticscholar.org/paper/3d866a7b136878cfe67d5bfe84fb82902b65bd06"
                },
                {
                    "title": "Oscillatory Behaviors of an Epidemiological Model on Small-World Networks",
                    "abstract": null,
                    "citation": "S. Baek (2007). Oscillatory Behaviors of an Epidemiological Model on Small-World Networks. Unknown Journal. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Numerical calculations support the prediction that three characteristic patterns, stationarity, oscillation, and synchronized extermination exist, depending on the competition between the disease’s life cycle and the time for it to sweep the world."
                    },
                    "url": "https://www.semanticscholar.org/paper/6618a9cb6a2761fd41726e3ec0a6d52ddcd2204e"
                },
                {
                    "title": "Complex amplitude chimeras and amplitude-mediated chimeras in networks of birhythmic van der Pol oscillators",
                    "abstract": null,
                    "citation": "Gayathri Vivekanandan, S. G. N. Mbouna, A. C. Chamgoué, et al. (2025). Complex amplitude chimeras and amplitude-mediated chimeras in networks of birhythmic van der Pol oscillators. International Journal of Dynamics and Control. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/5d84439312141e0d73eb7280c89f7becfdd6a14d"
                }
            ],
            "summary": ""
        }
    ]
}