{
    "results": [
        {
            "query": "epidemic SIR activity-driven temporal network vs aggregated network",
            "papers": [
                {
                    "title": "Contagion dynamics in time-varying metapopulation networks",
                    "abstract": "The metapopulation framework is adopted in a wide array of disciplines to describe systems of well separated yet connected subpopulations. The subgroups or patches are often represented as nodes in a network whose links represent the migration routes among them. The connections have been so far mostly considered as static, but in general evolve in time. Here we address this case by investigating simple contagion processes on time-varying metapopulation networks. We focus on the SIR process and determine analytically the mobility threshold for the onset of an epidemic spreading in the framework of activity-driven network models. We find profound differences from the case of static networks. The threshold is entirely described by the dynamical parameters defining the average number of instantaneously migrating individuals and does not depend on the properties of the static network representation. Remarkably, the diffusion and contagion processes are slower in time-varying graphs than in their aggregated static counterparts, the mobility threshold being even two orders of magnitude larger in the first case. The presented results confirm the importance of considering the time-varying nature of complex networks.",
                    "citation": "Suyu Liu, Andrea Baronchelli, N. Perra (2012). Contagion dynamics in time-varying metapopulation networks. arXiv.org. Citations: 78, Influential: 3.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work focuses on the SIR process and determines analytically the mobility threshold for the onset of an epidemic spreading in the framework of activity-driven network models, and finds profound differences from the case of static networks."
                    },
                    "url": "https://www.semanticscholar.org/paper/98769290b14d1b6cb885d6677ce8fbc5224052b0"
                },
                {
                    "title": "Epidemic spreading and aging in temporal networks with memory",
                    "abstract": "Time-varying network topologies can deeply influence dynamical processes mediated by them. Memory effects in the pattern of interactions among individuals are also known to affect how diffusive and spreading phenomena take place. In this paper we analyze the combined effect of these two ingredients on epidemic dynamics on networks. We study the susceptible-infected-susceptible (SIS) and the susceptible-infected-recovered (SIR) models on the recently introduced activity-driven networks with memory. By means of an activity-based mean-field approach, we derive, in the long-time limit, analytical predictions for the epidemic threshold as a function of the parameters describing the distribution of activities and the strength of the memory effects. Our results show that memory reduces the threshold, which is the same for SIS and SIR dynamics, therefore favoring epidemic spreading. The theoretical approach perfectly agrees with numerical simulations in the long-time asymptotic regime. Strong aging effects are present in the preasymptotic regime and the epidemic threshold is deeply affected by the starting time of the epidemics. We discuss in detail the origin of the model-dependent preasymptotic corrections, whose understanding could potentially allow for epidemic control on correlated temporal networks.",
                    "citation": "Michele Tizzani, Simone Lenti, Enrico Ubaldi, et al. (2018). Epidemic spreading and aging in temporal networks with memory. Physical Review E. Citations: 29, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper derives analytical predictions for the epidemic threshold as a function of the parameters describing the distribution of activities and the strength of the memory effects and shows that memory reduces the threshold, which is the same for SIS and SIR dynamics, therefore favoring epidemic spreading."
                    },
                    "url": "https://www.semanticscholar.org/paper/8dc4dc4d55458e6161ffd9d869237fbd13925922"
                },
                {
                    "title": "Contrasting effects of strong ties on SIR and SIS processes in temporal networks",
                    "abstract": "Most real networks are characterized by connectivity patterns that evolve in time following complex, non-Markovian, dynamics. Here we investigate the impact of this ubiquitous feature by studying the Susceptible-Infected-Recovered (SIR) and Susceptible-Infected-Susceptible (SIS) epidemic models on activity driven networks with and without memory (i.e., Markovian and non-Markovian). We find that memory inhibits the spreading process in SIR models by shifting the epidemic threshold to larger values and reducing the final fraction of recovered nodes. On the contrary, in SIS processes memory reduces the epidemic threshold and, for a wide range of disease parameters, increases the fraction of nodes affected by the disease in the endemic state. The heterogeneity in tie strengths, and the frequent repetition of strong ties it entails, allows in fact less virulent SIS-like diseases to survive in tightly connected local clusters that serve as reservoir for the virus. We validate this picture by studying both processes on two real temporal networks.",
                    "citation": "K. Sun, Andrea Baronchelli, N. Perra (2015). Contrasting effects of strong ties on SIR and SIS processes in temporal networks. Unknown Journal. Citations: 51, Influential: 2.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that memory inhibits the spreading process in SIR models by shifting the epidemic threshold to larger values and reducing the final fraction of recovered nodes and, for a wide range of disease parameters, increases the fraction of nodes affected by the disease in the endemic state."
                    },
                    "url": "https://www.semanticscholar.org/paper/b4df33c2c52d143480128114063da6edae2774d3"
                },
                {
                    "title": "Active and inactive quarantine in epidemic spreading on adaptive activity-driven networks",
                    "abstract": "We consider an epidemic process on adaptive activity-driven temporal networks, with adaptive behavior modeled as a change in activity and attractiveness due to infection. By using a mean-field approach, we derive an analytical estimate of the epidemic threshold for susceptible-infected-susceptible (SIS) and susceptible-infected-recovered (SIR) epidemic models for a general adaptive strategy, which strongly depends on the correlations between activity and attractiveness in the susceptible and infected states. We focus on strong social distancing, implementing two types of quarantine inspired by recent real case studies: an active quarantine, in which the population compensates the loss of links rewiring the ineffective connections towards nonquarantining nodes, and an inactive quarantine, in which the links with quarantined nodes are not rewired. Both strategies feature the same epidemic threshold but they strongly differ in the dynamics of the active phase. We show that the active quarantine is extremely less effective in reducing the impact of the epidemic in the active phase compared to the inactive one and that in the SIR model a late adoption of measures requires inactive quarantine to reach containment.",
                    "citation": "Marco Mancastroppa, R. Burioni, V. Colizza, et al. (2020). Active and inactive quarantine in epidemic spreading on adaptive activity-driven networks. Physical Review E. Citations: 29, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown that the active quarantine is extremely less effective in reducing the impact of the epidemic in the active phase compared to the inactive one and that in the SIR model a late adoption of measures requires inactive quarantine to reach containment."
                    },
                    "url": "https://www.semanticscholar.org/paper/5b3afae02875c0305b543a6adc7992b1f2dc0e09"
                },
                {
                    "title": "Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics",
                    "abstract": "Most real networks have been found to evolve dynamically. In addition, heterogeneity of interaction strengths and individual’s memory have been proved to be important to affect network evolution in the area of complex networks. Based on a recent extension of the activity-driven modeling framework, i.e. activity-driven model with attractiveness, where individuals are characterized by their activities and attractiveness, we propose a new temporal network model by considering individuals’ memory. Similar to the previous network model, we also investigate heterogeneous distributions and different correlations between the two variables (activity and attractiveness). By numerical simulations, we illustrate the impact of memory on epidemic spreading processes unfolding on the proposed model. We find that, when individuals’ attractiveness is fixed, memory does not cause dramatic change on the epidemic threshold in the SIR process, but it inhibits the epidemic spreading by reducing the infected ratio. While for the SIS process, in the case of uncorrelated and positive correlations between the two variables, memory facilitates the epidemic outbreaks by shrinking the epidemic threshold. When the two variables are negatively correlated, memory does not take obvious impact on the epidemic threshold. Besides, for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength. It indicates that for the individuals with same activity, more attractive individuals will promote the disease spread. The findings deepen our understanding of the role of individuals’ memory and their attractiveness in the epidemic spreading process.",
                    "citation": "Mei Yang, B. Wang, Yuexing Han (2019). Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics. International Journal of Modern Physics C. Citations: 3, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that for the individuals with same activity, more attractive individuals will promote the disease spread, and for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength."
                    },
                    "url": "https://www.semanticscholar.org/paper/f82b09fc66bfcf70f7333e46691f78354dc23aa6"
                },
                {
                    "title": "Risk assessment of Ebola virus disease spreading in Uganda using a two-layer temporal network",
                    "abstract": "Network-based modelling of infectious diseases apply compartmental models on a contact network, which makes the epidemic process crucially dependent on the network structure. For highly contagious diseases such as Ebola virus disease (EVD), interpersonal contact plays the most vital role in human-to-human transmission. Therefore, for accurate representation of EVD spreading, the contact network needs to resemble the reality. Prior research has mainly focused on static networks (only permanent contacts) or activity-driven networks (only temporal contacts) for Ebola spreading. A comprehensive network for EVD spreading should include both these network structures, as there are always some permanent contacts together with temporal contacts. Therefore, we propose a two-layer temporal network for Uganda, which is at risk of an Ebola outbreak from the neighboring Democratic Republic of Congo (DRC) epidemic. The network has a permanent layer representing permanent contacts among individuals within the family level, and a data-driven temporal network for human movements motivated by cattle trade, fish trade, or general communications. We propose a Gillespie algorithm with the susceptible-infected-recovered (SIR) compartmental model to simulate the evolution of EVD spreading as well as to evaluate the risk throughout our network. As an example, we applied our method to a network consisting of 23 districts along different movement routes in Uganda starting from bordering districts of the DRC to Kampala. Simulation results show that some regions are at higher risk of infection, suggesting some focal points for Ebola preparedness and providing direction to inform interventions in the field. Simulation results also show that decreasing physical contact as well as increasing preventive measures result in a reduction of chances to develop an outbreak. Overall, the main contribution of this paper lies in the novel method for risk assessment, which can be more precise with an increasing volume of accurate data for creating the network model.",
                    "citation": "Mahbubul H. Riad, M. Sekamatte, Felix Ocom, et al. (2019). Risk assessment of Ebola virus disease spreading in Uganda using a two-layer temporal network. Scientific Reports. Citations: 19, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel method for risk assessment that can be more precise with an increasing volume of accurate data for creating the network model is proposed, which shows that some regions are at higher risk of infection."
                    },
                    "url": "https://www.semanticscholar.org/paper/9f9ccf99595f27b4b39ef92eea16c8336eaddadf"
                },
                {
                    "title": "Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone",
                    "abstract": "Activity-driven networks (ADNs) are a powerful paradigm to study epidemic spreading in temporal networks, where the dynamics of the disease and the evolution of the links share a common time-scale. One of the key assumptions of ADNs is the lack of preferential connections among individuals. This assumption hinders the application of ADNs to several realistic scenarios where some contacts persist in time, rather than intermittently activate. Here, we examine an improved modeling framework that superimposes an ADN to a static backbone network, toward the integration of persistent contacts with time-varying connections. To demonstrate the interplay between the ADN and the static backbone, we investigate the effect of behavioral changes on the disease dynamics. In this framework, each individual may adapt his/her activity as a function of the health status, thereby adjusting the relative weight of time-varying versus static links. To illustrate the approach, we consider two classes of backbone networks, Erdős-Rényi and random regular, and two disease models, SIS and SIR. A general mean-field theory is established for predicting the epidemic threshold, and numerical simulations are conducted to shed light on the role of network parameters on the epidemic spreading and estimate the epidemic size.",
                    "citation": "Matthieu Nadini, A. Rizzo, M. Porfiri (2020). Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone. IEEE Transactions on Network Science and Engineering. Citations: 37, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/85188024918e9c0d11cab72e0ddec96d4b9e562d"
                }
            ],
            "summary": ""
        }
    ]
}