{
    "results": [
        {
            "query": "temporal networks epidemic SIR activity-driven model comparison static network",
            "papers": [
                {
                    "title": "Unifying Physics- and Data-Driven Modeling via Novel Causal Spatiotemporal Graph Neural Network for Interpretable Epidemic Forecasting",
                    "abstract": "Accurate epidemic forecasting is crucial for effective disease control and prevention. Traditional compartmental models often struggle to estimate temporally and spatially varying epidemiological parameters, while deep learning models typically overlook disease transmission dynamics and lack interpretability in the epidemiological context. To address these limitations, we propose a novel Causal Spatiotemporal Graph Neural Network (CSTGNN), a hybrid framework that integrates a Spatio-Contact SIR model with Graph Neural Networks (GNNs) to capture the spatiotemporal propagation of epidemics. Inter-regional human mobility exhibits continuous and smooth spatiotemporal patterns, leading to adjacent graph structures that share underlying mobility dynamics. To model these dynamics, we employ an adaptive static connectivity graph to represent the stable components of human mobility and utilize a temporal dynamics model to capture fluctuations within these patterns. By integrating the adaptive static connectivity graph with the temporal dynamics graph, we construct a dynamic graph that encapsulates the comprehensive properties of human mobility networks. Additionally, to capture temporal trends and variations in infectious disease spread, we introduce a temporal decomposition model to handle temporal dependence. This model is then integrated with a dynamic graph convolutional network for epidemic forecasting. We validate our model using real-world datasets at the provincial level in China and the state level in Germany. Extensive studies demonstrate that our method effectively models the spatiotemporal dynamics of infectious diseases, providing a valuable tool for forecasting and intervention strategies. Furthermore, analysis of the learned parameters offers insights into disease transmission mechanisms, enhancing the interpretability and practical applicability of our model.",
                    "citation": "Shuai Han, Lukas Stelz, T. Sokolowski, et al. (2025). Unifying Physics- and Data-Driven Modeling via Novel Causal Spatiotemporal Graph Neural Network for Interpretable Epidemic Forecasting. arXiv.org. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel Causal Spatiotemporal Graph Neural Network (CSTGNN), a hybrid framework that integrates a Spatio-Contact SIR model with Graph Neural Networks (GNNs) to capture the spatiotemporal propagation of epidemics, providing a valuable tool for forecasting and intervention strategies."
                    },
                    "url": "https://www.semanticscholar.org/paper/823e2e052d955a4ea7203f79537542c8ae8c3d6c"
                },
                {
                    "title": "Impact of message fatigue and individual behavioral responses on epidemiological spread in temporal simplicial networks",
                    "abstract": "Health information spreads rapidly, which can effectively control epidemics. However, the swift dissemination of information also has potential negative impacts, which increasingly attracts attention. Message fatigue refers to the psychological response characterized by feelings of boredom and anxiety that occur after receiving an excessive amount of similar information. This phenomenon can alter individual behaviors related to epidemic prevention. Additionally, recent studies indicate that pairwise interactions alone are insufficient to describe complex social transmission processes, and higher-order structures representing group interactions are crucial. To address this, we develop a novel epidemic model that investigates the interactions between information, behavioral responses, and epidemics. Our model incorporates the impact of message fatigue on the entire transmission system. The information layer is modeled using a static simplicial network to capture group interactions, while the disease layer uses a time-varying network based on activity-driven model with attractiveness to represent the self-protection behaviors of susceptible individuals and self-isolation behaviors of infected individuals. We theoretically describe the co-evolution equations using the microscopic Markov chain approach (MMCA) and get the epidemic threshold. Experimental results show that while the negative impact of message fatigue on epidemic transmission is limited, it significantly weakens the group interactions depicted by higher-order structures. Individual behavioral responses strongly inhibit the epidemic. Our simulations using the Monte Carlo (MC) method demonstrate that greater intensity in these responses leads to clustering of susceptible individuals in the disease layer. Finally, we apply the proposed model to real networks to verify its reliability. In summary, our research results enhance the understanding of the information–epidemic coupling dynamics, and we expect to provide valuable guidance for managing future emerging epidemics.",
                    "citation": "Xiao-Nan 晓楠 Fan 樊, Xuemei 雪梅 You 由 (2025). Impact of message fatigue and individual behavioral responses on epidemiological spread in temporal simplicial networks. Chinese Physics B. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel epidemic model is developed that investigates the interactions between information, behavioral responses, and epidemics and incorporates the impact of message fatigue on the entire transmission system, which enhances the understanding of the information–epidemic coupling dynamics."
                    },
                    "url": "https://www.semanticscholar.org/paper/3b4be34c82e18219c7a8a2dd986d106cce5d699d"
                },
                {
                    "title": "Epidemic-guided deep learning for spatiotemporal forecasting of tuberculosis outbreak",
                    "abstract": "Tuberculosis (TB) remains a formidable global health challenge, driven by complex spatiotemporal transmission dynamics and influenced by factors such as population mobility and behavioral changes. We propose an Epidemic-Guided Deep Learning (EGDL) approach that fuses mechanistic epidemiological principles with advanced deep learning techniques to enhance early warning systems and intervention strategies for TB outbreaks. Our framework is built upon a modified networked Susceptible-Infectious-Recovered (MN-SIR) model augmented with a saturated incidence rate and graph Laplacian diffusion, capturing both long-term transmission dynamics and region-specific population mobility patterns. Compartmental model parameters are rigorously estimated using Bayesian inference via the Markov Chain Monte Carlo approach. Theoretical analysis leveraging the comparison principle and Green’s formula establishes global stability properties of the disease-free and endemic equilibria. Building on these epidemiological insights, we design two forecasting architectures, EGDL-Parallel and EGDL-Series, that integrate the mechanistic outputs of the MN-SIR model within deep neural networks. This integration mitigates the overfitting risks commonly encountered in data-driven methods and filters out noise inherent in surveillance data, resulting in reliable forecasts of real-world epidemic trends. Experiments conducted on TB incidence data from 47 prefectures in Japan and 31 provinces in mainland China demonstrate that our approach delivers robust and accurate predictions across multiple time horizons (short to medium-term forecasts), supporting its generalizability across regions with different population dynamics. Additionally, incorporating uncertainty quantification through conformal prediction and explainability via temporal gradient-based class activation maps enhances the model’s practical utility for guiding targeted public health interventions.",
                    "citation": "Madhab Barman, Madhurima Panja, Nachiketa Mishra, et al. (2025). Epidemic-guided deep learning for spatiotemporal forecasting of tuberculosis outbreak. Machine-mediated learning. Citations: 2, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work proposes an Epidemic-Guided Deep Learning approach that fuses mechanistic epidemiological principles with advanced deep learning techniques to enhance early warning systems and intervention strategies for TB outbreaks, supporting its generalizability across regions with different population dynamics."
                    },
                    "url": "https://www.semanticscholar.org/paper/19d744bf90cd51d32a9041244edbc2a3ebd859aa"
                },
                {
                    "title": "Data-Driven Methods for Daily Glucose Prediction in People with Type 1 Diabetes",
                    "abstract": "Low-error prediction of glucose levels is fundamental for the effective management of Type 1 Diabetes Mellitus (T1D), especially with the variability induced by physical activity. This work performs a detailed comparison of different types of artificial neural networks for the prediction of blood glucose during and after physical exercise. Four neural network architectures were evaluated: two based on static structures with temporal information at the input (classical and convolutional) and two based on recurrent neural networks. Furthermore, for each architecture, two variants were analyzed: one using only historical data from continuous glucose monitor (CGM) and another that incorporates auxiliary signals related to insulin, food intake, and physical activity. The predictive models were trained and validated using the dataset from the The Type 1 Diabetes and Exercise Initiative (T1DEXI) clinical trial. The evaluation of the methods was carried out using predictive performance metrics and clinical relevance using the Clarke Error Grid tool. The results obtained from this analysis indicate that the incorporation of auxiliary signals and the use of long short-term memory (LSTM) recurrent architectures significantly improve the accuracy of the predictions, highlighting their potential in clinical applications and automatic glucose control systems in the management of T1D.",
                    "citation": "M. D. Saavedra, F. Inthamoussou, Fabricio Garelli (2024). Data-Driven Methods for Daily Glucose Prediction in People with Type 1 Diabetes. IEEE Biennial Congress of Argentina. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/87ac8316ca7923d9da8785169fde210786a8f181"
                },
                {
                    "title": "Intervention against information diffusion in static and temporal coupling networks",
                    "abstract": "Information diffusion in complex networks has become quite an active research topic. As an important part of this field, intervention against information diffusion processes is attracting ever-increasing attention from network and control engineers. In particular, it is urgent to design intervention schemes for the coevolutionary dynamics between information diffusion processes and coupled networks. For this purpose, we comprehensively study the problem of information diffusion intervention over static and temporal coupling networks. First, individual interactions are described by a modified activity-driven network (ADN) model. Then, we establish a novel node-based susceptible–infected–recovered–susceptible (SIRS) model to characterize the information diffusion dynamics. On these bases, three synergetic intervention strategies are formulated. Second, we derive the critical threshold of the controlled-SIRS system via stability analysis. Accordingly, we exploit a spectral optimization scheme to minimize the outbreak risk or the required budget. Third, we develop an optimal control scheme of dynamically allocating resources to minimize both system loss and intervention expense, in which the optimal intervention inputs are obtained through optimal control theory and a forward–backward sweep algorithm. Finally, extensive simulation results validate the accuracy of theoretical derivation and the performance of our proposed intervention schemes.",
                    "citation": "Yun 允 Chai 柴, Y. Wang 王, Jun 俊 Yan 颜, et al. (2023). Intervention against information diffusion in static and temporal coupling networks. Chinese Physics B. Citations: 2, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work comprehensively study the problem of information diffusion intervention over static and temporal coupling networks and develops an optimal control scheme of dynamically allocating resources to minimize both system loss and intervention expense."
                    },
                    "url": "https://www.semanticscholar.org/paper/d8852323da5a8e8814eb509f8c3e44b2ba15c5fd"
                },
                {
                    "title": "Process Modularity Over Time: Modeling Process Execution as an Evolving Activity Network",
                    "abstract": null,
                    "citation": "Pedro Parraguez, S. Piccolo, M. Perišić, et al. (2021). Process Modularity Over Time: Modeling Process Execution as an Evolving Activity Network. IEEE transactions on engineering management. Citations: 10, Influential: 1.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/c0287c5f056e5e0cf7f249c2cc6ff38d668ec5a2"
                },
                {
                    "title": "Resilience of Coupled Urban Socio-Physical Systems to Disasters: Data-Driven Modeling Approach",
                    "abstract": null,
                    "citation": "T. Yabe (2021). Resilience of Coupled Urban Socio-Physical Systems to Disasters: Data-Driven Modeling Approach. Unknown Journal. Citations: 2, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This dissertation studied the recovery dynamics and resilience of urban systems to disasters using a large-scale human-centered data-driven modeling approach, with particular emphasis on the complex interdependencies among social, economic, and infrastructure systems."
                    },
                    "url": "https://www.semanticscholar.org/paper/460e0e3bd73ac607e8f1b5e7a5641a99d8cffb54"
                }
            ],
            "summary": ""
        }
    ]
}