{
    "results": [
        {
            "query": "SEIR epidemic dynamics network heterogeneity scale-free simulation analytical",
            "papers": [
                {
                    "paper_title": "How network properties and epidemic parameters influence stochastic SIR dynamics on scale-free random networks",
                    "abstract": "ABSTRACT With the premise that social interactions are described by power-law distributions, we study the stochastic dynamics of SIR (Susceptible-Infected-Removed) compartmental models on static scale-free random networks generated via the configuration model. We compare simulations of our model to analytical results, providing a closed formula and a lower bound for the probability of having a minor epidemic of the disease. We explore the variability in disease spread by stochastic simulations. In particular, we demonstrate how important epidemic indices change as a function of the contagiousness of the disease and the connectivity of the network. Our results quantify the role of the starting node’s degree in determining these indices, commonly used to describe epidemic spread. Our results and implementation set a baseline for studying epidemic spread on networks, showing how analytical methods can help in the interpretation of stochastic simulations.",
                    "citation": "Sara Sottile, Ozan Kahramanoğulları, M. Sensi (2020). How network properties and epidemic parameters influence stochastic SIR dynamics on scale-free random networks. Journal of Simulation, 18, 206 - 219. DOI: 10.1080/17477778.2022.2100724",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The authors' results quantify the role of starting node degree in determining these indices, commonly used to describe epidemic spread, and demonstrate how important epidemic indices change as a function of the contagiousness of the disease and the connectivity of the network."
                    }
                },
                {
                    "paper_title": "Analytical solution of epidemic threshold for coupled information-epidemic dynamics on multiplex networks with alterable heterogeneity.",
                    "abstract": "The phase transition of epidemic spreading model on networks is one of the most important concerns of physicists to theoretical epidemiology. In this paper, we present an analytical expression of epidemic threshold for interplay between epidemic spreading and human behavior on multiplex networks. The threshold formula proposed in this paper reveals the relation between the threshold on single-layer networks and that on multiplex networks, which means that the theoretical conclusions of single-layer networks can be used to improve the threshold accuracy of multiplex networks. To verify how well our formula works in different networks, we build a network model with constant total number of edges but gradually changing the heterogeneity of the network, from scale-free network to Erdős-Rényi random network. By use of theoretical analysis and computer simulations, we find that the heterogeneity of information layer behaves as a \"double-edged sword\" on the epidemic threshold: The strong heterogeneity can effectively improve the epidemic threshold (which means the disease outbreak requires a higher infection probability) when the awareness probability α is low, while the opposite effect takes place for high α. Meanwhile, the weak heterogeneity of the information layer is effective in suppressing the epidemic prevalence when the awareness probability is neither too high nor too low.",
                    "citation": "Xin Chang, Chao-Ran Cai, Ji-Qiang Zhang... (2021). Analytical solution of epidemic threshold for coupled information-epidemic dynamics on multiplex networks with alterable heterogeneity.. Physical review. E, 104 4-1, \n          044303\n        . DOI: 10.1103/physreve.104.044303",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The threshold formula proposed in this paper reveals the relation between the threshold on single-layer networks and that on multiplex networks, which means that the theoretical conclusions of single- layer networks can be used to improve the threshold accuracy of multiplex Networks."
                    }
                },
                {
                    "paper_title": "Spreading Dynamics of an SEIR Model with Delay on Scale-Free Networks",
                    "abstract": "In this paper, to be more precise in modeling the real epidemic spread, an SEIR model with delay describing the fixed latent period is studied on scale-free networks. The basic reproduction number, which serves as a critical threshold of epidemic spread, is calculated. The formula for the basic reproduction number shows that adding delay decreases the basic reproduction number. By constructing appropriate Lyapunov functions, the global stability of disease-free and endemic equilibria is investigated. Finally, numerical simulations are performed to illustrate the effect of network structures and model parameters on the basic reproduction numbers and disease spreading processes.",
                    "citation": "Huiyan Kang, Mengfeng Sun, Y. Yu... (2020). Spreading Dynamics of an SEIR Model with Delay on Scale-Free Networks. IEEE Transactions on Network Science and Engineering, 7, 489-496. DOI: 10.1109/TNSE.2018.2860988",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "To be more precise in modeling the real epidemic spread, an SEIR model with delay describing the fixed latent period is studied on scale-free networks and the basic reproduction number, which serves as a critical threshold of epidemic spread is calculated."
                    }
                },
                {
                    "paper_title": "Dynamics analysis of epidemic spreading with individual heterogeneous infection thresholds",
                    "abstract": "In the real world, individuals may become infected with an epidemic after multiple exposures to the corresponding virus. This occurs because each individual possesses certain physical defenses and immune capabilities at the time of exposure to the virus. Repeated exposure to the virus can lead to a decline in immune competence, consequently resulting in epidemic infection. The susceptibility of individuals to an epidemic is heterogeneous. We model this characteristic as the individual heterogeneous infection threshold. Then, we propose an individual logarithmic-like infection threshold function on a single-layer complex network to reflect the heterogeneity of individual susceptibility on infecting the virus and the associated epidemic. Next, we introduce a partition theory based on the edge and logarithmic-like infection threshold function to qualitatively analyze the mechanisms of virus infection and epidemic spreading. Finally, simulation results on Erdő–Rényi (ER) and scale-free (SF) networks indicate that increasing both the epidemic infection initial threshold and outbreak threshold, as well as decreasing the virus and epidemic infection probability, can all effectively suppress epidemic spreading and epidemic infection outbreak. With an increase in the epidemic infection outbreak threshold, the increasing pattern of the final epidemic infection scale transitions from a second-order continuous phase transition to a first-order discontinuous phase transition. Additionally, degree distribution heterogeneity also significantly impacts the outbreak and spread of diseases. These findings provide valuable guidance for the formulation of immunization strategies.",
                    "citation": "Feng Li (2024). Dynamics analysis of epidemic spreading with individual heterogeneous infection thresholds. Frontiers in Physics. DOI: 10.3389/fphy.2024.1492423",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Simulation results indicate that increasing both the epidemic infection initial threshold and outbreak threshold, as well as decreasing the virus and epidemic infection probability, can all effectively suppress epidemic spreading and epidemic infection outbreak."
                    }
                },
                {
                    "paper_title": "Spatial heterogeneity and infection patterns on epidemic transmission disclosed by a combined contact-dependent dynamics and compartmental model",
                    "abstract": "Epidemics, such as COVID-19, have caused significant harm to human society worldwide. A better understanding of epidemic transmission dynamics can contribute to more efficient prevention and control measures. Compartmental models, which assume homogeneous mixing of the population, have been widely used in the study of epidemic transmission dynamics, while agent-based models rely on a network definition for individuals. In this study, we developed a real-scale contact-dependent dynamic (CDD) model and combined it with the traditional susceptible-exposed-infectious-recovered (SEIR) compartment model. By considering individual random movement and disease spread, our simulations using the CDD-SEIR model reveal that the distribution of agent types in the community exhibits spatial heterogeneity. The estimated basic reproduction number R0 depends on group mobility, increasing logarithmically in strongly heterogeneous cases and saturating in weakly heterogeneous conditions. Notably, R0 is approximately independent of virus virulence when group mobility is low. We also show that transmission through small amounts of long-term contact is possible due to short-term contact patterns. The dependence of R0 on environment and individual movement patterns implies that reduced contact time and vaccination policies can significantly reduce the virus transmission capacity in situations where the virus is highly transmissible (i.e., R0 is relatively large). This work provides new insights into how individual movement patterns affect virus spreading and how to protect people more efficiently.",
                    "citation": "Youyuan Zhu, Ruizhe Shen, Hao Dong... (2023). Spatial heterogeneity and infection patterns on epidemic transmission disclosed by a combined contact-dependent dynamics and compartmental model. PLOS ONE, 18. DOI: 10.1371/journal.pone.0286558",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This work developed a real-scale contact-dependent dynamic (CDD) model and combined it with the traditional susceptible-exposed-infectious-recovered (SEIR) compartment model and provides new insights into how individual movement patterns affect virus spreading and how to protect people more efficiently."
                    }
                },
                {
                    "paper_title": "SIS Epidemic Propagation on Scale-Free Hypernetwork",
                    "abstract": "The hypergraph offers a platform to study structural properties emerging from more complicated and higher-order than pairwise interactions among constituents and dynamical behavior, such as the spread of information or disease. Considering the higher-order interaction between multiple nodes in the system, the mathematical model of infectious diseases spreading on simple scale-free networks is extended to hypernetworks based on hypergraphs. A SIS propagation model based on reaction process strategy in a universal scale-free hypernetwork is constructed, and the theoretical and simulation analysis of the model is carried out. Using mean field theory, the analytical expressions between infection density and hypernetwork structure parameters as well as propagation parameters in steady state are given. Through individual-based simulation, the theoretical results are verified and the infectious disease spread process under the structure of the hypernetwork and simple scale-free network is compared and analyzed. It becomes apparent that infectious diseases are easier to spread on the hypernetworks, showing the clear clustering characteristics of epidemic spread. Furthermore, the influence of the hypernetwork structure and model parameters on the propagation process is studied. The results of this paper are helpful in further studying the propagation dynamics on the hypernetworks. At the same time, it provides a certain theoretical basis for the current COVID-19 prevention and control in China and the prevention of infectious diseases in the future.",
                    "citation": "Kaijun Wang, Yunchao Gong, Feng Hu (2022). SIS Epidemic Propagation on Scale-Free Hypernetwork. Applied Sciences. DOI: 10.3390/app122110934",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A SIS propagation model based on reaction process strategy in a universal scale-free hypernetwork is constructed and provides a certain theoretical basis for the current COVID-19 prevention and control in China and the prevention of infectious diseases in the future."
                    }
                },
                {
                    "paper_title": "Automated Hubs-Patching: Protection Against Malware Spread Through Reduced Scale-Free Networks and External Storage Devices",
                    "abstract": "Patches can be distributed through technological networks at a high rate, targeting a sufficient fraction of nodes. This selective and rapid automated process not only prevents and contains the negative spread of malware but also minimizes costs and avoids network congestion. We propose a novel epidemic model to study the dynamics of patching highly linked nodes (hubs) as a preventive measure against malware spreading through the Internet and removable storage devices. We analytically prove the model's two endemic equilibria and their global stabilities. Numerical simulations are performed to validate this analysis and explore the influence of different parameters on the asymptotic fraction of infected and patched nodes. Our new findings show that (i) Barabási's network is more conducive to inhibiting computer viruses spread than other scale-free networks, (ii) it is possible to control and reduce the spread of a rapid and large-scale viral attack targeting hubs by keeping the ratio of the patch failure rate and the patch forwarding rate below a threshold that characterizes the network, and by implementing other specific countermeasures at lowly linked nodes level. Our approach provides insights into the dynamics of effective patch dissemination and identifies strategies to combat malware spread.",
                    "citation": "M. Essouifi, Ahmed Lachgar, Madhusudanan Vasudevan... (2024). Automated Hubs-Patching: Protection Against Malware Spread Through Reduced Scale-Free Networks and External Storage Devices. IEEE Transactions on Network Science and Engineering, 11, 4758-4773. DOI: 10.1109/TNSE.2024.3401081",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Barabási's network is more conducive to inhibiting computer viruses spread than other scale-free networks and it is possible to control and reduce the spread of a rapid and large-scale viral attack targeting hubs by keeping the ratio of the patch failure rate and the patch forwarding rate below a threshold that characterizes the network."
                    }
                }
            ],
            "summary": ""
        }
    ]
}