{
    "results": [
        {
            "query": "degree heterogeneity effects on SEIR epidemic models",
            "papers": [
                {
                    "paper_title": "The Credit Risk Contagion Mechanism of Financial Guarantee Network: An Application of the SEIR-Epidemic Model",
                    "abstract": "Financing guarantee is an important means and key link to solve the financing difficulties of small- and medium-size enterprises (SMEs). However, while financial guarantees alleviate the financing difficulties of SMEs, the complex guarantee relationships also constitute a new channel for credit risk contagion in the financial guarantee network. In this paper, we construct a model of credit risk contagion process of guarantee network based on SEIR and analyse the equilibrium point and stability of the model. Then, we find the threshold value of risk contagion and further simulate the SEIR model dynamically to analyse the influence of each parameter of the model. The results show that the risk of the financing guarantee network begins to be widely contagious only when risk contagion threshold is greater than 1, and the conversion rate of exposed enterprises, removal rate of infected enterprises, nodal enterprises degree, and risk contagion rate have significant effects on the changes of individual density of susceptible, exposed, infected, and recovered enterprises. Combining the above findings, it is of great theoretical and practical significance to propose relevant countermeasures for credit risk control of financial guarantee network.",
                    "citation": "Guojian Ma, Juan Ding, Youqing Lv (2022). The Credit Risk Contagion Mechanism of Financial Guarantee Network: An Application of the SEIR-Epidemic Model. Complex., 2022, 7669259:1-7669259:14. DOI: 10.1155/2022/7669259",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Global Dynamics of a Multi-group SEIR Epidemic Model with Infection Age",
                    "abstract": "Consider the heterogeneity (e.g., heterogeneous social behaviour, heterogeneity due to different geography, contrasting contact patterns and different numbers of sexual partners etc.) of host population, in this paper, the authors propose an infection age multi-group SEIR epidemic model. The model system also incorporates the feedback variables, where the infectivity of infected individuals may depend on the infection age. In the direction of mathematical analysis of model, the basic reproduction number R0 has been computed. The global stability of disease-free equilibrium and endemic equilibrium have been established in the term of R0. More precisely, for R0 ≤ 1, the disease-free equilibrium is globally asymptotically stable and for R0 > 1, they establish global stability of endemic equilibrium using some graph theoretic techniques to Lyapunov function method. By considering a numerical example, they investigate the effects of infection age and feedback on the prevalence of the disease. Their result shows that feedback parameters have different and even opposite effects on different groups. However, by choosing an appropriate value of feedback parameters, the disease could be eradicated or maintained at endemic level. Besides, the infection age of infected individuals may also change the behaviour of the disease, global stable to damped oscillations or damped oscillations to global stable.",
                    "citation": "V. Bajiya, Jai Prakash Tripathi, Vipul Kakkar... (2021). Global Dynamics of a Multi-group SEIR Epidemic Model with Infection Age. Chinese Annals of Mathematics, Series B, 42, 833 - 860. DOI: 10.1007/s11401-021-0294-1",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The authors investigate the effects of infection age and feedback on the prevalence of the disease and establish global stability of endemic equilibrium using some graph theoretic techniques to Lyapunov function method."
                    }
                },
                {
                    "paper_title": "Effects of individual heterogeneity and multi-type information on the coupled awareness-epidemic dynamics in multiplex networks",
                    "abstract": "Awareness of epidemics can influence people’s behavior and further trigger changes in epidemic spreading. Previous studies concentrating on the coupled awareness-epidemic dynamics usually ignore the multi-type information and the heterogeneity of individuals. However, the real-world cases can be more complicated, and the interaction between information diffusion and epidemic spreading needs further study. In this article, we propose an individual-based epidemics and multi-type information spreading (IEMIS) model on two-layered multiplex networks considering positive and negative preventive information and two types of heterogeneity: 1) heterogeneity of aware individual’s state which leads to differences in aware transmission capacity and 2) heterogeneity of individual’s node degree which affects the epidemic infection rate. Based on Micro-Markov Chain approach (MMCA), we derive the theoretical epidemic threshold for the proposed model and validate the results by those obtained with Monto Carlo (MC) simulations. Through extensive simulations, we demonstrate that for epidemics with low infectivity, promoting the diffusion of positive preventive information, enhancing the importance ratio of neighbors who are aware of positive information, and increasing social distance among individuals can effectively suppress epidemic spreading. However, for highly infectious diseases, the influence of these factors becomes limited.",
                    "citation": "Peiyu Chen, Xudong Guo, Zengtao Jiao... (2022). Effects of individual heterogeneity and multi-type information on the coupled awareness-epidemic dynamics in multiplex networks. . DOI: 10.3389/fphy.2022.964883",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "An individual-based epidemics and multi-type information spreading (IEMIS) model on two-layered multiplex networks considering positive and negative preventive information and two types of heterogeneity is proposed, demonstrating that for epidemics with low infectivity, promoting the diffusion of positive preventive information, enhancing the importance ratio of neighbors who are aware of positive information, and increasing social distance among individuals can effectively suppress epidemic spreading."
                    }
                },
                {
                    "paper_title": "Epidemic spreading under game-based self-quarantine behaviors: The different effects of local and global information.",
                    "abstract": "During the outbreak of an epidemic, individuals may modify their behaviors in response to external (including local and global) infection-related information. However, the difference between local and global information in influencing the spread of diseases remains inadequately explored. Here, we study a simple epidemic model that incorporates the game-based self-quarantine behavior of individuals, taking into account the influence of local infection status, global disease prevalence, and node heterogeneity (non-identical degree distribution). Our findings reveal that local information can effectively contain an epidemic, even with only a small proportion of individuals opting for self-quarantine. On the other hand, global information can cause infection evolution curves shaking during the declining phase of an epidemic, owing to the synchronous release of nodes with the same degree from the quarantined state. In contrast, the releasing pattern under the local information appears to be more random. This shaking phenomenon can be observed in various types of networks associated with different characteristics. Moreover, it is found that under the proposed game-epidemic framework, a disease is more difficult to spread in heterogeneous networks than in homogeneous networks, which differs from conventional epidemic models.",
                    "citation": "Zegang Huang, Xincheng Shu, Qi Xuan... (2023). Epidemic spreading under game-based self-quarantine behaviors: The different effects of local and global information.. Chaos, 34 1. DOI: 10.1063/5.0180484",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is revealed that local information can effectively contain an epidemic, even with only a small proportion of individuals opting for self-quarantine, and it is found that under the proposed game-epidemic framework, a disease is more difficult to spread in heterogeneous networks than in homogeneous networks, which differs from conventional epidemic models."
                    }
                },
                {
                    "paper_title": "Power-law population heterogeneity governs epidemic waves",
                    "abstract": "We generalize the Susceptible-Infected-Removed (SIR) model for epidemics to take into account generic effects of heterogeneity in the degree of susceptibility to infection in the population. We introduce a single new parameter corresponding to a power-law exponent of the susceptibility distribution at small susceptibilities. We find that for this class of distributions the gamma distribution is the attractor of the dynamics. This allows us to identify generic effects of population heterogeneity in a model as simple as the original SIR model which is contained as a limiting case. Because of this simplicity, numerical solutions can be generated easily and key properties of the epidemic wave can still be obtained exactly. In particular, we present exact expressions for the herd immunity level, the final size of the epidemic, as well as for the shape of the wave and for observables that can be quantified during an epidemic. In strongly heterogeneous populations, the herd immunity level can be much lower than in models with homogeneous populations as commonly used for example to discuss effects of mitigation. Using our model to analyze data for the SARS-CoV-2 epidemic in Germany shows that the reported time course is consistent with several scenarios characterized by different levels of immunity. These scenarios differ in population heterogeneity and in the time course of the infection rate, for example due to mitigation efforts or seasonality. Our analysis reveals that quantifying the effects of mitigation requires knowledge on the degree of heterogeneity in the population. Our work shows that key effects of population heterogeneity can be captured without increasing the complexity of the model. We show that information about population heterogeneity will be key to understand how far an epidemic has progressed and what can be expected for its future course.",
                    "citation": "J. Neipel, J. Bauermann, Stefano Bo... (2020). Power-law population heterogeneity governs epidemic waves. PLoS ONE, 15. DOI: 10.1371/journal.pone.0239678",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The model generalizes the Susceptible-Infected-Removed (SIR) model to take into account generic effects of heterogeneity in the degree of susceptibility to infection in the population and shows that key effects of population heterogeneity can be captured without increasing the complexity of the model."
                    }
                },
                {
                    "paper_title": "SEIR Epidemic Dynamics in Random Networks",
                    "abstract": "Predicting disease transmission on complex networks has attracted considerable recent attention in the epidemiology community. In this paper, we develop a low-dimensional system of nonlinear ordinary differential equations to model the susceptible-exposed-infectious-recovered (SEIR) epidemics on random network with arbitrary degree distributions. Both the final size of epidemics and the time-dependent behaviors are derived within our simple framework. The underlying network is represented by the configuration model, which appropriately accounts for the heterogeneity and finiteness of the degree observed in a variety of real contact networks. Moreover, a generalized model where the infectious state of individual can be skipped is treated in brief.",
                    "citation": "Y. Shang (2013). SEIR Epidemic Dynamics in Random Networks. International Scholarly Research Notices, 2013, 1-5. DOI: 10.5402/2013/345618",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper develops a low-dimensional system of nonlinear ordinary differential equations to model the susceptible-exposed-infectious-recovered (SEIR) epidemics on random network with arbitrary degree distributions and develops a generalized model where the infectious state of individual can be skipped."
                    }
                },
                {
                    "paper_title": "Quantitative Study on American COVID-19 Epidemic Predictions and Scenario Simulations",
                    "abstract": "The COVID-19 pandemic has had a profound impact on people’s lives, making accurate prediction of epidemic trends a central focus in COVID-19 research. This study innovatively utilizes a spatiotemporal heterogeneity analysis (GTNNWR) model to predict COVID-19 deaths, simulate pandemic prevention scenarios, and quantitatively assess their preventive effects. The results show that the GTNNWR model exhibits superior predictive capacity to the conventional infectious disease dynamics model (SEIR model), which is approximately 9% higher, and reflects the spatial and temporal heterogeneity well. In scenario simulations, this study established five scenarios for epidemic prevention measures, and the results indicate that masks are the most influential single preventive measure, reducing deaths by 5.38%, followed by vaccination at 3.59%, and social distancing mandates at 2.69%. However, implementing single stringent preventive measures does not guarantee effectiveness across all states and months, such as California in January 2025, Florida in August 2024, and March–April 2024 in the continental U.S. On the other hand, the combined implementation of preventive measures proves 5 to-10-fold more effective than any single stringent measure, reducing deaths by 27.2%. The deaths under combined implementation measures never exceed that of standard preventive measures in any month. The research found that the combined implementation of measures in mask wearing, vaccination, and social distancing during winter can reduce the deaths by approximately 45%, which is approximately 1.5–3-fold higher than in the other seasons. This study provides valuable insights for COVID-19 epidemic prevention and control in America.",
                    "citation": "Jingtao Sun, Jin Qi, Zhen Yan... (2024). Quantitative Study on American COVID-19 Epidemic Predictions and Scenario Simulations. ISPRS Int. J. Geo Inf., 13, 31. DOI: 10.3390/ijgi13010031",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The research found that the combined implementation of measures in mask wearing, vaccination, and social distancing during winter can reduce the deaths by approximately 45%, which is approximately 1.5–3-fold higher than in the other seasons."
                    }
                }
            ],
            "summary": ""
        },
        {
            "query": "simulation studies of SEIR model on degree-heterogeneous (scale-free) vs. homogeneous networks",
            "papers": [
                {
                    "paper_title": "ADVANCES IN MODELLING, HEALTH-MONITORING, INFRASTRUCTURES, GEOMATICS, GEOTECHNICS, HAZARDS, ENGINEERING STRUCTURES, TRANSPORTATION (AIM HIGHEST) TRANSPORTATION (AIM HIGHEST)",
                    "abstract": null,
                    "citation": " (None). ADVANCES IN MODELLING, HEALTH-MONITORING, INFRASTRUCTURES, GEOMATICS, GEOTECHNICS, HAZARDS, ENGINEERING STRUCTURES, TRANSPORTATION (AIM HIGHEST) TRANSPORTATION (AIM HIGHEST). . DOI: Unknown",
                    "summary (tldr)": null
                }
            ],
            "summary": ""
        }
    ]
}