{
    "results": [
        {
            "query": "network clustering impact epidemic dynamics SIR Watts-Strogatz Erdős-Rényi 2020..2024",
            "papers": [
                {
                    "title": "Analysing Disease Spread on Complex Networks Using Forman–Ricci Curvature",
                    "abstract": "Infectious-disease dynamics depend on heterogeneous contact structure, which classical homogeneous-mixing models such as SIR/SEIR cannot capture. We develop a curvature-informed network SIR framework that embeds Forman–Ricci curvature (FRC), a discrete topological descriptor of fragility and robustness, into per-edge transmission. We compute FRC on undirected and directed Erdős–Rényi, Watts–Strogatz, Barabási–Albert, and Power–Law Cluster networks, and relate curvature to degree, clustering, and betweenness to identify structurally influential nodes and bridge edges. Using curvature-adjusted transmission, we simulate epidemics across topologies and infection rates, then validate predictively with a controlled “hidden-truth” benchmark: posterior-calibrated FRC models are compared with advanced centrality-weighted baselines (EdgeBetweenness, Degree, Eigenvector) under identical fit/holdout splits. On heterogeneous graphs (Barabási–Albert/Power–Law Cluster), FRC improves holdout Root Mean Squared Error (RMSE), peak-time accuracy, and final-size proximity. A compact sensitivity analysis over baseline transmission and clustering, with Partial Rank Correlation Coefficient (PRCC), shows these gains are robust across parameter regimes. Intervention ablations (cases averted vs. budget) further show that vaccinating high-curvature nodes and protecting extreme negative-curvature bridges can outperform EdgeBetweenness targeting at practical budgets. Directed networks exhibit sharper peaks and faster resolution, with strongly negative out-curvature marking putative exporters. In general, FRC provides a principled geometric signal that enhances network epidemic models and yields concrete, topology-aware guidance for targeted vaccination and community-bridge control.",
                    "citation": "Oladimeji Samuel Sowole, N. Bragazzi, Geminpeter A. Lyakurwa (2025). Analysing Disease Spread on Complex Networks Using Forman–Ricci Curvature. Mathematics. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A curvature-informed network SIR framework that embeds Forman–Ricci curvature (FRC), a discrete topological descriptor of fragility and robustness, into per-edge transmission provides a principled geometric signal that enhances network epidemic models and yields concrete, topology-aware guidance for targeted vaccination and community-bridge control."
                    },
                    "url": "https://www.semanticscholar.org/paper/2627f3ba9c1217f944072957731005cb09c6a8fe"
                },
                {
                    "title": "Mean first-encounter times of simultaneous random walkers with resetting on networks",
                    "abstract": "We investigate the dynamics of simultaneous random walkers with resetting on networks and derive exact analytical expressions for the mean first-encounter times of Markovian random walkers. Specifically, we consider two cases for the simultaneous dynamics of two random walkers on networks: when only one walker resets to the initial node, and when both walkers return to their initial positions. In both cases, the encounter times are expressed in terms of the eigenvalues and eigenvectors of the transition matrix of the normal random walk, providing a spectral interpretation of the impact of resetting. We validate our approach through examples on rings, Cayley trees, and random networks generated using the Erdös–Rényi, Watts–Strogatz, and Barabási–Albert algorithms, where resetting significantly reduces encounter times. The proposed framework can be extended to other types of random walk dynamics, transport processes, or multiple-walker scenarios, with potential applications in human mobility, epidemic spreading, and search strategies in complex systems.",
                    "citation": "Daniel Rubio-G'omez, A. P. Riascos, José L Mateos (2025). Mean first-encounter times of simultaneous random walkers with resetting on networks. Unknown Journal. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/77cac3d3935f4b96c7e1e1d6a3629fa9ae4a6cff"
                },
                {
                    "title": "Assessing the impacts of vaccination and viral evolution in contact networks",
                    "abstract": "A key lesson learned with COVID-19 is that public health measures were very different from country to country. In this study, we provide an analysis of epidemic dynamics using three well-known stochastic network models—small-world networks (Watts–Strogatz), random networks (Erdös–Rényi), and scale-free networks (Barabási–Albert)—to assess the impact of different viral strains, lockdown strategies, and vaccination campaigns. We highlight the significant role of highly connected nodes in the spread of infections, particularly within Barabási–Albert networks. These networks experienced earlier and higher peaks in infection rates, but ultimately had the lowest total number of infections, indicating their rapid transmission dynamics. We also found that intermittent lockdown strategies, particularly those with 7-day intervals, effectively reduce the total number of infections, serving as viable alternatives to prolonged continuous lockdowns. When simulating vaccination campaigns, we observed a bimodal distribution leading to two distinct outcomes: pandemic contraction and pandemic expansion. For WS and ER networks, rapid mass vaccination campaigns significantly reduced infection rates compared to slower campaigns; however, for BA networks, differences between vaccination strategies were minimal. To account for the evolution of a virus into a more transmissible strain, we modeled vaccination scenarios that varied vaccine efficacy against the wild-type virus and noted a decline in this efficacy over time against a second variant. Our results showed that vaccination coverage above 40% significantly flattened infection peaks for the wild-type virus, while at least 80% coverage was required to similarly reduce peaks for variant 2. Furthermore, the effect of vaccine efficacy on reducing the peak of variant 2 infection was minimal. Although vaccination strategies targeting hub nodes in scale-free networks did not substantially reduce the total number of infections, they were effective in increasing the probability of preventing pandemic outbreaks. These findings underscore the need to consider the network structure for effective pandemic control.",
                    "citation": "Rodolfo Blanco-Rodríguez, J. Tetteh, Esteban A. Hernández-Vargas (2024). Assessing the impacts of vaccination and viral evolution in contact networks. Scientific Reports. Citations: 4, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This study provides an analysis of epidemic dynamics using three well-known stochastic network models to assess the impact of different viral strains, lockdown strategies, and vaccination campaigns and highlights the significant role of highly connected nodes in the spread of infections, particularly within Barabási–Albert networks."
                    },
                    "url": "https://www.semanticscholar.org/paper/2eae324fad684b0493b5bb9bfd94d23e684f5789"
                },
                {
                    "title": "On the Effect of Complex Network Topology in Managing Epidemic Outbreaks",
                    "abstract": null,
                    "citation": "Yulian Kuryliak, M. Emmerich, D. Dosyn (2021). On the Effect of Complex Network Topology in Managing Epidemic Outbreaks. MoMLeT+DS. Citations: 4, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The simulations show that the increase of the average shortest path length is significant on the reduction of the PCIN, whereas other characteristics such as clustering and age distribution are of lesser importance."
                    },
                    "url": "https://www.semanticscholar.org/paper/8fcff4786e5fb21b019a15023acee26f909d2041"
                },
                {
                    "title": "Study on the Influence of Direct Contact Network Topology on the Speed of Spread of Infectious Diseases in the Covid-19 Case",
                    "abstract": "The management of epidemics received much interest in recent times, due to devastating outbreaks of epidemic diseases such as Ebola and COVID-19. This paper investigates the effect of the structure of the contact network on the dynamics of the epidemic outbreak. In particular we focus on the peak number of critically infected nodes, because this determines the workload of intensive health-care units and should be kept low when managing an epidemic. Simulation of virus propagation in complex networks of different topologies, generated according to the models of Erdős—Rényi, Watts-Strogatz, Barabási—Albert and in complete graph. Continuous-time Markov chains were used to simulate the infection process. The simulation was performed in networks with 200 nodes and different number of edges. The difference between the influence of age- and gender-determined and weighted characteristics of nodes on the number of critically infected nodes that can be used to predict the load on the hospital is analyzed. The analysis used the data of the demographic distribution of Ukraine as of 2020 and data on mortality from COVID-19 in Ukraine, as of December 16, 2020. It is proved that the deterministic characteristics a slightly lower values of critically infected, in small networks. According to the simulation results, it was proven that for one medium degree of connection, the largest peak number of infections is observed in the Barabási—Albert models, slightly less in the Erdős— Rényi models and the smallest in the Watts-Strogatz model. It is established that the main difference between these networks is the average shortest distance. It is proved that the main influence on the propagation rate has the average shortest distance between network nodes, location, clustering coefficient has less influence. It was found that with a large number of edges in the networks, the difference in the prevalence of viruses in the models of the Erdős—Rényi and Barabási—Albert networks is minimized, despite the reduction of the average shortest distance between nodes.",
                    "citation": "Yulian Kuryliak, M. Emmerich, D. Dosyn (2021). Study on the Influence of Direct Contact Network Topology on the Speed of Spread of Infectious Diseases in the Covid-19 Case. Vìsnik Nacìonalʹnogo unìversitetu \"Lʹvìvsʹka polìtehnìka\". Serìâ Ìnformacìjnì sistemi ta merežì. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It was found that with a large number of edges in the networks, the difference in the prevalence of viruses in the models of the Erdős—Rényi and Barabási—Albert networks is minimized, despite the reduction of the average shortest distance between nodes."
                    },
                    "url": "https://www.semanticscholar.org/paper/f98d4ace60b7ca401e68a6dcc42b94b09b9cac4a"
                }
            ],
            "summary": ""
        }
    ]
}