{
    "results": [
        {
            "query": "epidemic dynamics clustering small-world networks random networks SIR model",
            "papers": [
                {
                    "title": "MATHEMATICAL MODELING OF EPIDEMIC DYNAMICS WITH STOCHASTIC AI PREDICTION MODELS",
                    "abstract": "Epidemic modeling has long relied on deterministic approaches such as the SIR and SEIR frameworks, which assume uniform transmission dynamics and neglect stochastic fluctuations arising from real-world variability. However, infectious disease spread is inherently uncertain affected by random contact patterns, environmental factors, and behavioral dynamics. This study presents a hybrid stochastic–AI framework for epidemic prediction that integrates classical mathematical models with artificial intelligence–driven uncertainty quantification. The stochastic model extends the SIR formulation by incorporating probabilistic distributions for transmission and recovery rates, simulated through Monte Carlo methods. Concurrently, deep learning models such as Long Short-Term Memory (LSTM) networks and Bayesian neural predictors are employed to forecast infection trends using real epidemiological data. The hybridization allows continuous calibration of the stochastic model parameters based on AI-derived forecasts, enhancing adaptability and predictive accuracy. Results demonstrate that the hybrid stochastic–AI approach captures dynamic outbreak evolution more accurately than traditional models, providing probabilistic confidence intervals that quantify uncertainty in epidemic peaks and durations. This modeling paradigm offers a data-driven pathway toward real-time epidemic forecasting, vital for decision-making in public health policy and resource allocation.",
                    "citation": "Ranadheer Donthi (2025). MATHEMATICAL MODELING OF EPIDEMIC DYNAMICS WITH STOCHASTIC AI PREDICTION MODELS. International Journal of Applied Mathematics. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A hybrid stochastic–AI framework for epidemic prediction that integrates classical mathematical models with artificial intelligence–driven uncertainty quantification is presented, providing probabilistic confidence intervals that quantify uncertainty in epidemic peaks and durations."
                    },
                    "url": "https://www.semanticscholar.org/paper/7cce084bde7064c1d29d37638e3e941ba973af28"
                },
                {
                    "title": "Behavior-Aware COVID-19 Forecasting Using Markov SIR Models on Dynamic Contact Networks: An Observational Modeling Study",
                    "abstract": null,
                    "citation": "M. Dadashkarimi (2025). Behavior-Aware COVID-19 Forecasting Using Markov SIR Models on Dynamic Contact Networks: An Observational Modeling Study. medRxiv. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel framework integrating time-varying contact networks, Markov chain-based Susceptible-Infectious-Recovered (SIR) dynamics, and adaptive behavioral responses enhances epidemic forecasting accuracy."
                    },
                    "url": "https://www.semanticscholar.org/paper/25d94a2ccc5a4b1a0eabd3b84baa401529d06c3a"
                },
                {
                    "title": "Stochastic SIR Model for Computer Worm Propagation",
                    "abstract": "Malware (viruses, worms or ransomware) propagation is a critical cybersecurity challenge, exploiting network vulnerabilities to spread exponentially. Traditional deterministic models, starting from biological epidemic theory, fail to capture the randomness of real-world propagation due to their reliance on fixed parameters and homogeneous network assumptions. To address these limitations, we propose a stochastic SIR model where the infection rate follows an Ornstein-Uhlenbeck (OU) process. This would allow for dynamic reflection of fluctuations in user behavior, patch cycles, and network topology. Using the Code Red worm as a case study, we compare deterministic and stochastic approaches, demonstrating how the OU-process-driven beta provides a more realistic representation of malware dynamics. The model is described by stochastic differential equations (SDEs), solved numerically via the Euler-Maruyama method. To estimate latent parameters, mean-reversion level, and volatility, we develop an Expectation-Maximization (EM) algorithm coupled with a Kalman filter for efficient state-space estimation of the time-varying parameters.",
                    "citation": "Ihor Zhuravel, Serhiy Semenyuk, Tetiana Korobeinikova, et al. (2025). Stochastic SIR Model for Computer Worm Propagation. Automation, Control, and Information Technology. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/e0bfa54794ccd7be0ad7a464369dfe9bd34a347c"
                },
                {
                    "title": "Does the Optimal Update Strategy Effectively Promote the Low-Carbon Technology Diffusion Among Manufacturers? An Evolutionary Game of Small-World Network Analysis",
                    "abstract": "A complex network topology marked by co-competitive relationships between manufacturing enterprises can meaningfully influence low-carbon technology selection, thereby affecting the low-carbon technology diffusion process. This study develops a small-world network game model based on an optimal update strategy involving the government and manufacturers with co-competitive relationships, and then uses it to assess the evolutionary dynamics of low-carbon technology selection and diffusion among manufacturers. The results indicate that the government should identify the critical threshold for subsidies based on the carbon tax to optimize the regulatory and incentivizing effects of government subsidies. The topological structure of manufacturers’ small-world networks is the key to low-carbon technology selection and diffusion. In favorable conditions, when a small-world network approaches a regular network in terms of structure, the extent of low-carbon technology diffusion is maximized; in unfavorable conditions, diffusion is minimal. Thus, the government can tighten or relax market access restrictions on the manufacturing industry and encourage the development of manufacturing clusters to change the structure of market competition. Compared with the random selection, the optimal update strategy can increase the probability density of low-carbon technology diffusion among manufacturers and rapidly achieve a balanced, stable state.",
                    "citation": "Wanting Chen, Zhihua Hu (2025). Does the Optimal Update Strategy Effectively Promote the Low-Carbon Technology Diffusion Among Manufacturers? An Evolutionary Game of Small-World Network Analysis. Syst.. Citations: 1, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/052a6dd8c04e6e253dfc626e79d895b4f1c48ae9"
                },
                {
                    "title": "Modelling Semi-Random Human Mixing: A Modified Force of Infection in Population-level Epidemic Modelling",
                    "abstract": null,
                    "citation": "M. L. Smah, A. Seale, K. S. Rock (2025). Modelling Semi-Random Human Mixing: A Modified Force of Infection in Population-level Epidemic Modelling. medRxiv. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "An equation-based SeRaMix model with a modified force-of-infection function that preserves mathematical tractability while capturing more realistic mixing patterns is derived and validated against stochastic, individual-based model (IBM) simulations."
                    },
                    "url": "https://www.semanticscholar.org/paper/a25deb4a110b0e2525c939eaf0b8a1984df1d412"
                },
                {
                    "title": "ANALYSIS OF MATHEMATICAL MODELS OF RANDOM GRAPHS",
                    "abstract": "Relevance. In the modern world, the majority of social, biological, technological, and communication processes occur in the form of complex network structures. The analysis of such systems requires the construction of mathematical models capable of adequately describing their topology, stochastic nature, and dynamic properties. One of the most powerful tools for this is the theory of random graphs, which enables the modeling of a wide range of real-world phenomena – from the spread of viruses and information to the functioning of critical infrastructures. Classical models, particularly the Erdős-Rényi model, laid the foundation of modern graph theory; however, they have limitations in describing networks with high clustering or uneven degree distributions. Therefore, in recent years, modern approaches have gained special significance, including small-world models, which reflect the properties of real social and biological systems with short paths and a high level of clustering, and scale-free graphs, which model networks with heterogeneous degree distributions. The relevance of this topic is due to the need to select and analyze an appropriate mathematical model that can accurately represent the properties of real networks, enable justified prediction of their behavior, identify vulnerabilities, and optimize the functioning of complex systems. In this context, the analysis of mathematical models of random graphs is an important area of modern applied mathematics, computer science, and systems theory. The object of research: Random graphs as mathematical structures that model the topology and dynamics of complex networked systems. Purpose of the article: Research, systematization, and comparative analysis of mathematical models of random graphs to determine their suitability for modeling various types of complex networked systems. Research results. The article presents an analysis of mathematical models of random graphs that underpin modern network science. Beginning with the theoretical foundations of graphs, both classical and contemporary models for constructing random networks are examined, alongside methods of their analysis and practical areas of application. The methods of analysis are critically important for the practical use of random graphs, as they enable the models to be applied to forecasting, diagnostics, and the management of complex systems. These methods also provide a foundation for integrating mathematical models with real-world data, which is a key objective of contemporary network science. Classical models allow for the formalization of randomness in network connections; however, they have significant limitations in capturing the real topological properties of complex networks – particularly high clustering, degree heterogeneity, and growth mechanisms. In contrast, modern models correspond much more closely to the structure of real-world systems. They make it possible to model such essential features as the emergence of hubs, clustering, short average path lengths, and robustness to failures. Conclusions. Mathematical models of random graphs are a universal tool for the analysis and synthesis of various networked systems. Their application allows not only for the formal description of a complex system’s structure, but also for the discovery of its hidden patterns, the prediction of its behavior under different conditions, and the optimization of its functioning while accounting for real-world constraints.",
                    "citation": "V. Gorbachov, Vitalii Fedorov (2025). ANALYSIS OF MATHEMATICAL MODELS OF RANDOM GRAPHS. Системи управління навігації та зв'язку Збірник наукових праць. Citations: 0, Influential: 0.",
                    "summary (tldr)": null,
                    "url": "https://www.semanticscholar.org/paper/22e5940de5464a70fef7d8d7ae1a0feb0d963264"
                },
                {
                    "title": "Modeling of Malware Propagation in Wireless Mobile Networks with Hotspots Considering the Movement of Mobile Clients Based on Cosine Similarity",
                    "abstract": "In this paper, we propose a deterministic epidemic model for malware propagation in wireless mobile environments, taking into account the presence of hotspots. Conventional epidemic models for wireless mobile environments typically assume that mobile hosts randomly move in a given area. However, in real-world scenarios, hotspots such as restaurants and universities often attract large gatherings of people. Therefore, the assumption of purely random movement is not suitable for modeling these scenarios. To realistically represent the movement patterns of mobile hosts, we incorporate the influence of hotspots into our model. Specifically, we formulate a system of Ordinary Differential Equations (ODEs) that captures the infection dynamics in scenarios where one or more hotspots affect host mobility. Our model introduces non-uniform movement probabilities based on cosine similarity, allowing us to reflect the tendency of mobile hosts to cluster around specific locations. By applying these movement probabilities to the ODEs, our epidemic model provides a more accurate representation of malware spreading behavior in hotspot-affected environments. We investigate how malware propagates through mobile hosts and compare the dynamics between the conventional and our proposed models. Numerical experiments demonstrate that our epidemic model effectively captures malware spreading behavior in mobile scenarios with hotspots.",
                    "citation": "Hideyoshi Miura, Tomotaka Kimura, Kouji Hirata (2025). Modeling of Malware Propagation in Wireless Mobile Networks with Hotspots Considering the Movement of Mobile Clients Based on Cosine Similarity. Electronics. Citations: 1, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A deterministic epidemic model for malware propagation in wireless mobile environments, taking into account the presence of hotspots is proposed, providing a more accurate representation of malware spreading behavior in hotspot-affected environments."
                    },
                    "url": "https://www.semanticscholar.org/paper/2f12756524a121b15ea3a32e1c07200104b0b54a"
                }
            ],
            "summary": ""
        },
        {
            "query": "epidemic wavefront speed clustering Watts-Strogatz Erdős-Rényi networks SIR",
            "papers": [
                {
                    "title": "Analysing Disease Spread on Complex Networks Using Forman–Ricci Curvature",
                    "abstract": "Infectious-disease dynamics depend on heterogeneous contact structure, which classical homogeneous-mixing models such as SIR/SEIR cannot capture. We develop a curvature-informed network SIR framework that embeds Forman–Ricci curvature (FRC), a discrete topological descriptor of fragility and robustness, into per-edge transmission. We compute FRC on undirected and directed Erdős–Rényi, Watts–Strogatz, Barabási–Albert, and Power–Law Cluster networks, and relate curvature to degree, clustering, and betweenness to identify structurally influential nodes and bridge edges. Using curvature-adjusted transmission, we simulate epidemics across topologies and infection rates, then validate predictively with a controlled “hidden-truth” benchmark: posterior-calibrated FRC models are compared with advanced centrality-weighted baselines (EdgeBetweenness, Degree, Eigenvector) under identical fit/holdout splits. On heterogeneous graphs (Barabási–Albert/Power–Law Cluster), FRC improves holdout Root Mean Squared Error (RMSE), peak-time accuracy, and final-size proximity. A compact sensitivity analysis over baseline transmission and clustering, with Partial Rank Correlation Coefficient (PRCC), shows these gains are robust across parameter regimes. Intervention ablations (cases averted vs. budget) further show that vaccinating high-curvature nodes and protecting extreme negative-curvature bridges can outperform EdgeBetweenness targeting at practical budgets. Directed networks exhibit sharper peaks and faster resolution, with strongly negative out-curvature marking putative exporters. In general, FRC provides a principled geometric signal that enhances network epidemic models and yields concrete, topology-aware guidance for targeted vaccination and community-bridge control.",
                    "citation": "Oladimeji Samuel Sowole, N. Bragazzi, Geminpeter A. Lyakurwa (2025). Analysing Disease Spread on Complex Networks Using Forman–Ricci Curvature. Mathematics. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A curvature-informed network SIR framework that embeds Forman–Ricci curvature (FRC), a discrete topological descriptor of fragility and robustness, into per-edge transmission provides a principled geometric signal that enhances network epidemic models and yields concrete, topology-aware guidance for targeted vaccination and community-bridge control."
                    },
                    "url": "https://www.semanticscholar.org/paper/2627f3ba9c1217f944072957731005cb09c6a8fe"
                },
                {
                    "title": "Study on the Influence of Direct Contact Network Topology on the Speed of Spread of Infectious Diseases in the Covid-19 Case",
                    "abstract": "The management of epidemics received much interest in recent times, due to devastating outbreaks of epidemic diseases such as Ebola and COVID-19. This paper investigates the effect of the structure of the contact network on the dynamics of the epidemic outbreak. In particular we focus on the peak number of critically infected nodes, because this determines the workload of intensive health-care units and should be kept low when managing an epidemic. Simulation of virus propagation in complex networks of different topologies, generated according to the models of Erdős—Rényi, Watts-Strogatz, Barabási—Albert and in complete graph. Continuous-time Markov chains were used to simulate the infection process. The simulation was performed in networks with 200 nodes and different number of edges. The difference between the influence of age- and gender-determined and weighted characteristics of nodes on the number of critically infected nodes that can be used to predict the load on the hospital is analyzed. The analysis used the data of the demographic distribution of Ukraine as of 2020 and data on mortality from COVID-19 in Ukraine, as of December 16, 2020. It is proved that the deterministic characteristics a slightly lower values of critically infected, in small networks. According to the simulation results, it was proven that for one medium degree of connection, the largest peak number of infections is observed in the Barabási—Albert models, slightly less in the Erdős— Rényi models and the smallest in the Watts-Strogatz model. It is established that the main difference between these networks is the average shortest distance. It is proved that the main influence on the propagation rate has the average shortest distance between network nodes, location, clustering coefficient has less influence. It was found that with a large number of edges in the networks, the difference in the prevalence of viruses in the models of the Erdős—Rényi and Barabási—Albert networks is minimized, despite the reduction of the average shortest distance between nodes.",
                    "citation": "Yulian Kuryliak, M. Emmerich, D. Dosyn (2021). Study on the Influence of Direct Contact Network Topology on the Speed of Spread of Infectious Diseases in the Covid-19 Case. Vìsnik Nacìonalʹnogo unìversitetu \"Lʹvìvsʹka polìtehnìka\". Serìâ Ìnformacìjnì sistemi ta merežì. Citations: 0, Influential: 0.",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It was found that with a large number of edges in the networks, the difference in the prevalence of viruses in the models of the Erdős—Rényi and Barabási—Albert networks is minimized, despite the reduction of the average shortest distance between nodes."
                    },
                    "url": "https://www.semanticscholar.org/paper/f98d4ace60b7ca401e68a6dcc42b94b09b9cac4a"
                }
            ],
            "summary": ""
        }
    ]
}