{
    "results": [
        {
            "query": "competitive SIS multiplex network simulation structural properties",
            "papers": [
                {
                    "paper_title": "Critical properties of Heider balance on multiplex networks.",
                    "abstract": "Heider's structural balance theory has proven invaluable in comprehending the dynamics of social groups characterized by both friendly and hostile relationships. Since people's relations are rarely single faceted, we investigate Heider balance dynamics on a multiplex network, consisting of several copies of the same agent displaying correlated relations at different layers building the multiplex. Intralayer interactions in our model adhere to Heider dynamics, while interlayer correlations stem from Ising interactions, with the heat-bath dynamics of link signs. Our investigation reveals a multifaceted system with a diverse equilibrium landscape contingent on the coexistence of distinct phases across layers. We observe that, starting from a paradise state with positive links in all layers, an increase in temperature triggers a discontinuous transition to a disordered state akin to single-layer scenarios. The critical temperature surpasses that of the single-layer case, a fact verified through extended mean-field analysis and agent-based simulations. Furthermore, the scenario shifts when one layer exhibits a two-clique configuration instead of a paradise state. This change introduces additional transitions: synchronization of interlayer relations and a transition to the disorder, appearing at a different, lower temperature compared to matching paradise states. This exploration shows the intricate interplay of Heider balance and multiplex interactions.",
                    "citation": "Krishnadas Mohandas, K. Suchecki, J. Hołyst (2023). Critical properties of Heider balance on multiplex networks.. Physical review. E, 109 4-1, \n          044306\n        . DOI: 10.1103/physreve.109.044306",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Structural Properties of HEHN- and HAN-Based Ionic Liquid Mixtures: A Polarizable Molecular Dynamics Study.",
                    "abstract": "Molecular dynamics simulations of binary mixtures comprising 2-hydroxyethylhydrazinium nitrate (HEHN) and hydroxylammonium nitrate (HAN) were conducted using the polarizable APPLE&P force field to investigate fundamental properties of multimode propulsion (MMP) propellants. Calculated densities as a function of temperature were in good agreement with experiments and similar simulations. The structural properties of neat HEHN and HAN-HEHN provided insights into their inherent, protic nature. Radial distribution functions (RDFs) identified key hydrogen bonding sites located at N-H···O and O-H···O within a first solvation shell of approximately 2 Å. Angular distribution functions further affirmed the relatively strong nature of the hydrogen bonds with nearly linear directionality. The increased hydroxylammonium cation (HA+) mole fraction shows the influence of competitively strong hydrogen bonds on the overall hydrogen bond network. Dominant spatial motifs via three-dimensional distribution functions along with nearly nanosecond-long hydrogen bond lifetimes highlight the local bonding environment that may precede proton transfer reactions.",
                    "citation": "Shehan M. Parmar, D. Depew, R. Wirz... (2023). Structural Properties of HEHN- and HAN-Based Ionic Liquid Mixtures: A Polarizable Molecular Dynamics Study.. The journal of physical chemistry. B. DOI: 10.1021/acs.jpcb.3c02649",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Universality of eigenvector delocalization and the nature of the SIS phase transition in multiplex networks",
                    "abstract": "Universal spectral properties of multiplex networks allow us to assess the nature of the transition between disease-free and endemic phases in the SIS epidemic spreading model. In a multiplex network, depending on a coupling parameter, p, the inverse participation ratio (IPR) of the leading eigenvector of the adjacency matrix can be in two different structural regimes: (i) layer-localized and (ii) delocalized. Here we formalize the structural transition point, p*, between these two regimes, showing that there are universal properties regarding both the layer size n and the layer configurations. Namely, we show that IPR ∼ n −δ , with δ ≈ 1, and revealed an approximately linear relationship between p* and the difference between the layers’ average degrees. Furthermore, we showed that this multiplex structural transition is intrinsically connected with the nature of the SIS phase transition, allowing us to both understand and quantify the phenomenon. As these results are related to the universal properties of the leading eigenvector, we expect that our findings might be relevant to other dynamical processes in complex networks.",
                    "citation": "Guilherme Ferraz de Arruda, J. A. M'endez-Berm'udez, F. Rodrigues... (2020). Universality of eigenvector delocalization and the nature of the SIS phase transition in multiplex networks. Journal of Statistical Mechanics: Theory and Experiment, 2020. DOI: 10.1088/1742-5468/abbcd4",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "First-principles based deep neural network force field for molecular dynamics simulation of N-Ga-Al semiconductors.",
                    "abstract": "Accurate interatomic force fields are of paramount importance for molecular dynamics simulations to explore the thermal transport at the GaN/AlN heterogenous interface, which is a key factor hindering heat dissipation and limiting the performance of GaN power electronic devices. In this work, an interatomic potential (force field) based on a deep neural network technique and first-principles calculations is developed for N-Ga-Al semiconductors to predict the elastic and thermodynamic properties. Using our deep neural network potential (NNP), the precise structural features, elastic constants, and thermal conductivities of GaN, AlN, and their alloy are obtained, which are well consistent with those from experiments and first-principles calculations. The interfacial thermal conductance of GaN/AlN heterostructures with different interfacial morphologies are further studied using molecular dynamics simulations with the NNP. It is found that atomic interdiffusion and disorder at the interfaces dramatically reduces the interfacial thermal conductance. The developed NNP exhibits a larger effective dimension with respect to classical empirical potentials and reaches competitive performances, thus pointing towards attractive advantages in the study of GaN heterostructures and devices with the NNP.",
                    "citation": "Zixuan Huang, Quan Wang, Xinyu Liu... (2023). First-principles based deep neural network force field for molecular dynamics simulation of N-Ga-Al semiconductors.. Physical chemistry chemical physics : PCCP. DOI: 10.1039/d2cp04697k",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "SIS Epidemic Propagation on Scale-Free Hypernetwork",
                    "abstract": "The hypergraph offers a platform to study structural properties emerging from more complicated and higher-order than pairwise interactions among constituents and dynamical behavior, such as the spread of information or disease. Considering the higher-order interaction between multiple nodes in the system, the mathematical model of infectious diseases spreading on simple scale-free networks is extended to hypernetworks based on hypergraphs. A SIS propagation model based on reaction process strategy in a universal scale-free hypernetwork is constructed, and the theoretical and simulation analysis of the model is carried out. Using mean field theory, the analytical expressions between infection density and hypernetwork structure parameters as well as propagation parameters in steady state are given. Through individual-based simulation, the theoretical results are verified and the infectious disease spread process under the structure of the hypernetwork and simple scale-free network is compared and analyzed. It becomes apparent that infectious diseases are easier to spread on the hypernetworks, showing the clear clustering characteristics of epidemic spread. Furthermore, the influence of the hypernetwork structure and model parameters on the propagation process is studied. The results of this paper are helpful in further studying the propagation dynamics on the hypernetworks. At the same time, it provides a certain theoretical basis for the current COVID-19 prevention and control in China and the prevention of infectious diseases in the future.",
                    "citation": "Kaijun Wang, Yunchao Gong, Feng Hu (2022). SIS Epidemic Propagation on Scale-Free Hypernetwork. Applied Sciences. DOI: 10.3390/app122110934",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A SIS propagation model based on reaction process strategy in a universal scale-free hypernetwork is constructed and provides a certain theoretical basis for the current COVID-19 prevention and control in China and the prevention of infectious diseases in the future."
                    }
                },
                {
                    "paper_title": "Epidemic Threshold in Temporal Multiplex Networks With Individual Layer Preference",
                    "abstract": "Many efforts have been devoted to understanding how human behaviors induced by the awareness of disease influence the epidemic dynamics in multiplex networks. The awareness and virus spreading is mostly studied with the unaware-aware-unaware-susceptible-infected-susceptible (UAU-SIS) model over a given and fixed (static) network. However, the role of the spatial-temporal properties of multiplex networks to the epidemic spreading is not fully understood. In this work, a temporal multiplex network consists of a static information spreading network and a temporal physical contact network with a layer-preference walk. Defining the tendency of aware nodes moving to a specified layer as the layer preference, we focus on two scenarios: (i) the layer preference is constant, (ii) the layer preference is a function of the degree of nodes in the information layer. We deduce the epidemic threshold of such a temporal multiplex network, and validate it through numerical simulations. Moreover, we find that the epidemic threshold decreases with the decrease of the effective information spreading rate and the increase of the layer preference. Furthermore, we find that when the node with a higher degree displays a higher layer preference, the spreading process on the network is remarkably promoted. The findings shed a new light on the control of the epidemic spreading process.",
                    "citation": "Cong Li, Yuan-jiao Zhang, Xiang Li (2021). Epidemic Threshold in Temporal Multiplex Networks With Individual Layer Preference. IEEE Transactions on Network Science and Engineering, 8, 814-824. DOI: 10.1109/TNSE.2021.3055352",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The epidemic threshold of a temporal multiplex network consisting of a static information spreading network and a temporal physical contact network with a layer-preference walk is deduced and it is found that when the node with a higher degree displays a higher layer preference, the spreading process on the network is remarkably promoted."
                    }
                },
                {
                    "paper_title": "Enhance the Transfer Capacity of Multiplex Networks",
                    "abstract": "Most complex real systems are found to have multiple layers of connectivity and required to be modelled as multiplex networks. One of the extremely critical problems is to reduce the congestion and enhance the transfer capacity, especially in real communication networks with a big data environment. A novel and effective strategy to improve traffic and control congestion is proposed by adding edges according to their weights which are defined by the topology structural properties. Furthermore, which layer is more effective when our strategy is applied is discussed based on its topology structure. Adding edges between nodes whose product of multiplex network betweenness is the highest is confirmed to be more effective, particularly in the layer with stronger community structure. Simulation experiments on both computer-generated and real-world networks demonstrate that our strategy can enhance the transfer capacity of multiplex networks significantly, which is in good agreement with our analysis.",
                    "citation": "Fei Shao, Wei Zhao, B. Cheng (2021). Enhance the Transfer Capacity of Multiplex Networks. Complex., 2021, 6687463:1-6687463:8. DOI: 10.1155/2021/6687463",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Simulation experiments demonstrate that the novel and effective strategy to improve traffic and control congestion by adding edges according to their weights which are defined by the topology structural properties can enhance the transfer capacity of multiplex networks significantly."
                    }
                }
            ],
            "summary": "Based on the query \"competitive SIS multiplex network simulation structural properties\" and the provided papers, I have extracted, reflected on, and synthesized the most relevant information as follows:\n\n---\n\n### Summary and Analysis\n\n1. **SIS Epidemic Spreading on Multiplex Networks**  \n   The paper titled *\"Universality of eigenvector delocalization and the nature of the SIS phase transition in multiplex networks\"* (Arruda et al., 2020) provides strong theoretical and simulation-based insights into the structural properties of multiplex networks related to SIS epidemic spreading. Key findings include:\n\n   - **Structural Regimes & Inverse Participation Ratio (IPR):**  \n     The leading eigenvector of the multiplex adjacency matrix can be in either a *layer-localized* or *delocalized* regime. This eigenvector structure is essential since it governs the spreading dynamics and phase transition behavior.\n   \n   - **Transition Point (p*) Between Regimes:**  \n     A universal multiplex structural transition parameter *p* exists, separating these regimes. This parameter correlates linearly with the difference in average degree between network layers and scales with layer size \\( n \\) as \\(\\text{IPR} \\sim n^{-\\delta}\\) with \\(\\delta \\approx 1\\).\n   \n   - **Connection to SIS Phase Transition:**  \n     The multiplex structural transition seamlessly corresponds to the nature of the SIS epidemic threshold transition—from disease-free to endemic. This duality allows the characterization and quantification of the epidemic transition based on network structural signatures.\n   \n   Thus, this work strongly links spectral properties and multiplex structure with SIS epidemic dynamics, offering a pathway for simulation-based studies to predict and analyze epidemic thresholds and prevalence in multiplex networks.\n\n2. **Temporal Multiplex Networks & Layer Preference in SIS Dynamics**  \n   The study *\"Epidemic Threshold in Temporal Multiplex Networks With Individual Layer Preference\"* (Li et al., 2021) extends the SIS modeling to temporal multiplex settings where nodes exhibit *layer preference*—a tendency to move preferentially in one network layer over another (e.g., information spreading layer versus physical contact layer).\n\n   - **Effect on Epidemic Threshold:**  \n     The epidemic threshold decreases with increasing layer preference—i.e., preferential interaction within certain layers promotes easier disease spread.\n   \n   - **Degree-Dependent Layer Preference:**  \n     When nodes with higher degree in the information layer choose to preferentially move in that layer, the epidemic spreading is significantly enhanced.\n   \n   This highlights how the dynamic interplay of multiplex layers (not static) and individual behavior strongly affect epidemic outcomes and can be critical in designing control strategies or simulations that integrate temporality and layer dynamics.\n\n3. **Higher-Order Structural Effects in SIS Dynamics**  \n   The *\"SIS Epidemic Propagation on Scale-Free Hypernetwork\"* paper (Wang et al., 2022) is also relevant here since hypernetworks generalize multiplex networks by incorporating higher-order interactions beyond pairwise links.\n\n   - **Enhanced Spreading via Hypergraph Clustering:**  \n     Epidemics spread more easily on scale-free hypernetworks compared to simple scale-free networks, owing to inherent clustering and multi-node interactions.\n   \n   Although not strictly a multiplex model, this work informs that simulations of SIS on multiplex structures need to consider possible higher-order correlations or group interactions that amplify spreading.\n\n4. **Network Structural Properties and Simulation Methods**  \n   The *\"Enhance the Transfer Capacity of Multiplex Networks\"* (Shao et al., 2021) describes strategies to improve traffic flow in multiplex networks by leveraging structural properties (betweenness centrality, community structure). While this is focused on transportation/communication rather than epidemiological spreading, the principles of structural influence (e.g., which layer acts as bottleneck, effect of adding edges in certain layers) are transferable to SIS simulations.\n\n5. **Other Papers' Relevance**  \n   - *Heider balance on multiplex* (Mohandas et al., 2023) studies social balance dynamics but also reveals complex phase transitions in multiplex layers that may analogously impact SIS transitions.\n   - The ionic liquids and neural network force field papers are unrelated to SIS or network structural simulations.\n\n---\n\n### Final Results and Scientific Summary\n\n**Structural Properties of Competitive SIS Multiplex Networks and Simulation Insights:**\n\n- *Multiplex network structure fundamentally shapes SIS epidemic spreading*, characterizing distinct regimes of eigenvector localization (layer-localized vs. delocalized) governing disease phase outcomes (Arruda et al., 2020). The universal scaling laws related to the inverse participation ratio (IPR) and the critical coupling parameter \\(p^*\\) provide robust metrics for anticipating phase transitions.\n\n- *Temporal dynamics and individual layer preferences introduce significant heterogeneity in spreading behavior.* Nodes favoring certain layers can lower epidemic thresholds and accelerate outbreaks (Li et al., 2021). Hence, simulation models must incorporate both static topology and temporal, preferential interactions to accurately capture epidemic dynamics in multiplex systems.\n\n- *Higher-order interactions modeled via hypernetworks suggest enhanced clustering effects that facilitate faster SIS spreading* compared to traditional pairwise multiplex models (Wang et al., 2022). This implies that competitive SIS simulation frameworks should consider hypernetwork-like interaction motifs when relevant.\n\n- *Structural enhancement strategies (e.g., adding edges based on betweenness in certain layers) can affect spreading capacity and congestion,* which could be translated to SIS simulations for controlling epidemic propagation or optimizing prevention strategies (Shao et al., 2021).\n\n---\n\n### Implications for Simulation Design\n\nResearchers simulating competitive SIS models on multiplex networks should:\n\n1. Analyze spectral properties (especially leading eigenvector localization) to determine epidemic thresholds and phase characteristics.\n\n2. Incorporate temporal multiplexity and layer preference user behavior when modeling disease spread.\n\n3. Recognize that multiplex layer interplay can produce first-order and discontinuous transitions, adding complexity to simulation outcomes.\n\n4. Consider higher-order interactions or hyperedges if the system's interactions extend beyond pairwise, for more realistic disease propagation modeling.\n\n5. Use structural metrics (betweenness, community structure) to guide interventions modeled as edge additions/removals for altering spreading dynamics.\n\n---\n\n### References\n\n- Arruda, G. F. de, M'endez-Berm'udez, J. A., Rodrigues, F. A. (2020). *Universality of eigenvector delocalization and the nature of the SIS phase transition in multiplex networks*. J. Stat. Mech. DOI:10.1088/1742-5468/abbcd4\n\n- Li, C., Zhang, Y.-j., Li, X. (2021). *Epidemic Threshold in Temporal Multiplex Networks With Individual Layer Preference*. IEEE Trans. Netw. Sci. Eng. DOI:10.1109/TNSE.2021.3055352\n\n- Wang, K., Gong, Y., Hu, F. (2022). *SIS Epidemic Propagation on Scale-Free Hypernetwork*. Applied Sciences. DOI:10.3390/app122110934\n\n- Shao, F., Zhao, W., Cheng, B. (2021). *Enhance the Transfer Capacity of Multiplex Networks*. Complexity. DOI:10.1155/2021/6687463\n\n---\n\nIf you require specific details on simulation protocols, numerical methods, or analytical derivations related to competitive SIS on multiplex networks, please provide additional papers or specify further. Based on the currently available information, this is the most precise scientific synthesis I can provide."
        }
    ]
}