{
    "results": [
        {
            "query": "SIR epidemic model temporal networks static networks activity-driven network epidemic threshold outbreak size R0=3",
            "papers": [
                {
                    "paper_title": "Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone",
                    "abstract": "Activity-driven networks (ADNs) are a powerful paradigm to study epidemic spreading in temporal networks, where the dynamics of the disease and the evolution of the links share a common time-scale. One of the key assumptions of ADNs is the lack of preferential connections among individuals. This assumption hinders the application of ADNs to several realistic scenarios where some contacts persist in time, rather than intermittently activate. Here, we examine an improved modeling framework that superimposes an ADN to a static backbone network, toward the integration of persistent contacts with time-varying connections. To demonstrate the interplay between the ADN and the static backbone, we investigate the effect of behavioral changes on the disease dynamics. In this framework, each individual may adapt his/her activity as a function of the health status, thereby adjusting the relative weight of time-varying versus static links. To illustrate the approach, we consider two classes of backbone networks, Erdős-Rényi and random regular, and two disease models, SIS and SIR. A general mean-field theory is established for predicting the epidemic threshold, and numerical simulations are conducted to shed light on the role of network parameters on the epidemic spreading and estimate the epidemic size.",
                    "citation": "Matthieu Nadini, A. Rizzo, M. Porfiri (2020). Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone. IEEE Transactions on Network Science and Engineering, 7, 549-561. DOI: 10.1109/TNSE.2018.2885483",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "An improved modeling framework is examined that superimposes an ADN to a static backbone network, toward the integration of persistent contacts with time-varying connections and the effect of behavioral changes on the disease dynamics is investigated."
                    }
                },
                {
                    "paper_title": "A study of epidemic spreading on activity-driven networks",
                    "abstract": "The epidemic spreading was explored on activity-driven networks (ADNs), accounting for the study of dynamics both on and of the ADN. By employing the susceptible-infected-susceptible (SIS) model, two aspects were considered: (1) the infection rate of susceptible agent (depending on the number of its infected neighbors) evolves due to the temporal structure of ADN, rather than being a constant number; (2) the susceptible and infected agents generate unequal links while being activated, namely, the susceptible agent gets few contacts with others in order to protect itself. Results show that, in both cases, the larger epidemic threshold and smaller outbreak size were obtained.",
                    "citation": "Yijiang Zou, Weibing Deng, Wei Li... (2016). A study of epidemic spreading on activity-driven networks. International Journal of Modern Physics C, 27, 1650090. DOI: 10.1142/S012918311650090X",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The epidemic spreading was explored on activity-driven networks (ADNs), accounting for the study of dynamics both on and of the ADN by employing the susceptible-infected-susceptible (SIS) model, showing that the larger epidemic threshold and smaller outbreak size were obtained."
                    }
                },
                {
                    "paper_title": "Contagion processes on the static and activity driven coupling networks",
                    "abstract": "The evolution of network structure and the spreading of epidemic are common coexistent dynamical processes. In most cases, network structure is treated as either static or time-varying, supposing the whole network is observed in the same time window. In this paper, we consider the epidemics spreading on a network which has both static and time-varying structures. Meanwhile, the time-varying part and the epidemic spreading are supposed to be of the same time scale. We introduce a static and activity-driven coupling (SADC) network model to characterize the coupling between the static (\"strong\") structure and the dynamic (\"weak\") structure. Epidemic thresholds of the SIS and SIR models are studied using the SADC model both analytically and numerically under various coupling strategies, where the strong structure is of homogeneous or heterogeneous degree distribution. Theoretical thresholds obtained from the SADC model can both recover and generalize the classical results in static and time-varying networks. It is demonstrated that a weak structure might make the epidemic threshold low in homogeneous networks but high in heterogeneous cases. Furthermore, we show that the weak structure has a substantive effect on the outbreak of the epidemics. This result might be useful in designing some efficient control strategies for epidemics spreading in networks.",
                    "citation": "Yanjun Lei, Xin Jiang, Quantong Guo... (2015). Contagion processes on the static and activity driven coupling networks. Physical review. E, 93 3, \n          032308\n        . DOI: 10.1103/PhysRevE.93.032308",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is demonstrated that a weak structure might make the epidemic threshold low in homogeneous networks but high in heterogeneous cases, and it is shown that the weak structure has a substantive effect on the outbreak of the epidemics."
                    }
                },
                {
                    "paper_title": "Impact of temporal connectivity patterns on epidemic process",
                    "abstract": "To provide a comprehensive view for dynamics of and on many real- world temporal networks, we investigate the interplay of temporal connectivity patterns and spreading phenomena, in terms of the susceptible-infected-removed (SIR) model on the modified activity-driven temporal network (ADTN) with memory. In particular, we focus on how the epidemic threshold of the SIR model is affected by the heterogeneity of nodal activities and the memory strength in temporal and static regimes, respectively. While strong ties (memory) between nodes inhibit the spread of epidemic to be localized, the heterogeneity of nodal activities enhances it to be globalized initially. Since the epidemic threshold of the SIR model is very sensitive to the degree distribution of nodes in static networks, we test the SIR model on the modified ADTNs with the possible set of the activity exponents and the memory exponents that generates the same degree distributions in temporal networks. We also discuss the role of spatiotemporal scaling properties of the largest cluster and the maximum degree in the epidemic threshold. It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network. This implies that there is the trade-off between the spreading time of epidemic and its outbreak size. Finally, we suggest the phase diagram of the SIR model on ADTNs and the optimal condition for the spread of epidemic under the circumstances.",
                    "citation": "Hyewon Kim, Meesoon Ha, Hawoong Jeong (2019). Impact of temporal connectivity patterns on epidemic process. The European Physical Journal B, 92. DOI: 10.1140/epjb/e2019-100159-1",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network, which implies that there is the trade-off between the spreading time of epidemic and its outbreak size."
                    }
                },
                {
                    "paper_title": "Risk assessment of Ebola virus disease spreading in Uganda using a two-layer temporal network",
                    "abstract": "Network-based modelling of infectious diseases apply compartmental models on a contact network, which makes the epidemic process crucially dependent on the network structure. For highly contagious diseases such as Ebola virus disease (EVD), interpersonal contact plays the most vital role in human-to-human transmission. Therefore, for accurate representation of EVD spreading, the contact network needs to resemble the reality. Prior research has mainly focused on static networks (only permanent contacts) or activity-driven networks (only temporal contacts) for Ebola spreading. A comprehensive network for EVD spreading should include both these network structures, as there are always some permanent contacts together with temporal contacts. Therefore, we propose a two-layer temporal network for Uganda, which is at risk of an Ebola outbreak from the neighboring Democratic Republic of Congo (DRC) epidemic. The network has a permanent layer representing permanent contacts among individuals within the family level, and a data-driven temporal network for human movements motivated by cattle trade, fish trade, or general communications. We propose a Gillespie algorithm with the susceptible-infected-recovered (SIR) compartmental model to simulate the evolution of EVD spreading as well as to evaluate the risk throughout our network. As an example, we applied our method to a network consisting of 23 districts along different movement routes in Uganda starting from bordering districts of the DRC to Kampala. Simulation results show that some regions are at higher risk of infection, suggesting some focal points for Ebola preparedness and providing direction to inform interventions in the field. Simulation results also show that decreasing physical contact as well as increasing preventive measures result in a reduction of chances to develop an outbreak. Overall, the main contribution of this paper lies in the novel method for risk assessment, which can be more precise with an increasing volume of accurate data for creating the network model.",
                    "citation": "Mahbubul H. Riad, M. Sekamatte, Felix Ocom... (2019). Risk assessment of Ebola virus disease spreading in Uganda using a two-layer temporal network. Scientific Reports, 9. DOI: 10.1038/s41598-019-52501-1",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel method for risk assessment that can be more precise with an increasing volume of accurate data for creating the network model is proposed, which shows that some regions are at higher risk of infection."
                    }
                },
                {
                    "paper_title": "Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics",
                    "abstract": "Most real networks have been found to evolve dynamically. In addition, heterogeneity of interaction strengths and individual’s memory have been proved to be important to affect network evolution in the area of complex networks. Based on a recent extension of the activity-driven modeling framework, i.e. activity-driven model with attractiveness, where individuals are characterized by their activities and attractiveness, we propose a new temporal network model by considering individuals’ memory. Similar to the previous network model, we also investigate heterogeneous distributions and different correlations between the two variables (activity and attractiveness). By numerical simulations, we illustrate the impact of memory on epidemic spreading processes unfolding on the proposed model. We find that, when individuals’ attractiveness is fixed, memory does not cause dramatic change on the epidemic threshold in the SIR process, but it inhibits the epidemic spreading by reducing the infected ratio. While for the SIS process, in the case of uncorrelated and positive correlations between the two variables, memory facilitates the epidemic outbreaks by shrinking the epidemic threshold. When the two variables are negatively correlated, memory does not take obvious impact on the epidemic threshold. Besides, for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength. It indicates that for the individuals with same activity, more attractive individuals will promote the disease spread. The findings deepen our understanding of the role of individuals’ memory and their attractiveness in the epidemic spreading process.",
                    "citation": "Mei Yang, B. Wang, Yuexing Han (2019). Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics. International Journal of Modern Physics C. DOI: 10.1142/S0129183119500116",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that for the individuals with same activity, more attractive individuals will promote the disease spread, and for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength."
                    }
                },
                {
                    "paper_title": "Risk assessment of Ebola virus disease spreading in Uganda using a multilayer temporal network",
                    "abstract": "Network-based modelling of infectious diseases apply compartmental models on a contact network, which makes the epidemic process crucially dependent on the network structure. For highly contagious diseases such as Ebola virus disease (EVD), the inter-personal contact plays the most vital role in the human to human transmission. Therefore, for accurate representation of the EVD spreading, the contact network needs to resemble the reality. Prior research work has mainly focused on static networks (only permanent contacts) or activity driven networks (only temporal contacts) for Ebola spreading. A comprehensive network for EVD spreading should include both these network structures, as there are always some permanent contacts together with temporal contacts. Therefore, we propose a multilayer temporal network for Uganda, which is at risk of Ebola outbreak from the neighboring Democratic Republic of Congo (DRC) epidemic. The network has a permanent layer representing permanent contacts among individuals within family level, and a data driven temporal network for human movements motivated by cattle trade, fish trade, or general communications. We propose a Gillespie algorithm with the susceptible-infected-recovered (SIR) compartmental model to simulate the evolution of the EVD spreading as well as to evaluate the risk throughout our network. As an example, we applied our method to a multilayer network consisting of 23 districts along different movement routes in Uganda starting from bordering districts of DRC to Kampala. Simulation results shows that some regions are at higher risk of infection, suggesting some focal points for Ebola preparedness and providing direction to inform interventions in the field. Simulation results also shows that decreasing physical contacts as well as increasing preventive measures result in a reduction of chances to develop an outbreak. Overall, the main contribution of this paper lies in the novel method for risk assessment, the accuracy of which can be increased by increasing the amount and the accuracy of the data used to build the network and the model.",
                    "citation": "Mahbubul H. Riad, M. Sekamatte, Felix Ocom... (2019). Risk assessment of Ebola virus disease spreading in Uganda using a multilayer temporal network. bioRxiv. DOI: 10.1101/645598",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A Gillespie algorithm with the susceptible-infected-recovered (SIR) compartmental model is proposed to simulate the evolution of the EVD spreading as well as to evaluate the risk throughout the network, which shows that some regions are at higher risk of infection."
                    }
                }
            ],
            "summary": ""
        }
    ]
}