{
    "results": [
        {
            "query": "activity-driven model epidemics simulation",
            "papers": [
                {
                    "paper_title": "Modeling Spreading Dynamics of Bilayer Networks Based on Community and Activity Driven",
                    "abstract": "Epidemic outbreaks in the real world are often accompanied by rapid information diffusion, which will change individual behavior patterns and affect the spread of epidemics. The community phenomenon in human society will also have an important impact on the spread of epidemics. This paper mainly considers the above factors to construct a new bilayer network. The activity-driven model is used to generate time-varying online information contact layer network and offline physical contact layer network. The information diffusion of individual online contact layer is used to affect the epidemic spreading dynamics of offline physical contact layer, and the individual mobility factor is used to control the community structure characteristics. In order to obtain the spreading dynamic equation of the whole network and analyze the spreading threshold of the network effectively, the Microscopic Markov Chain Approach (MMCA) is improved and extended to time-varying networks. Experimental verification using Monte Carlo simulation shows that the proposed method is highly accurate in predicting epidemic outbreak thresholds. The results show that individual mobility has no effect on the epidemic outbreak threshold, but it will affect the final number of infections in each community. The greater the individual contact ability of the online contact layer and the smaller the individual contact ability of the offline contact layer can effectively suppress the epidemic spread. The above findings can play an important reference for the effective prevention and control of epidemic transmission in the real world.",
                    "citation": "Shen Lifeng, Wang Jianbo, Du Zhanwei... (2023). Modeling Spreading Dynamics of Bilayer Networks Based on Community and Activity Driven. Acta Physica Sinica. DOI: 10.7498/aps.72.20222206",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The results show that individual mobility has no effect on the epidemic outbreak threshold, but it will affect the final number of infections in each community, which can play an important reference for the effective prevention and control of epidemic transmission in the real world."
                    }
                },
                {
                    "paper_title": "Weather-driven variation in dengue activity in Australia examined using a process-based modeling approach.",
                    "abstract": "The impact of weather variation on dengue transmission in Cairns, Australia, was determined by applying a process-based dengue simulation model (DENSiM) that incorporated local meteorologic, entomologic, and demographic data. Analysis showed that inter-annual weather variation is one of the significant determinants of dengue outbreak receptivity. Cross-correlation analyses showed that DENSiM simulated epidemics of similar relative magnitude and timing to those historically recorded in reported dengue cases in Cairns during 1991-2009, (r = 0.372, P < 0.01). The DENSiM model can now be used to study the potential impacts of future climate change on dengue transmission. Understanding the impact of climate variation on the geographic range, seasonality, and magnitude of dengue transmission will enhance development of adaptation strategies to minimize future disease burden in Australia.",
                    "citation": "M. Bannister-Tyrrell, C. Williams, S. Ritchie... (2013). Weather-driven variation in dengue activity in Australia examined using a process-based modeling approach.. The American journal of tropical medicine and hygiene, 88 1, \n          65-72\n        . DOI: 10.4269/ajtmh.2012.11-0451",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Understanding the impact of climate variation on the geographic range, seasonality, and magnitude of dengue transmission will enhance development of adaptation strategies to minimize future disease burden in Australia."
                    }
                },
                {
                    "paper_title": "Impact of different interaction behavior on epidemic spreading in time-dependent social networks",
                    "abstract": "We investigate the impact of pairwise and group interactions on the spread of epidemics through an activity-driven model based on time-dependent networks. The effects of pairwise/group interaction proportion and pairwise/group interaction intensity are explored by extensive simulation and theoretical analysis. It is demonstrated that altering the group interaction proportion can either hinder or enhance the spread of epidemics, depending on the relative social intensity of group and pairwise interactions. As the group interaction proportion decreases, the impact of reducing group social intensity diminishes. The ratio of group and pairwise social intensity can affect the effect of group interaction proportion on the scale of infection. A weak heterogeneous activity distribution can raise the epidemic threshold, and reduce the scale of infection. These results benefit the design of epidemic control strategy.",
                    "citation": "Shuai 帅 Huang 黄, J. Chen 陈, Meng-Yu 梦玉 Li 李... (2023). Impact of different interaction behavior on epidemic spreading in time-dependent social networks. Chinese Physics B, 33. DOI: 10.1088/1674-1056/ad147f",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is demonstrated that altering the group interaction proportion can either hinder or enhance the spread of epidemics, depending on the relative social intensity of group and pairwise interactions."
                    }
                },
                {
                    "paper_title": "Effect of behavioral changes on epidemic spreading in coupled simplicial activity driven networks",
                    "abstract": "Despite intensive studies on the epidemic spreading problem in social networks, both intra-group and inter-group interactions are represented as dyadic links. In this study, using coupled simplicial activity driven networks, we examine the impact of behavioral modification on epidemic propagation while taking into account various intra-group and inter-group interactions. The intra-group interactions are represented as simplicial structures, while the inter-group connections are represented as pairwise links. Two distinct types of behavioral changes are considered: (i) infected individuals decrease their activity due to self-quarantine, (ii) susceptible individuals limit their contacts due to self-protection. Numerical simulation and theoretical analysis reveal that both self-quarantine and self-protection behavior can effectively suppress epidemic spreading, leading to increased thresholds of epidemics and reduced steady-state fractions of infected individuals. Increasing the simplex size will lead to less protective effect of these behavioral changes, while enhancing pairwise connections between groups will not decrease the effect of behavioral changes.",
                    "citation": "Shuai Huang, Yuan-Hao Xu, Meng-Yu Li... (2023). Effect of behavioral changes on epidemic spreading in coupled simplicial activity driven networks. Journal of Statistical Mechanics: Theory and Experiment, 2023. DOI: 10.1088/1742-5468/ad0a83",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Numerical simulation and theoretical analysis reveal that both self-quarantine and self-protection behavior can effectively suppress epidemic spreading, leading to increased thresholds of epidemics and reduced steady-state fractions of infected individuals."
                    }
                },
                {
                    "paper_title": "Optimal Containment of Epidemics over Temporal Activity-Driven Networks",
                    "abstract": "In this paper, we study the dynamics of epidemic processes taking place in temporal and adaptive networks. Building on the activity-driven network model, we propose an adaptive model of epidemic processes, where the network topology dynamically changes due to both exogenous factors independent of the epidemic dynamics as well as endogenous preventive measures adopted by individuals in response to the state of the infection. A direct analysis of the model using Markov processes involves the spectral analysis of a transition probability matrix whose size grows exponentially with the number of nodes. To overcome this limitation, we derive an upper-bound on the decay rate of the number of infected nodes in terms of the eigenvalues of a $2 \\times 2$ matrix. Using this upper bound, we propose an efficient algorithm to tune the parameters describing the endogenous preventive measures in order to contain epidemics over time. We confirm our theoretical results via numerical simulations.",
                    "citation": "Masaki Ogura, V. Preciado, N. Masuda (2018). Optimal Containment of Epidemics over Temporal Activity-Driven Networks. ArXiv, abs/1802.08961. DOI: 10.1137/18M1172740",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "An adaptive model of epidemic processes is proposed, where the network topology dynamically changes due to both exogenous factors independent of the epidemic dynamics as well as endogenous preventive measures adopted by individuals in response to the state of the infection."
                    }
                },
                {
                    "paper_title": "Effect of self-excitement and behavioral factors on epidemics on activity driven networks",
                    "abstract": "In this paper, we deal with the problem of including real-world phenomena into a mathematically tractable framework for the spread of epidemics on time-varying networks. Specifically, we consider individual behavioral modifications of the node dynamics due to self-excitement mechanisms and activity reduction due to infection. We develop our model within the framework of activity driven networks, which have recently emerged as a powerful tool to study the co-evolution of a network and of a spreading processes on it. First, we present a recent model extension that allows for the inclusion of self-excitement mechanisms. Then, we extend the model by including activity reduction due to infection, and we study its effect on the network propensity to epidemic outbreaks. We determine that, depending on the relative strength of the two concurrent mechanisms (self-excitement and activity reduction due to infection), the network may favor or hinder the spread of an epidemic disease. We analytically characterize these two situations, depending on the model and network parameters. Numerical simulations are provided to support and extend our analytical findings.",
                    "citation": "Lorenzo Zino, A. Rizzo, M. Porfiri (2019). Effect of self-excitement and behavioral factors on epidemics on activity driven networks. 2019 18th European Control Conference (ECC), 1512-1517. DOI: 10.23919/ECC.2019.8795748",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is determined that, depending on the relative strength of the two concurrent mechanisms (self-excitement and activity reduction due to infection), the network may favor or hinder the spread of an epidemic disease."
                    }
                },
                {
                    "paper_title": "IMPACT OF COVID-19 EPIDEMICS ON BED REQUIREMENTS IN A HEALTHCARE CENTER USING DATA-DRIVEN DISCRETE-EVENT SIMULATION",
                    "abstract": null,
                    "citation": "K.-H. G. Bae, B. Feng, S. Kim... (2020). IMPACT OF COVID-19 EPIDEMICS ON BED REQUIREMENTS IN A HEALTHCARE CENTER USING DATA-DRIVEN DISCRETE-EVENT SIMULATION. . DOI: Unknown",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A new data-driven discrete-event simulation model based on data from a French university hospital to predict bed and staff requirements is proposed and a case study is proposed to illustrate the tool’s ability to monitor bed occupancy in the recovery unit given the admission rate of ED patients during the pandemic of Sars-Cov-2."
                    }
                }
            ],
            "summary": "I have reviewed the provided papers relevant to the query on “activity-driven model epidemics simulation.” Below is a scientific synthesis of key insights, highlighting methods, results, and implications with citations.\n\n---\n\n### Summary of Literature on Epidemic Spreading Simulation in Activity-Driven Networks\n\n1. **Activity-driven model and bilayer network coupling (Shen et al., 2023)**  \n   This study constructs a bilayer network integrating both an online information communication layer and an offline physical contact layer. Both layers are generated using an activity-driven model, which dynamically models time-varying contacts based on individual activity levels.  \n   - The interplay between rapid information diffusion (online) and epidemic spreading (offline) is captured, showing behavioral responses influence epidemic outcomes.  \n   - The Microscopic Markov Chain Approach (MMCA) is extended to time-varying networks, enabling derivation of dynamic epidemic threshold and final infection size predictions.  \n   - Key findings: Individual mobility does not alter epidemic outbreak thresholds but shapes infection distribution across communities; enhancing online contact activity while reducing offline physical contacts suppresses epidemics effectively.  \n   - Methodological Significance: The bilayer activity-driven approach realistically captures multiplex social interactions with behavioral feedback, beyond static or single-layer models.  \n   - Citation: Shen et al., *Acta Physica Sinica*, 2023, DOI: 10.7498/aps.72.20222206.\n\n2. **Interaction behavior effects in time-dependent social networks (Huang et al., 2023)**  \n   - Investigates pairwise vs. group interactions modeled via activity-driven networks with temporal dynamics.  \n   - Shows that the proportion and intensity of group versus pairwise interactions distinctly influence epidemic spread: group interactions can either hinder or facilitate outbreak depending on their relative social intensity.  \n   - Presence of weak heterogeneity in individual activities raises epidemic thresholds and reduces overall infection scale.  \n   - This work highlights the complexity of interaction patterns on epidemic outcomes and informs targeted control strategies by modulating social interaction types.  \n   - Citation: Huang et al., *Chinese Physics B*, 2023, DOI: 10.1088/1674-1056/ad147f.\n\n3. **Behavioral changes in coupled simplicial activity-driven networks (Huang et al., 2023)**  \n   - Extends activity-driven models to capture higher-order interactions via simplicial complexes representing intra-group connectivity, alongside pairwise inter-group links.  \n   - Two behavioral adaptations: infected individuals reduce activity (self-quarantine), susceptible individuals limit contacts (self-protection).  \n   - Both behaviors effectively suppress epidemic spread by increasing epidemic thresholds and lowering infection prevalence.  \n   - The protective effect diminishes as group (simplex) size increases, but strengthening inter-group pairwise links does not reduce behavioral benefits.  \n   - This model integrates realistic social behavioral adaptations impacting epidemic dynamics on time-varying, higher-order networks.  \n   - Citation: Huang et al., *Journal of Statistical Mechanics*, 2023, DOI: 10.1088/1742-5468/ad0a83.\n\n4. **Optimal epidemic containment over temporal activity-driven networks (Ogura et al., 2018)**  \n   - Proposes an adaptive network epidemic model where network topology evolves due to exogenous changes and endogenous behavioral responses to infection states.  \n   - Introduces a spectral method bounding infection decay rate by eigenanalysis of a low-dimensional matrix, circumventing computational explosion for large networks.  \n   - Derives algorithms optimizing behavioral parameters (e.g., social distancing intensities) to effectively contain epidemics in temporal activity-driven frameworks.  \n   - This analytical approach facilitates practical epidemic control strategy design on realistic adaptive temporal networks.  \n   - Citation: Ogura et al., *ArXiv*, 2018, DOI: 10.1137/18M1172740.\n\n5. **Inclusion of self-excitement and behavioral factors in activity-driven models (Zino et al., 2019)**  \n   - Extends the activity-driven framework by incorporating self-excitement (temporal clustering of contacts) and activity reduction due to infection status.  \n   - Demonstrates through analysis and simulation that the balance between heightened activity due to excitement and reduction from sickness governs epidemic potential.  \n   - Identifies threshold conditions where behavioral feedback either enhances or inhibits spread, adding realism to epidemic modeling on temporal networks.  \n   - Citation: Zino et al., *European Control Conference*, 2019, DOI:10.23919/ECC.2019.8795748.\n\n---\n\n### Integrated Insights and Scientific Contributions\n\n- **Modeling innovation:** The reviewed works collectively advance epidemic simulations by embedding activity-driven frameworks that allow time-varying, heterogeneous social contacts, adaptable behavior, and multiplex/higher-order interactions (bilayer and simplicial networks). These approaches improve upon static or purely dyadic static networks by capturing realistic social dynamics critical for epidemic propagation.  \n\n- **Behavioral dynamics as epidemic modulators:** Multiple papers underscore that behavioral responses (e.g., self-quarantine, self-protection, activity reduction on infection) strongly influence epidemic thresholds and outbreak sizes. Incorporating these into activity-driven models is crucial for fidelity in epidemic forecasts and intervention evaluations.  \n\n- **Control and containment strategies:** Spectral and Markovian analysis yields computationally tractable methods to estimate epidemic thresholds and design control policies in temporal activity-driven networks. Tailoring individual activity parameters and interaction modalities provides effective mechanisms to contain spread.  \n\n- **Importance of interaction structure:** Differentiation between pairwise and group interactions, and between online and offline contact layers, is vital. The structure and intensity of social interactions combined with individual mobility patterns produce complex epidemic outcomes informing targeted control measures.  \n\n---\n\n### Answer to Your Query: Activity-Driven Model Epidemic Simulation\n\nThe activity-driven modeling framework is extensively utilized to simulate epidemic spreading on temporal social networks by assigning individuals activity potentials that generate time-varying contacts. State-of-the-art studies (Shen et al., Huang et al.) extend this to multilayer networks combining online/offline interactions, and to include behavioral adaptations like self-quarantine reducing activity after infection. The models incorporate pairwise and higher-order (group) interactions, and dynamic behavioral feedback that modulates contact activity, enabling precise epidemic threshold calculation and prediction of outbreak sizes. Methods like the Microscopic Markov Chain Approach and spectral bounds enable analytical insights on epidemic thresholds and inform optimal intervention strategies. Importantly, variations in individual mobility and contact types substantially affect epidemic scale, while strategic enhancement or suppression of activity in different contact layers can effectively mitigate spread.\n\n---\n\n### References\n\n- Shen et al. (2023). Modeling Spreading Dynamics of Bilayer Networks Based on Community and Activity Driven. *Acta Physica Sinica*. DOI:10.7498/aps.72.20222206  \n- Huang et al. (2023). Impact of different interaction behavior on epidemic spreading in time-dependent social networks. *Chinese Physics B*. DOI:10.1088/1674-1056/ad147f  \n- Huang et al. (2023). Effect of behavioral changes on epidemic spreading in coupled simplicial activity driven networks. *J. Stat. Mech.* DOI:10.1088/1742-5468/ad0a83  \n- Ogura et al. (2018). Optimal Containment of Epidemics over Temporal Activity-Driven Networks. *ArXiv*. DOI:10.1137/18M1172740  \n- Zino et al. (2019). Effect of self-excitement and behavioral factors on epidemics on activity driven networks. *European Control Conference*. DOI:10.23919/ECC.2019.8795748  \n\n---\n\nIf you need detailed methodological explanations, simulation protocols, or specific parameter settings from any paper, please let me know."
        },
        {
            "query": "static random network epidemic SIR threshold aggregation temporal",
            "papers": [
                {
                    "paper_title": "Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone",
                    "abstract": "Activity-driven networks (ADNs) are a powerful paradigm to study epidemic spreading in temporal networks, where the dynamics of the disease and the evolution of the links share a common time-scale. One of the key assumptions of ADNs is the lack of preferential connections among individuals. This assumption hinders the application of ADNs to several realistic scenarios where some contacts persist in time, rather than intermittently activate. Here, we examine an improved modeling framework that superimposes an ADN to a static backbone network, toward the integration of persistent contacts with time-varying connections. To demonstrate the interplay between the ADN and the static backbone, we investigate the effect of behavioral changes on the disease dynamics. In this framework, each individual may adapt his/her activity as a function of the health status, thereby adjusting the relative weight of time-varying versus static links. To illustrate the approach, we consider two classes of backbone networks, Erdős-Rényi and random regular, and two disease models, SIS and SIR. A general mean-field theory is established for predicting the epidemic threshold, and numerical simulations are conducted to shed light on the role of network parameters on the epidemic spreading and estimate the epidemic size.",
                    "citation": "Matthieu Nadini, A. Rizzo, M. Porfiri (2020). Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone. IEEE Transactions on Network Science and Engineering, 7, 549-561. DOI: 10.1109/TNSE.2018.2885483",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "An improved modeling framework is examined that superimposes an ADN to a static backbone network, toward the integration of persistent contacts with time-varying connections and the effect of behavioral changes on the disease dynamics is investigated."
                    }
                },
                {
                    "paper_title": "Impact of temporal connectivity patterns on epidemic process",
                    "abstract": "To provide a comprehensive view for dynamics of and on many real- world temporal networks, we investigate the interplay of temporal connectivity patterns and spreading phenomena, in terms of the susceptible-infected-removed (SIR) model on the modified activity-driven temporal network (ADTN) with memory. In particular, we focus on how the epidemic threshold of the SIR model is affected by the heterogeneity of nodal activities and the memory strength in temporal and static regimes, respectively. While strong ties (memory) between nodes inhibit the spread of epidemic to be localized, the heterogeneity of nodal activities enhances it to be globalized initially. Since the epidemic threshold of the SIR model is very sensitive to the degree distribution of nodes in static networks, we test the SIR model on the modified ADTNs with the possible set of the activity exponents and the memory exponents that generates the same degree distributions in temporal networks. We also discuss the role of spatiotemporal scaling properties of the largest cluster and the maximum degree in the epidemic threshold. It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network. This implies that there is the trade-off between the spreading time of epidemic and its outbreak size. Finally, we suggest the phase diagram of the SIR model on ADTNs and the optimal condition for the spread of epidemic under the circumstances.",
                    "citation": "Hyewon Kim, Meesoon Ha, Hawoong Jeong (2019). Impact of temporal connectivity patterns on epidemic process. The European Physical Journal B, 92. DOI: 10.1140/epjb/e2019-100159-1",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network, which implies that there is the trade-off between the spreading time of epidemic and its outbreak size."
                    }
                },
                {
                    "paper_title": "Exploiting Temporal Network Structures of Human Interaction to Effectively Immunize Populations",
                    "abstract": "Decreasing the number of people who must be vaccinated to immunize a community against an infectious disease could both save resources and decrease outbreak sizes. A key to reaching such a lower threshold of immunization is to find and vaccinate people who, through their behavior, are more likely than average to become infected and to spread the disease further. Fortunately, the very behavior that makes these people important to vaccinate can help us to localize them. Earlier studies have shown that one can use previous contacts to find people that are central in static contact networks. However, real contact patterns are not static. In this paper, we investigate if there is additional information in the temporal contact structure for vaccination protocols to exploit. We answer this affirmative by proposing two immunization methods that exploit temporal correlations and showing that these methods outperform a benchmark static-network protocol in four empirical contact datasets under various epidemic scenarios. Both methods rely only on obtainable, local information, and can be implemented in practice. For the datasets directly related to contact patterns of potential disease spreading (of sexually-transmitted and nosocomial infections respectively), the most efficient protocol is to sample people at random and vaccinate their latest contacts. The network datasets are temporal, which enables us to make more realistic evaluations than earlier studies—we use only information about the past for the purpose of vaccination, and about the future to simulate disease outbreaks. Using analytically tractable models, we identify two temporal structures that explain how the protocols earn their efficiency in the empirical data. This paper is a first step towards real vaccination protocols that exploit temporal-network structure—future work is needed both to characterize the structure of real contact sequences and to devise immunization methods that exploit these.",
                    "citation": "Sungmin Lee, Luis E C Rocha, F. Liljeros... (2010). Exploiting Temporal Network Structures of Human Interaction to Effectively Immunize Populations. PLoS ONE, 7. DOI: 10.1371/journal.pone.0036439",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper proposes two immunization methods that exploit temporal correlations and shows that these methods outperform a benchmark static-network protocol in four empirical contact datasets under various epidemic scenarios."
                    }
                },
                {
                    "paper_title": "Dynamic-Sensitive centrality of nodes in temporal networks",
                    "abstract": "Locating influential nodes in temporal networks has attracted a lot of attention as data driven and diverse applications. Classic works either looked at analysing static networks or placed too much emphasis on the topological information but rarely highlighted the dynamics. In this paper, we take account the network dynamics and extend the concept of Dynamic-Sensitive centrality to temporal network. According to the empirical results on three real-world temporal networks and a theoretical temporal network for susceptible-infected-recovered (SIR) models, the temporal Dynamic-Sensitive centrality (TDC) is more accurate than both static versions and temporal versions of degree, closeness and betweenness centrality. As an application, we also use TDC to analyse the impact of time-order on spreading dynamics, we find that both topological structure and dynamics contribute the impact on the spreading influence of nodes, and the impact of time-order on spreading influence will be stronger when spreading rate b deviated from the epidemic threshold bc, especially for the temporal scale-free networks.",
                    "citation": "Da-Wen Huang, Zuguo Yu (2017). Dynamic-Sensitive centrality of nodes in temporal networks. Scientific Reports, 7. DOI: 10.1038/srep41454",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that both topological structure and dynamics contribute the impact on the spreading influence of nodes, and the impact of time-order on spreading influence will be stronger when spreading rate b deviated from the epidemic threshold bc, especially for the temporal scale-free networks."
                    }
                },
                {
                    "paper_title": "Simulated Epidemics in an Empirical Spatiotemporal Network of 50,185 Sexual Contacts",
                    "abstract": "Sexual contact patterns, both in their temporal and network structure, can influence the spread of sexually transmitted infections (STI). Most previous literature has focused on effects of network topology; few studies have addressed the role of temporal structure. We simulate disease spread using SI and SIR models on an empirical temporal network of sexual contacts in high-end prostitution. We compare these results with several other approaches, including randomization of the data, classic mean-field approaches, and static network simulations. We observe that epidemic dynamics in this contact structure have well-defined, rather high epidemic thresholds. Temporal effects create a broad distribution of outbreak sizes, even if the per-contact transmission probability is taken to its hypothetical maximum of 100%. In general, we conclude that the temporal correlations of our network accelerate outbreaks, especially in the early phase of the epidemics, while the network topology (apart from the contact-rate distribution) slows them down. We find that the temporal correlations of sexual contacts can significantly change simulated outbreaks in a large empirical sexual network. Thus, temporal structures are needed alongside network topology to fully understand the spread of STIs. On a side note, our simulations further suggest that the specific type of commercial sex we investigate is not a reservoir of major importance for HIV.",
                    "citation": "Luis E C Rocha, F. Liljeros, Petter Holme (2010). Simulated Epidemics in an Empirical Spatiotemporal Network of 50,185 Sexual Contacts. PLoS Computational Biology, 7. DOI: 10.1371/journal.pcbi.1001109",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that the temporal correlations of sexual contacts can significantly change simulated outbreaks in a large empirical sexual network, suggesting that temporal structures are needed alongside network topology to fully understand the spread of STIs."
                    }
                },
                {
                    "paper_title": "Epidemic thresholds in dynamic contact networks",
                    "abstract": null,
                    "citation": "E. Volz, L. Meyers (2009). Epidemic thresholds in dynamic contact networks. Journal of The Royal Society Interface, 6, 233 - 241. DOI: 10.1098/rsif.2008.0218",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is shown that social mixing fundamentally changes the epidemiological landscape and, consequently, that static network approximations of dynamic networks can be inadequate."
                    }
                },
                {
                    "paper_title": "Stability of Spreading Processes over Time-Varying Large-Scale Networks",
                    "abstract": "In this paper, we analyze the dynamics of spreading processes taking place over time-varying networks. A common approach to model time-varying networks is via Markovian random graph processes. This modeling approach presents the following limitation: Markovian random graphs can only replicate switching patterns with exponential inter-switching times, while in real applications these times are usually far from exponential. In this paper, we introduce a flexible and tractable extended family of processes able to replicate, with arbitrary accuracy, any distribution of inter-switching times. We then study the stability of spreading processes in this extended family. We first show that a direct analysis based on Itô's formula provides stability conditions in terms of the eigenvalues of a matrix whose size grows exponentially with the number of edges. To overcome this limitation, we derive alternative stability conditions involving the eigenvalues of a matrix whose size grows linearly with the number of nodes. Based on our results, we also show that heuristics based on aggregated static networks approximate the epidemic threshold more accurately as the number of nodes grows, or the temporal volatility of the random graph process is reduced. Finally, we illustrate our findings via numerical simulations.",
                    "citation": "Masaki Ogura, V. Preciado (2015). Stability of Spreading Processes over Time-Varying Large-Scale Networks. IEEE Transactions on Network Science and Engineering, 3, 44-57. DOI: 10.1109/TNSE.2016.2516346",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This paper introduces a flexible and tractable extended family of processes able to replicate, with arbitrary accuracy, any distribution of inter-switching times and studies the stability of spreading processes in this extended family."
                    }
                }
            ],
            "summary": "After carefully reviewing the papers relevant to your query on **static random network epidemic SIR threshold aggregation temporal**, I provide below an integrated scientific summary focusing on the role of temporal dynamics, aggregation of temporal networks into static networks, and epidemic threshold in SIR models on random or heterogeneous contact networks.\n\n---\n\n### Research Context and Key Concepts\n\n- Epidemic thresholds determine critical conditions (e.g., transmission rate) beyond which an infectious disease outbreak becomes an epidemic.  \n- Classical epidemic models (SIR, SIS) often assume **static networks**, where contacts are fixed over time with a defined topology (e.g., Erdős-Rényi, random regular networks).  \n- However, **real-world contacts are temporal**, with links activating and deactivating over time, showing memory, burstiness, and heterogeneity.  \n- Aggregating temporal contacts into static networks (e.g., over a time window) facilitates analysis but neglects temporal ordering and correlations that affect epidemic spread and thresholds.  \n- Modeling frameworks combining static backbones with activity-driven or temporal random networks have been proposed to capture persistent contacts alongside temporally intermittent ones.  \n\n---\n\n### Synthesis of Findings:\n\n1. **Static Backbone and Activity-Driven Temporal Overlay (Nadini et al., 2020)**  \n   - Extends classical activity-driven networks (ADNs) by superimposing them onto a **static backbone network** (e.g., Erdős-Rényi or random regular). The backbone represents persistent contacts, while the activity-driven overlay models time-varying contacts.  \n   - The epidemic dynamics depend on the relative balance between the static and temporal links, modulated by behavioral changes (adaptive activity based on health status).  \n   - A **mean-field theoretical framework** predicts epidemic thresholds for SIS and SIR models on this coupled temporal-static structure.  \n   - Key insight: Epidemic thresholds are shaped jointly by static network parameters (degree distribution, backbone density) and activity-driven parameters (activity rates), reflecting a more realistic combination of persistent and transient contacts.  \n   - Citation: Nadini et al., *IEEE Trans. on Network Science and Engineering*, 2020, DOI:10.1109/TNSE.2018.2885483\n\n2. **Impact of Temporal Connectivity and Memory on SIR Thresholds (Kim et al., 2019)**  \n   - Studies how temporal features such as **nodal activity heterogeneity** and **memory (link persistence)** influence the SIR epidemic threshold in **modified activity-driven temporal networks with memory (ADTN)**.  \n   - Strong memory (repeated contacts) inhibits broad epidemic spread by localizing infection, effectively increasing epidemic thresholds.  \n   - High heterogeneity in node activity lowers thresholds, facilitating initial outbreak but limiting the final epidemic size—a trade-off between speed of spread and total infections.  \n   - Aggregated degree distributions approximate static network thresholds but lose important temporal correlations affecting spreading dynamics.  \n   - Citation: Kim et al., *Eur. Phys. J. B*, 2019, DOI:10.1140/epjb/e2019-100159-1\n\n3. **Temporal Correlations vs. Static Network Approximations (Ogura and Preciado, 2015)**  \n   - Present a theoretical framework analyzing **stability (and thresholds) of spreading processes over time-varying networks** modeled by Markovian random graphs and their extensions allowing arbitrary inter-switching times.  \n   - Show that direct eigenvalue-based stability analysis on the full temporal system is computationally hard (grows exponentially with edges), but approximate criteria using spectral properties of aggregated static network matrices become accurate under certain conditions, such as:  \n     - Large network size  \n     - Low temporal volatility (slow switching)  \n   - This justifies the use of **aggregated static networks as proxies for temporal networks** in estimating epidemic thresholds when temporal variability is low or networks large.  \n   - Citation: Ogura and Preciado, *IEEE Trans. on Network Science and Engineering*, 2015, DOI:10.1109/TNSE.2016.2516346\n\n4. **Empirical Evidence: Temporal Structures Affect Threshold and Outbreak Size (Rocha et al., 2010)**  \n   - Simulations on an empirical sexual contact network show that temporal correlations accelerate early outbreaks, yet network topology and contact rate heterogeneity dominate the final epidemic size and threshold.  \n   - Epidemic thresholds in temporal networks can be well-defined but differ quantitatively from static network approximations, underscoring the need to consider temporal ordering and burstiness.  \n   - Citation: Rocha et al., *PLoS Computational Biology*, 2010, DOI:10.1371/journal.pcbi.1001109\n\n5. **Vaccination Strategies Leveraging Temporal Network Information (Lee et al., 2010)**  \n   - Propose immunization protocols exploiting temporal information, such as recent contact patterns, rather than relying solely on static contact network centralities.  \n   - This highlights the importance of temporal contacts and their aggregation in designing control strategies and understanding effective epidemic thresholds relative to static approximations.  \n   - Citation: Lee et al., *PLoS ONE*, 2010, DOI:10.1371/journal.pone.0036439\n\n---\n\n### Integrative Discussion on Epidemic Thresholds in Static vs. Temporal Networks with Aggregation\n\n- **Epidemic threshold in static random networks (e.g., Erdős-Rényi, random regular) is classically tied to the inverse of the largest eigenvalue or average degree (degree distribution moments).**  \n- When temporal dynamics are superimposed, **aggregation over the temporal dimension yields a weighted static network whose structure heavily influences threshold estimates.** But temporal correlations like burstiness, memory, and order of contacts can either raise or lower the effective threshold compared to purely aggregated networks.  \n\n- **Models combining static backbones with temporal activity-driven overlays allow studying the co-existence of stable persistent connections and ephemeral contacts.** This hybrid model reflects more realistic social systems and enables theoretical threshold derivation through mean-field approximations and MMCA methods.\n\n- **Temporal heterogeneity and memory can inhibit or facilitate spreading:** Strong memory/local repeated contacts localize contagion (increasing thresholds), while highly active hubs decrease thresholds facilitating outbreak.\n\n- **Approximate stability criteria based on aggregated static networks become more accurate with increasing network size or decreasing temporal volatility.** This suggests aggregation is a useful but approximate tool; detailed temporal data is needed for precision.\n\n- **Empirical and simulation evidence confirm that temporal network features accelerate initial outbreaks, modulate epidemic size, and significantly impact thresholds compared to static assumptions.**\n\n---\n\n### Summary Answer to Your Query\n\nThe integration of **static random network structures (Erdős-Rényi, random regular) with temporal contact dynamics** through **activity-driven models with aggregation approaches** provides a powerful framework for analyzing SIR epidemic thresholds. The presence of a static backbone captures persistent contacts, while temporal activity-driven components represent intermittent contacts. Analytical mean-field theories and spectral analysis establish epidemic thresholds considering this interplay.\n\nAggregation of temporal networks into static weighted networks facilitates threshold estimation but may overlook critical temporal correlations. The epidemic threshold in such aggregated networks depends on the degree distribution and node activity heterogeneity; however, temporal features such as memory and burstiness can alter outbreak size, speed, and threshold.\n\nFinally, the accuracy of approximating epidemic thresholds via aggregation improves with network size and reduced temporal fluctuations, but detailed temporal modeling provides better predictive power for control strategies.\n\n---\n\n### Key References\n\n- Nadini et al. (2020). Epidemic Spreading in Temporal and Adaptive Networks with Static Backbone. *IEEE Trans. Netw. Sci. Eng.*, 7(2):549-561. DOI:10.1109/TNSE.2018.2885483  \n- Kim et al. (2019). Impact of temporal connectivity patterns on epidemic process. *Eur. Phys. J. B*, 92:74. DOI:10.1140/epjb/e2019-100159-1  \n- Ogura & Preciado (2015). Stability of Spreading Processes over Time-Varying Large-Scale Networks. *IEEE Trans. Netw. Sci. Eng.*, 3(1):44-57. DOI:10.1109/TNSE.2016.2516346  \n- Rocha et al. (2010). Simulated Epidemics in an Empirical Spatiotemporal Network of 50,185 Sexual Contacts. *PLoS Comput Biol*, 6(3):e1001109. DOI:10.1371/journal.pcbi.1001109  \n- Lee et al. (2010). Exploiting Temporal Network Structures of Human Interaction to Effectively Immunize Populations. *PLoS ONE*, 7(5):e36439. DOI:10.1371/journal.pone.0036439\n\n---\n\nIf you require quantitative details such as explicit threshold formulae, stability conditions, or simulation parameter regimes from any specific paper cited, please indicate."
        },
        {
            "query": "SIR model epidemic threshold activity-driven network",
            "papers": [
                {
                    "paper_title": "Impact of temporal connectivity patterns on epidemic process",
                    "abstract": "To provide a comprehensive view for dynamics of and on many real- world temporal networks, we investigate the interplay of temporal connectivity patterns and spreading phenomena, in terms of the susceptible-infected-removed (SIR) model on the modified activity-driven temporal network (ADTN) with memory. In particular, we focus on how the epidemic threshold of the SIR model is affected by the heterogeneity of nodal activities and the memory strength in temporal and static regimes, respectively. While strong ties (memory) between nodes inhibit the spread of epidemic to be localized, the heterogeneity of nodal activities enhances it to be globalized initially. Since the epidemic threshold of the SIR model is very sensitive to the degree distribution of nodes in static networks, we test the SIR model on the modified ADTNs with the possible set of the activity exponents and the memory exponents that generates the same degree distributions in temporal networks. We also discuss the role of spatiotemporal scaling properties of the largest cluster and the maximum degree in the epidemic threshold. It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network. This implies that there is the trade-off between the spreading time of epidemic and its outbreak size. Finally, we suggest the phase diagram of the SIR model on ADTNs and the optimal condition for the spread of epidemic under the circumstances.",
                    "citation": "Hyewon Kim, Meesoon Ha, Hawoong Jeong (2019). Impact of temporal connectivity patterns on epidemic process. The European Physical Journal B, 92. DOI: 10.1140/epjb/e2019-100159-1",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is observed that the presence of highly active nodes enables to trigger the initial spread of epidemic in a short period of time, but it also limits its final spread to the entire network, which implies that there is the trade-off between the spreading time of epidemic and its outbreak size."
                    }
                },
                {
                    "paper_title": "Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics",
                    "abstract": "Most real networks have been found to evolve dynamically. In addition, heterogeneity of interaction strengths and individual’s memory have been proved to be important to affect network evolution in the area of complex networks. Based on a recent extension of the activity-driven modeling framework, i.e. activity-driven model with attractiveness, where individuals are characterized by their activities and attractiveness, we propose a new temporal network model by considering individuals’ memory. Similar to the previous network model, we also investigate heterogeneous distributions and different correlations between the two variables (activity and attractiveness). By numerical simulations, we illustrate the impact of memory on epidemic spreading processes unfolding on the proposed model. We find that, when individuals’ attractiveness is fixed, memory does not cause dramatic change on the epidemic threshold in the SIR process, but it inhibits the epidemic spreading by reducing the infected ratio. While for the SIS process, in the case of uncorrelated and positive correlations between the two variables, memory facilitates the epidemic outbreaks by shrinking the epidemic threshold. When the two variables are negatively correlated, memory does not take obvious impact on the epidemic threshold. Besides, for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength. It indicates that for the individuals with same activity, more attractive individuals will promote the disease spread. The findings deepen our understanding of the role of individuals’ memory and their attractiveness in the epidemic spreading process.",
                    "citation": "Mei Yang, B. Wang, Yuexing Han (2019). Joint effect of individual’s memory and attractiveness in temporal network on spreading dynamics. International Journal of Modern Physics C. DOI: 10.1142/S0129183119500116",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "It is found that for the individuals with same activity, more attractive individuals will promote the disease spread, and for the two processes unfolding on the network with and without memory, the propagation threshold decreases with the enhancement of the positive correlation, however, it almost does not get much influence from the negative correlation strength."
                    }
                },
                {
                    "paper_title": "Mathematical Approach for Estimating the Effective Reproductive Number for COVID-19 in Nepal with Data-Driven SIR Model",
                    "abstract": "The Effective Reproduction Number (Rt) is a critical parameter for understanding infectious disease dynamics and informing public health interventions. This study introduces a methodological framework for estimating Rt to analyze COVID-19 transmission dynamics in Nepal. The observational approach uses the data of the COVID-19 in Nepal within a Susceptible-Infected-Removed (SIR) model, excluding vital dynamics. The time-dependent transmission and recovery rates are calculated using the data in the model equations, and then these parameters, along with epidemic data, are fed into an Long Short Term Memory (LSTM) neural network, which learns temporal patterns from the data to improve prediction accuracy. The LSTM predicted parameters are applied into the formula to estimate Rt derived by the Next Generation Matrix method. The estimated values of Rt are validated against empirically observed data. Model performance is assessed using multiple metrics including mean absolute error (MAE), mean square error (MSE), root mean square error (RMSE) and coefficient of determination (r2) to quantify the accuracy of predictions. This methodology enables quantitative assessment of epidemic trajectories and control measures, contributing to our understanding of COVID-19 dynamics in Nepal.",
                    "citation": "Shiva Hari Subedi, Gyan Bahadur Thapa (2024). Mathematical Approach for Estimating the Effective Reproductive Number for COVID-19 in Nepal with Data-Driven SIR Model. Nepal Journal of Mathematical Sciences. DOI: 10.3126/njmathsci.v5i1.76447",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This study introduces a methodological framework for estimating Rt to analyze COVID-19 transmission dynamics in Nepal and enables quantitative assessment of epidemic trajectories and control measures, contributing to the understanding of COVID-19 dynamics in Nepal."
                    }
                },
                {
                    "paper_title": "Activity-driven network modeling and control of the spread of two concurrent epidemic strains",
                    "abstract": "The emergency generated by the current COVID-19 pandemic has claimed millions of lives worldwide. There have been multiple waves across the globe that emerged as a result of new variants, due to arising from unavoidable mutations. The existing network toolbox to study epidemic spreading cannot be readily adapted to the study of multiple, coexisting strains. In this context, particularly lacking are models that could elucidate re-infection with the same strain or a different strain—phenomena that we are seeing experiencing more and more with COVID-19. Here, we establish a novel mathematical model to study the simultaneous spreading of two strains over a class of temporal networks. We build on the classical susceptible–exposed–infectious–removed model, by incorporating additional states that account for infections and re-infections with multiple strains. The temporal network is based on the activity-driven network paradigm, which has emerged as a model of choice to study dynamic processes that unfold at a time scale comparable to the network evolution. We draw analytical insight from the dynamics of the stochastic network systems through a mean-field approach, which allows for characterizing the onset of different behavioral phenotypes (non-epidemic, epidemic, and endemic). To demonstrate the practical use of the model, we examine an intermittent stay-at-home containment strategy, in which a fraction of the population is randomly required to isolate for a fixed period of time.",
                    "citation": "D. Burbano, Lorenzo Zino, S. Butail... (2022). Activity-driven network modeling and control of the spread of two concurrent epidemic strains. Applied Network Science, 7. DOI: 10.1007/s41109-022-00507-6",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel mathematical model to study the simultaneous spreading of two strains over a class of temporal networks is established, based on the classical susceptible–exposed–infectious–removed model, by incorporating additional states that account for infections and re-infections with multiple strains."
                    }
                },
                {
                    "paper_title": "Global analysis of a network-based SIR epidemic model with a saturated treatment function",
                    "abstract": "In this paper, we study a network-based SIR epidemic model with a saturated treatment function in which a parameter [Formula: see text] is introduced to measure the extent of the effect of the infected being delayed for treatment. Our aim is to present a global analysis and to investigate how the parameter [Formula: see text] affects the spreading of diseases. Our main results are as follows: (1) In the case of the threshold value [Formula: see text], there exist two values of [Formula: see text]: [Formula: see text] and [Formula: see text], such that the disease-free equilibrium is globally asymptotically stable when [Formula: see text] and multiple endemic equilibria exist when [Formula: see text]. This means that the parameter [Formula: see text] has an essential influence on the spreading of the disease. (2) In the case of the threshold value [Formula: see text], if the model has only one endemic equilibrium, then the unique endemic equilibrium is globally attractive. In this case, it is also proved that if [Formula: see text], then the endemic equilibrium has only one, so is globally attractive. In addition, numerical simulation is performed to illustrate our theoretical results.",
                    "citation": "Xiaodan Wei (2024). Global analysis of a network-based SIR epidemic model with a saturated treatment function. International Journal of Biomathematics. DOI: 10.1142/s1793524523501127",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": null
                    }
                },
                {
                    "paper_title": "An Agent-Based Model in Activity-Driven Network of COVID-19 Epidemic using Mobility and Infection Data in Tokyo 2020 Suggesting Practical Vaccine Strategies and Vaccine Passport",
                    "abstract": null,
                    "citation": "Kazumoto Takayanagi, S. Kurahashi (2021). An Agent-Based Model in Activity-Driven Network of COVID-19 Epidemic using Mobility and Infection Data in Tokyo 2020 Suggesting Practical Vaccine Strategies and Vaccine Passport. . DOI: Unknown",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Supervised Learning Epidemic Threshold of SIR Model in Complex Networks",
                    "abstract": null,
                    "citation": "Jie Kang, M. Tang (2021). Supervised Learning Epidemic Threshold of SIR Model in Complex Networks. Wireless Technology, Intelligent Network Technologies, Smart Services and Applications. DOI: 10.1007/978-981-16-5168-7_16",
                    "summary (tldr)": null
                }
            ],
            "summary": ""
        },
        {
            "query": "Activity-driven network static counterpart epidemic spread",
            "papers": [
                {
                    "paper_title": "Activity-driven network modeling and control of the spread of two concurrent epidemic strains",
                    "abstract": "The emergency generated by the current COVID-19 pandemic has claimed millions of lives worldwide. There have been multiple waves across the globe that emerged as a result of new variants, due to arising from unavoidable mutations. The existing network toolbox to study epidemic spreading cannot be readily adapted to the study of multiple, coexisting strains. In this context, particularly lacking are models that could elucidate re-infection with the same strain or a different strain—phenomena that we are seeing experiencing more and more with COVID-19. Here, we establish a novel mathematical model to study the simultaneous spreading of two strains over a class of temporal networks. We build on the classical susceptible–exposed–infectious–removed model, by incorporating additional states that account for infections and re-infections with multiple strains. The temporal network is based on the activity-driven network paradigm, which has emerged as a model of choice to study dynamic processes that unfold at a time scale comparable to the network evolution. We draw analytical insight from the dynamics of the stochastic network systems through a mean-field approach, which allows for characterizing the onset of different behavioral phenotypes (non-epidemic, epidemic, and endemic). To demonstrate the practical use of the model, we examine an intermittent stay-at-home containment strategy, in which a fraction of the population is randomly required to isolate for a fixed period of time.",
                    "citation": "D. Burbano, Lorenzo Zino, S. Butail... (2022). Activity-driven network modeling and control of the spread of two concurrent epidemic strains. Applied Network Science, 7. DOI: 10.1007/s41109-022-00507-6",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A novel mathematical model to study the simultaneous spreading of two strains over a class of temporal networks is established, based on the classical susceptible–exposed–infectious–removed model, by incorporating additional states that account for infections and re-infections with multiple strains."
                    }
                },
                {
                    "paper_title": "Optimizing information-driven awareness allocation for controlling activity-triggered epidemic spread",
                    "abstract": "In the contemporary era, the advent of epidemics instigates a substantial upswing in relevant information dissemination, bolstering individuals’ resistance to infection by concurrently reducing activity contacts and reinforcing personal protective measures. To elucidate this intricate dynamics, we introduce a composite four-layer network model designed to capture the interplay among information-driven awareness, human activity, and epidemic spread, with a focus on the allocation of individuals’ limited attention in diminishing activity frequency and self-infection rates. One intriguing observation from our findings is an anomalous, concave non-monotonic relationship between awareness trade-off and epidemic spread, with a more pronounced prevalence at an intermediate least awareness efficacy. This underscores the inadvisability of relaxing self-protection through reduced activity frequency or compensating for increased activity frequency by enhancing self-protection. Especially noteworthy is the significance of enhancing self-protection in response to heightened information dissemination and inherent activity demands to curtail infection risk. However, in scenarios with increasing ancillary activity frequency, the emphasis should exclusively shift towards reducing activity exposure. The model establishes a theoretical threshold for accurately predicting awareness efficacy in epidemic outbreaks. Optimal awareness allocation consistently resides at the extremes—either completely avoiding unnecessary activity contact or adopting full self-protection. This guidance, contingent on information level and activity demand, offers valuable insights into the delicate balance between individual behaviors and epidemic prevention.",
                    "citation": "Jie Chen, Maobin Hu, Jinde Cao (2024). Optimizing information-driven awareness allocation for controlling activity-triggered epidemic spread. New Journal of Physics, 26. DOI: 10.1088/1367-2630/ad5b7f",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A composite four-layer network model designed to capture the interplay among information-driven awareness, human activity, and epidemic spread, with a focus on the allocation of individuals’ limited attention in diminishing activity frequency and self-infection rates offers valuable insights into the delicate balance between individual behaviors and epidemic prevention."
                    }
                },
                {
                    "paper_title": "Impact of simplicial complexes on epidemic spreading in partially mapping activity-driven multiplex networks.",
                    "abstract": "Over the past decade, the coupled spread of information and epidemic on multiplex networks has become an active and interesting topic. Recently, it has been shown that stationary and pairwise interactions have limitations in describing inter-individual interactions , and thus, the introduction of higher-order representation is significant. To this end, we present a new two-layer activity-driven network epidemic model, which considers the partial mapping relationship among nodes across two layers and simultaneously introduces simplicial complexes into one layer, to investigate the effect of 2-simplex and inter-layer mapping rate on epidemic transmission. In this model, the top network, called the virtual information layer, characterizes information dissemination in online social networks, where information can be diffused through simplicial complexes and/or pairwise interactions. The bottom network, named as the physical contact layer, denotes the spread of infectious diseases in real-world social networks. It is noteworthy that the correspondence among nodes between two networks is not one-to-one but partial mapping. Then, a theoretical analysis using the microscopic Markov chain (MMC) method is performed to obtain the outbreak threshold of epidemics, and extensive Monte Carlo (MC) simulations are also carried out to validate the theoretical predictions. It is obviously shown that MMC method can be used to estimate the epidemic threshold; meanwhile, the inclusion of simplicial complexes in the virtual layer or introductory partial mapping relationship between layers can inhibit the spread of epidemics. Current results are conducive to understanding the coupling behaviors between epidemics and disease-related information.",
                    "citation": "Shuofan Zhang, Dawei Zhao, Cheng-yi Xia... (2023). Impact of simplicial complexes on epidemic spreading in partially mapping activity-driven multiplex networks.. Chaos, 33 6. DOI: 10.1063/5.0151881",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A new two-layer activity-driven network epidemic model is presented, which considers the partial mapping relationship among nodes across two layers and simultaneously introduces simplicial complexes into one layer, to investigate the effect of 2-simplex and inter-layer mapping rate on epidemic transmission."
                    }
                },
                {
                    "paper_title": "Impact of competing opinions on epidemic spread: a virus transmission model with denier and vigilant groups in activity-driven networks",
                    "abstract": null,
                    "citation": "Yuhan Tang, Shidong Zhai, Jiyu Zhang... (2025). Impact of competing opinions on epidemic spread: a virus transmission model with denier and vigilant groups in activity-driven networks. Nonlinear Dynamics. DOI: 10.1007/s11071-025-11506-4",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "Impact of environmental factors on the coevolution of information–emotions–epidemic dynamics in activity-driven multiplex networks",
                    "abstract": "During public health emergencies, the diffusion of negative information can exacerbate the transmission of adverse emotions, such as fear and anxiety. These emotions can adversely affect immune function and, consequently, influence the spread of the epidemic. In this study, we established a coupled model incorporating environmental factors to explore the coevolution dynamic process of information–emotions–epidemic dynamics in activity-driven multiplex networks. In this model, environmental factors refer to the external conditions or pressures that affect the spread of information, emotions, and epidemics. These factors include media coverage, public opinion, and the prevalence of diseases in the neighborhood. These layers are dynamically cross-coupled, where the environmental factors in the information layer are influenced by the emotional layer; the higher the levels of anxious states among neighboring individuals, the greater the likelihood of information diffusion. Although environmental factors in the emotional layer are influenced by both the information and epidemic layers, they come from the factors of global information and the proportion of local infections among surrounding neighbors. Subsequently, we utilized the microscopic Markov chain approach to describe the dynamic processes, thereby obtaining the epidemic threshold. Finally, conclusions are drawn through numerical modeling and analysis. The conclusions suggest that when negative information increases, the probability of the transmission of anxious states across the population increases. The transmission of anxious states increases the final size of the disease and decreases its outbreak threshold. Reducing the impact of environmental factors at both the informational and emotional levels is beneficial for controlling the scale of the spread of the epidemic. Our findings can provide a reference for improving public health awareness and behavioral decision-making, mitigating the adverse impacts of anxious states, and ultimately controlling the spread of epidemics.",
                    "citation": "L. Huo 霍, Bingjie 炳杰 Liu 刘, Xiaomin 晓敏 Zhao 赵 (2024). Impact of environmental factors on the coevolution of information–emotions–epidemic dynamics in activity-driven multiplex networks. Chinese Physics B, 33. DOI: 10.1088/1674-1056/ad7df5",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A coupled model incorporating environmental factors to explore the coevolution dynamic process of information–emotions–epidemic dynamics in activity-driven multiplex networks suggests that when negative information increases, the probability of the transmission of anxious states across the population increases."
                    }
                },
                {
                    "paper_title": "How the heterogeneous infection rate effect on the epidemic spreading in activity-driven network",
                    "abstract": "In this paper, we research the impact of the heterogeneous infection rate on the epidemic spread in the activity-driven networks. By using the mean field approximation, the epidemic threshold is theoretically obtained. Several immunization strategies that could curb the epidemic spread are presented. Based on the theoretical analysis and simulation results, we obtain that the epidemic would be prevented effectively if the infection rate strongly correlates with the individual activity. However, if infection rate has a little correlation with the individual activity, most of the individuals may be infected. In addition, the epidemic can be suppressed soon if the individuals with high activity are immunized preferentially.",
                    "citation": "Dun Han, Dandan Li, Chao Chen... (2016). How the heterogeneous infection rate effect on the epidemic spreading in activity-driven network. International Journal of Modern Physics C, 27, 1650057. DOI: 10.1142/S0129183116500571",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "Using the mean field approximation, the epidemic threshold is theoretically obtained and it is obtained that the epidemic would be prevented effectively if the infection rate strongly correlates with the individual activity, however, if infection rate has a little correlation with theindividual activity, most of the individuals may be infected."
                    }
                },
                {
                    "paper_title": "The interplay between disease spreading and awareness diffusion in multiplex networks with activity-driven structure.",
                    "abstract": "The interplay between disease and awareness has been extensively studied in static networks. However, most networks in reality will evolve over time. Based on this, we propose a novel epidemiological model in multiplex networks. In this model, the disease spreading layer is a time-varying network generated by the activity-driven model, while the awareness diffusion layer is a static network, and the heterogeneity of individual infection and recovery ability is considered. First, we extend the microscopic Markov chain approach to analytically obtain the epidemic threshold of the model. Then, we simulate the spread of disease and find that stronger heterogeneity in the individual activities of a physical layer can promote disease spreading, while stronger heterogeneity of the virtual layer network will hinder the spread of disease. Interestingly, we find that when the individual infection ability follows Gaussian distribution, the heterogeneity of infection ability has little effect on the spread of disease, but it will significantly affect the epidemic threshold when the individual infection ability follows power-law distribution. Finally, we find the emergence of a metacritical point where the diffusion of awareness is able to control the onset of the epidemics. Our research could cast some light on exploring the dynamics of epidemic spreading in time-varying multiplex networks.",
                    "citation": "Jiaxin Wang, Chun Yang, Bo-Wen Chen (2022). The interplay between disease spreading and awareness diffusion in multiplex networks with activity-driven structure.. Chaos, 32 7, \n          073104\n        . DOI: 10.1063/5.0087404",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This research finds the emergence of a metacritical point where the diffusion of awareness is able to control the onset of the epidemics and could cast some light on exploring the dynamics of epidemic spreading in time-varying multiplex networks."
                    }
                }
            ],
            "summary": ""
        },
        {
            "query": "Mapping R0 SIR temporal static network",
            "papers": [
                {
                    "paper_title": "Convolutional Neural Network Shows Greater Spatial and Temporal Stability in Multi-Annual Land Cover Mapping Than Pixel-Based Methods",
                    "abstract": "Satellite imagery is the only feasible approach to annual monitoring and reporting on land cover change. Unfortunately, conventional pixel-based classification methods based on spectral response only (e.g., using random forests algorithms) have shown a lack of spatial and temporal stability due, for instance, to variability between individual pixels and changes in vegetation condition, respectively. Machine learning methods that consider spatial patterns in addition to reflectance can address some of these issues. In this study, a convolutional neural network (CNN) model, U-Net, was trained for a 500 km × 500 km region in southeast Australia using annual Landsat geomedian data for the relatively dry and wet years of 2018 and 2020, respectively. The label data for model training was an eight-class classification inferred from a static land-use map, enhanced using forest-extent mapping. Here, we wished to analyse the benefits of CNN-based land cover mapping and reporting over 34 years (1987–2020). We used the trained model to generate annual land cover maps for a 100 km × 100 km tile near the Australian Capital Territory. We developed innovative diagnostic methods to assess spatial and temporal stability, analysed how the CNN method differs from pixel-based mapping and compared it with two reference land cover products available for some years. Our U-Net CNN results showed better spatial and temporal stability with, respectively, overall accuracy of 89% verses 82% for reference pixel-based mapping, and 76% of pixels unchanged over 33 years. This gave a clearer insight into where and when land cover change occurred compared to reference mapping, where only 30% of pixels were conserved. Remaining issues include edge effects associated with the CNN method and a limited ability to distinguish some land cover types (e.g., broadacre crops vs. pasture). We conclude that the CNN model was better for understanding broad-scale land cover change, use in environmental accounting and natural resource management, whereas pixel-based approaches sometimes more accurately represented small-scale changes in land cover.",
                    "citation": "T. Boston, A. Dijk, R. Thackway (2023). Convolutional Neural Network Shows Greater Spatial and Temporal Stability in Multi-Annual Land Cover Mapping Than Pixel-Based Methods. Remote. Sens., 15, 2132. DOI: 10.3390/rs15082132",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The CNN model was better for understanding broad-scale land cover change, use in environmental accounting and natural resource management, whereas pixel-based approaches sometimes more accurately represented small-scale changes in land cover."
                    }
                },
                {
                    "paper_title": "Temporal-Mapping Photography for Event Cameras",
                    "abstract": "Event cameras, or Dynamic Vision Sensors (DVS) are novel neuromorphic sensors that capture brightness changes as a continuous stream of\"events\"rather than traditional intensity frames. Converting sparse events to dense intensity frames faithfully has long been an ill-posed problem. Previous methods have primarily focused on converting events to video in dynamic scenes or with a moving camera. In this paper, for the first time, we realize events to dense intensity image conversion using a stationary event camera in static scenes with a transmittance adjustment device for brightness modulation. Different from traditional methods that mainly rely on event integration, the proposed Event-Based Temporal Mapping Photography (EvTemMap) measures the time of event emitting for each pixel. Then, the resulting Temporal Matrix is converted to an intensity frame with a temporal mapping neural network. At the hardware level, the proposed EvTemMap is implemented by combining a transmittance adjustment device with a DVS, named Adjustable Transmittance Dynamic Vision Sensor (AT-DVS). Additionally, we collected TemMat dataset under various conditions including low-light and high dynamic range scenes. The experimental results showcase the high dynamic range, fine-grained details, and high-grayscale resolution of the proposed EvTemMap. The code and dataset are available in https://github.com/YuHanBaozju/EvTemMap",
                    "citation": "Yuhan Bao, Lei Sun, Yuqin Ma... (2024). Temporal-Mapping Photography for Event Cameras. . DOI: 10.48550/arXiv.2403.06443",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "For the first time, for the first time, it is realized that events to dense intensity image conversion using a stationary event camera in static scenes with a transmittance adjustment device for brightness modulation is realized."
                    }
                },
                {
                    "paper_title": "Mapping temporal-network percolation to weighted, static event graphs",
                    "abstract": "The dynamics of diffusion-like processes on temporal networks are influenced by correlations in the times of contacts. This influence is particularly strong for processes where the spreading agent has a limited lifetime at nodes: disease spreading (recovery time), diffusion of rumors (lifetime of information), and passenger routing (maximum acceptable time between transfers). We introduce weighted event graphs as a powerful and fast framework for studying connectivity determined by time-respecting paths where the allowed waiting times between contacts have an upper limit. We study percolation on the weighted event graphs and in the underlying temporal networks, with simulated and real-world networks. We show that this type of temporal-network percolation is analogous to directed percolation, and that it can be characterized by multiple order parameters.",
                    "citation": "Mikko Kivelä, Jordan Cambe, J. Saramäki... (2017). Mapping temporal-network percolation to weighted, static event graphs. Scientific Reports, 8. DOI: 10.1038/s41598-018-29577-2",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": null
                    }
                },
                {
                    "paper_title": "Few-Shot Fuzzy Temporal Knowledge Graph Completion via Fuzzy Semantics and Dynamic Attention Network",
                    "abstract": "Few-shot temporal knowledge graph completion (TKGC) aims to predict missing facts in temporal knowledge graphs (TKGs) when each relation has a limited number of available samples. Existing few-shot TKGC models primarily face two challenges. First, entities and relations in TKGs typically exhibit dynamic characteristics, and those models often adopt static neighbor information to improve their semantic representations, so the noise in neighbor information may be amplified. Second, those models mainly focus on crisp entities and relations, yet real-world facts are often fuzzy, rendering them ineffective at capturing fuzzy semantic information. To solve these challenges, this article investigates a novel method for modeling fuzzy TKGs information in a vector space and proposes a framework for few-shot fuzzy temporal knowledge graph completion. Specifically, we devise a dynamic attention neighbor aggregator and time-aware fuzzy mapping framework. These components facilitate the integration of semantic information from neighborhood relations and generate fuzzy membership degrees to describe the fuzzy information. Additionally, we integrate an error-aware feature extractor within the meta-learning framework, effectively addressing errors during the learning process. Extensive experiments show that our model achieves outstanding results across different few-shot settings, obtaining performance gains of 4.2%, 13.6% in terms of MRR and Hits@10, respectively, on the ICEWS0515-ff dataset, and 2.9%, 10.2% on the ICEWS18-ff dataset.",
                    "citation": "Xuanxuan An, Luyi Bai, Longlong Zhou... (2024). Few-Shot Fuzzy Temporal Knowledge Graph Completion via Fuzzy Semantics and Dynamic Attention Network. IEEE Transactions on Fuzzy Systems, 32, 6329-6339. DOI: 10.1109/TFUZZ.2024.3447003",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "This article investigates a novel method for modeling fuzzy TKGs information in a vector space and proposes a framework for few-shot fuzzy temporal knowledge graph completion with a dynamic attention neighbor aggregator and time-aware fuzzy mapping framework."
                    }
                },
                {
                    "paper_title": "Spatial-Temporal Contextual Aggregation Siamese Network for UAV Tracking",
                    "abstract": "In recent years, many studies have used Siamese networks (SNs) for UAV tracking. However, there are two problems with SNs for UAV tracking. Firstly, the information sources of the SNs are the invariable template patch and the current search frame. The static template information lacks the perception of dynamic feature information flow, and the shallow feature extraction and linear sequential mapping severely limit the mining of feature expressiveness. This makes it difficult for many existing SNs to cope with the challenges of UAV tracking, such as scale variation and viewpoint change caused by the change in height and angle of the UAV, and the challenges of background clutter and occlusion caused by complex aviation backgrounds. Secondly, the SNs trackers for UAV tracking still struggle with extracting lightweight and effective features. A tracker with a heavy-weighted backbone is not welcome due to the limited computing power of the UAV platform. Therefore, we propose a lightweight spatial-temporal contextual Siamese tracking system for UAV tracking (SiamST). The proposed SiamST improves the UAV tracking performance by augmenting the horizontal spatial information and introducing vertical temporal information to the Siamese network. Specifically, a high-order multiscale spatial module is designed to extract multiscale remote high-order spatial information, and a temporal template transformer introduces temporal contextual information for dynamic template updating. The evaluation and contrast results of the proposed SiamST with many state-of-the-art trackers on three UAV benchmarks show that the proposed SiamST is efficient and lightweight.",
                    "citation": "Qiqi Chen, Xuan Wang, Faxue Liu... (2024). Spatial-Temporal Contextual Aggregation Siamese Network for UAV Tracking. Drones. DOI: 10.3390/drones8090433",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "The proposed SiamST improves the UAV tracking performance by augmenting the horizontal spatial information and introducing vertical temporal information to the Siamese network by augmenting the horizontal spatial information and introducing vertical temporal information to the Siamese network."
                    }
                },
                {
                    "paper_title": "Multipath Effects Mitigation in Offshore Construction Platform GNSS-RTK Displacement Monitoring Using Parametric Temporal Convolution Network",
                    "abstract": "The Global Navigation Satellite System (GNSS), renowned for its high precision and automation, has shone brightly in the deformation monitoring of offshore facilities and sea-crossing bridges. However, antennas placed in these locations are often subject to signal interference from various reflective surfaces, such as rivers and oceans, which significantly compromises observation accuracy and reliability. Synthesizing previous research, we first propose a method for multipath dataset construction, which involves GNSS observation linear combinations, detailed mapping of the near-field reflector, and employed static solution residuals as reference. Subsequently, we construct and train a corresponding para-TCN (parametric Temporal Convolution Network) to enable real-time prediction of multipath prediction. Through time domain and frequency domain analysis, it has been demonstrated that the trained network can capture the main features of multipath models and suppress those components in both the data distribution and frequency band, effectively mitigating the interference of multipath errors in observations.",
                    "citation": "Yiyang Jiang, Cheng Guo, Jinfeng Wang... (2025). Multipath Effects Mitigation in Offshore Construction Platform GNSS-RTK Displacement Monitoring Using Parametric Temporal Convolution Network. Remote Sensing. DOI: 10.3390/rs17040601",
                    "summary (tldr)": null
                },
                {
                    "paper_title": "TNSAR: Temporal Evolution Network Embedding Based on Structural and Attribute Retention",
                    "abstract": "Network embedding (NE) focuses on mapping each node within a network into a condensed vector representation of lower dimensional, while simultaneously retaining the original network structure and attribute features as faithfully as possible. It applies to a wide range of tasks of network mining, including link prediction, node classification, user recommendation, etc. Most existing network embedding models primarily aim at static networks, which require node knowledge in the full-time span. However, various real-world network is dynamic, and the nodes in the network change frequently. Although dynamic network embedding has garnered attention from a limited number of researchers, their approach has been restricted to learning node representations in isolation, without considering the integration of higher-order topological structure and attribute features of the nodes. To better address the above problems, a Temporal Evolution Network Embedding Model based on Structural and Attributes Retention (TNSAR) is proposed. In summary, our contributions include Introducing the graph decomposition technique for capturing global higher-order topological features, including higher-order structure, a fusion of attribute and topological information in the Graph Convolutional Network (GCN) network for node representation, and the temporal preservation component. The experimental results validate the effectiveness of TNSAR in network embedding tasks, showcasing its superiority over baseline methods.",
                    "citation": "Wenan Tan, Weinan Niu, Wei Jia... (2023). TNSAR: Temporal Evolution Network Embedding Based on Structural and Attribute Retention. IEEE Transactions on Services Computing, 16, 4418-4431. DOI: 10.1109/TSC.2023.3322588",
                    "summary (tldr)": {
                        "model": "tldr@v2.0.0",
                        "text": "A Temporal Evolution Network Embedding Model based on Structural and Attributes Retention (TNSAR) is proposed, which introduces the graph decomposition technique for capturing global higher-order topological features, including higher-order structure and attribute features, and the temporal preservation component."
                    }
                }
            ],
            "summary": ""
        }
    ]
}